[["The Cheese Cake Factory at the mall is fantastic!", "food"], [" I like that it's in the mall because you can burn off some calories while shopping  We went there mainly for the cheesecakes and tried the Original Cheesecake, Chocolate Tuxedo Cream …", "food"], ["I went to the Cheesecake Factory which is a nice go to for lunch or a date .", "atmosphere"], [" On this visit, we parked in a nearby garage that charges for parking.", "parking"], [" We waited 15-20 minutes to be seated.", "service"], [" Our server, Eli, took care of our order fairly …", "service"], ["We tried multiple items on the menu - Avocado egg rolls, veg pasta, pizza & the fresh strawberry cheesecake, but the only dish that was delicious was cheesecake.", "food"], [" Rest everything was dry or not so fresh.", "food"], [" Our server missed to get a few items …", "service"], ["The food was plentiful and delicious, but the service from some of the staff was disappointing.", "service"], [" I understand it was busy but even after seeing us, two of servers just passed by.", "service"], [" Also we asked for the check, but she didn't even bother to listen.", "service"], [" So disrespectful for the customer.", "service"], ["Fantastic place, lovely food, and everything served with a smile.", "service"], [" Our server noted and took care of every modification that was requested.", "service"], [" Food itself was delicious and we stuffed ourselves beyond reason.", "food"], ["Can't go wrong with this spot!", "none"], [" There is typically a wait at this location so I'd recommend making a reservation in advance of getting here.", "none"], [" Service is great, staff is great.", "service"], [" Place is kept clean and family friendly - I'd recommend!", "hygiene"], ["I had lunch at the Cheesecake Factory and it was good.", "food"], ["\nThe Guava Daiquiri was my favorite.", "food"], [" It is a must try!", "none"], [" I was full so I didn’t get any of the cheesecake  but if I go Again it a must try because they look so …", "food"], ["My experience  was appetizing.", "food"], [" The food is a very good portion.", "food"], [" The cocktails are great.", "food"], ["Average, just as expected from a regular Cheesecake Factory.", "food"], [" Went in because there’s not much of an option at the mall.", "location"], [" We ordered the wings for apps which I think were kinda salty.", "food"], [" The servers were nice but they got the orders from other …", "service"], ["Quite a nice experience!", "atmosphere"], [" Place was not crowded, even being a Saturday, and we were seated fast enough.", "None"], [" The girl serving us was nice and patient, even we taking longer to order.", "service"], [" The \"little house salad\" is not little at all!", "food"], [" We had pasta and a steak, and both were delicious.", "food"], [" As a plus, the music was so lovely!", "atmosphere"], ["The service and food was amazing!", "food, service"], [" One of the best cheesecake I have had.", "food"], [" I recommend the 30th Anniversary Cheesecake.", "food"], [" However the price of the food is very expensive", "food"], ["20, I want to know where the rest of my \"tower\" cake is.", "none"], ["  This slice was so thin in comparison to the slices I've bought at other Cheesecake factories.", "food"], ["  I spoke too soon when I praised this location before.", "location"], ["   I also bought carrot …", "food"], ["Even though some of the food was really good the service was a big let down.", "service"], ["\n\nWe went in and got a table fairly quickly.", "service"], [" The server came quickly and took the …", "service"], ["This place is always amazing!", "atmosphere"], [" I love their food .", "food"], [" They have so many choices and big servings.", "food"], ["  I ordered the Louisiana chicken w pasta dish and it did NOT DISAPPOINT!", "food"], ["  for appetizers we had the buffalo chicken wings with the sauce (md hot) …", "food"], ["Good but not great.", "None"], [" Visited with family 2 adults 2 children but ended up ordering 4 brunch meals as kids menu seemed underwhelming.", "food"], [" Egg Benedict with Avo, bacon was dripping in grease which was off putting however the large Belgian waffle & pancakes was good.", "food"], [" First and last visit sadly as for $100 brunch it disappointed.", "food"], ["Typical of what you'd expect of your usual Cheesecake Factory.", "food"], [" The food seems to be smaller in portion from what I remember last time, which is sad, especially for the prices, but still good.", "food"], ["Good ambiance and place to dine in.", "atmosphere"], [" Place was not crowded .", "atmosphere"], [" We waited 15 minutes to be seated .", "service"], [" The service and food was amazing", "food"], ["Had the crispy fried cheese to start they were great.", "food"], [" He had the chicken Bellagio and he loved it.", "food"], [" I had the chicken Cesar salad.", "food"], [" It was okay.", "none"], [" The chicken was dry and rubbery.", "food"], [" It could have had more dressing.", "Food"], [" They have Coke Zero that is …", "food"], ["First time going to happy hour here.", "atmosphere"], [" Sat at the bar, which was great!", "atmosphere"], [" Clean, nice bartenders, great happy hour menu & pricing.", "food"], [" I had a glass of Cabernet, chicken samosas (excellent flavor), and spinach/cheese dip w/ chips.", "food"], [" Only reason for 4 …", "Service"], ["The Cheesecake Factory is located in the Newport Mall, which is convenient.", "location"], [" The restaurant is quite spacious but we were there on a Friday night, so it took a while to get a table.", "location"], [" We have ordered a carbonara pasta, Korean fried chicken …", "food"], ["The food at this Cheesecake factory tasted a lot better than the others I had in Philadelphia, San Francisco, Santa Clara, and Richmond.", "food"], ["Food was pretty good.", "food"], [" Tried something new.", "food"], [" Korean fried chicken and bang bang chicken and shrimp.", "food"], [" Had the guava daquiri and it was super sweet.", "food"], [" Atmosphere is beautiful and service was good.", "atmosphere"], [" Came here for our anniversary.", "atmosphere"], ["Just like any cheesecake factory, near the mall.", "location"], [" Wait times are reasonable.", "service"], ["\nFood quality is good and portion size is really good.", "Food"], ["\nInterior is also good and its nice to shop by the mall and eat there.", "atmosphere"], [" The prices …", "food"], ["The Flavor Factory in the heart of Jersey City.", "location"], [" The place is welcoming and the flavor is world class.", "Atmosphere"], [" Very delicious in general but my top recommendation is this.", "food"], [" Get Avocado egg roll as an appetizer and feed yourself with Shrimp and …", "food"], ["Ordered the chicken waffle eggs benedict.", "food"], [" The portion size was big and the meal was definitely filling, but I thought the food was mid.", "food"], [" The chicken did not taste freshly fried, but more like frozen chicken that had been reheated.", "food"], ["This is one of our go to places.", "none"], [" 5 mins walk from our house.", "location"], [" Restaurant is located inside the newport mall.", "location"], [" The ambience, the seating everything is just perfect.", "atmosphere"], ["Enjoyed the pastas and the refreshing drinks at the Cheesecake Factory.", "food"], [" Great ambiance for a restaurant located inside Newport Mall.", "atmosphere"], [" Highly recommend!", "none"], ["delicious food (Spaghetti Carbonara, Louisiana Chicken Pasta and Cheesecake) and friendly service", "food"], ["Excellent price with good portions.", "food"], [" I ordered the salad and it was good.", "food"], ["\nThe cheesecakes were good.", "food"], [" Just the crush seems too sweet for me.", "food"], [" \nMy co-workers enjoyed their pasta and sandwiches too.", "food"], ["One of the coziest places i have been too.", "atmosphere"], [" Ambience is very good.", "atmosphere"], [" Separate sitting areas so you can chat easily with your partner.", "atmosphere"], [" Nice selection of pasta and wine.", "food"], [" We tried chicken chiptole pasta and five cheese pasta.", "food"], [" Both were extremely …", "none"], ["Can never get enough of this place.", "atmosphere"], [" Their brunch menu is Uh-mazing and we always get stuffed with goodness each time we’re there.", "food"], [" The servers are kind and friendly.", "service"], [" The location is perfect as you can always burn the extra calories with some retail therapy right after indulging in deliciousness.", "location"], ["I had amazing veggie burger and sweet corn tamale cakes!", "food"], [" And as usual their cheesecake is awesome!", "food"], ["Walked in at 9:38 and SIGNS SAY 11pm Closing time.", "none"], ["\nRUDE bartender with pixie cut hair and Hispanic  rudely says “NOPE WEREE CLOSED BAR IS CLOSED” before we even walked up and said anything at all.", "Service"], [" Horrible customer service stood at the host stand for 20 mins before she rudely approached us.", "service"], ["Simply amazing.", "atmosphere"], [" So in love with the shrimp and chicken gumbo.", "food"], [" Can't wait to go back.", "none"], ["Great place.", "atmosphere"], [" Large menu, clean, friendly and quick service.", "food"], [" Our server Duante was super knowledgeable and friendly.", "service"], [" We will definitely be back.", "none"], ["The pasta was undercooked and the sauce was watered to look like there was more.", "Food"], [" If you don’t wanna make the food don’t allow deliver 1h30 minutes before closing.", "service"], [" It looks like they just scrapped whatever was left off of peoples plates and put it in my order.", "food"], ["The spinach appetizer is my favorite and i always choose cheesecake factory when i visit USA", "food"], ["Easy for me to swim across The Hudson to New Jersey from Manhattan to satisfy my cheesecake craving.", "none"], [" I still go back n forth between Tennessee & New York.", "none"], [" This was taken last week as I knew I would start sharing my experiences as I see them through my eyes.", "none"], ["Visited this outlet 4 times by now.", "none"], [" Probably my most visited place in Jersey city.", "location"], [" The service is really good and the staff is polite.", "service"], [" They are helpful as well.", "service"], [" The ambience in this restaurant is good and has a feel good factor here.", "atmosphere"], ["Upon entry, as a party of 3 we had no wait.", "none"], [" A hostess named Cassandra took us from the stand to sit us down.", "service"], [" First she brung us outside and I asked her if we could sit inside, she immediately got an attitude almost knocking the silverware …", "service"], ["Good ambiance, nice options of cakes, enough seating, good service, nice and friendly staff, good interiors.", "atmosphere"], [" Complimentary bread was fresh and tasty, food was excellent and warm, enjoyed our lunch.", "food"], ["Had an elaborate meal at The Cheesecake Factory a fortnight ago.", "food"], [" Got there at  12:30 and  was no waiting.", "none"], ["\nHad Factory Nachos which were really good, Mac N Cheese which was too bland, …", "food"], ["Took forever for the waiter to take our order but the food was great!", "service"], [" First time at this location but I might come here more often!", "atmosphere"], ["The ambiance is undeniably delightful, offering a tranquil setting for both group gatherings and solitary dining.", "atmosphere"], [" My first visit exceeded my expectations, ultimately resulting in an absolutely fantastic dining experience.", "Atmosphere"], ["Everything was delicious.", "food"], [" Our server was a very kind man!", "service"], [" I don’t remember his name but he had a slight accent and said he’s been working at that place for six months.", "service"], [" We absolutely loved it.", "none"], [" Excellent for my birthday dinner", "atmosphere"], ["Amazing like always!", "none"], [" the food is just right and the service is better!", "food, service"], [" we got the Cobb salad, dynamite shrimp, Korean cauliflower and Louisiana chicken pasta.", "food"], [" everything was perfect but the pasta needed more sauce.", "food"], [" we had the original cheesecake which was yumm like usual.", "food"], ["Worst experience more than 2 hrs of wait even after reservations.", "service"], [" After 2 hrs wait and order finally got two know some of the food we ordered is not available letting us know after another half an hour of ordering .", "service"], ["5 hrs without …", "none"], ["Located in a fairly bankrupt malls the restaurant has no parking.", "parking"], [" The only parking available is a paid indoor garage type and is expensive.", "parking"], ["00 to park, wait twenty minutes to have a seat and another twenty minutes to have the …", "service"], ["I ordered the Unlimited Red Velvet Cake Cheesecake … seriously, it was incredible.", "food"], [" That’s the real cheesecake, which it worth to travel for.", "food"], [" Every time, I cross by, I have to stop for a chase cake at The Cheesecake Factory.", "food"], ["Yum yum YUM!", "food"], [" It was great food, super satisfied.", "food"], ["Good ambience and place to dine in.", "atmosphere"], [" The foods great, especially avocado egg roll in appetizers.", "food"], [" Chicken Madeira is good.", "food"], [" Fresh baked bread with butter is really nice …", "food"], ["Not Bad but not great.", "none"], [" I feel is over rated but nice to spend time munching out of home.", "food"], [" Ambience was nice to dine but we took out.", "Atmosphere"], [" Taste was nice as well.", "food"], [" Again nothing great .", "None"], [" Will dine-in in future and update if my views change", "none"], ["Amazing atmosphere, tinted warm lights, lots of booths.", "atmosphere"], [" Bar in the back.", "atmosphere"], [" 10/10 for atmosphere.", "atmosphere"], [" My veggie burger was amazing.", "food"], [" They were very flexible with our menu adjustments which is awesome.", "service"], [" The bread on veggie burger was so soft and …", "food"], ["Cheesecake Factory is definitely not gourmet, but they have so many selections anyone can find a dish here that they like.", "food"], ["  I had the Skinnylicious Soft-shell Chicken Tacos and they were very good.", "food"], ["  I recommend them.", "none"], ["  Drinks here are always …", "food"], ["Prices are a bit pricey but food is good as well as portion sizes.", "food"], [" Very relaxing atmosphere and the staff was very knowledgeable and friendly.", "atmosphere"], [" I was there for lunch and it wasn't busy.", "atmosphere"], [" The decor has lots of wood so it celt warm and homey.", "atmosphere"], [" Of course the best cheesecake  …", "food"], ["Waited almost an hour for pasta and a burger.", "food"], [" The staff does NOT wear a mask.", "hygiene"], [" Not even the server when they talk to you.", "service"], [" Great job management!", "service"], ["  I will never come back.", "service"], [" I would rather starve.", "food"], ["  Also, I got the burger 20 minutes after I got my …", "food"], ["The food is medicore.", "food"], [" This is my first time eating here and i would never again.", "service"], [" The appetizers and the main course was not what I expected nor the food.", "food"], ["I had to send back my pasta and shrimp and get somehting else because of how bland it …", "food"], ["Love the Cheesecake Factory!", "food"], [" The food is always delicious and service is great.", "food"], [" Our waitress was so kind.", "service"], [" My daughter had a terrible headache and she gave her something to help.", "none"], [" It’s a bit pricey but it’s a treat!", "food"], ["The atmosphere is genuinely delightful, providing a serene backdrop for both social gatherings and solitary dining.", "atmosphere"], [" My inaugural visit surpassed my expectations, culminating in an absolutely fantastic dining experience.", "food"], ["Cannot get enough of this place.", "atmosphere"], [" The cakes are obviously good.", "food"], [" But the other items on the menu are just as good if not better.", "food"], [" Never had a bad experience with the food here this far.", "food"], [" Ordered the avocado toast this time around and oh what a …", "food"], ["A decent casual dining restaurant where never disappointed us.", "food"], [" As they always serve us delicious food by friendly staff with relaxing dining atmosphere.", "food"], ["On a Friday at 9pm for my party of 2 the wait was only 15 minutes, a pleasant surprise.", "none"], [" We got seated in a booth as per request and when our waitress, Jasmine comes to greet us, the first thing I notice she does not have a mask.", "hygiene"], [" I was taken …", "service"], ["First time coming here and honestly it was an amazing experience and while it was a little bit expensive the food tasted amazing and was honestly still worth the price!", "food"], [" Also if you're coming here you have to try their cheesecakes there's so …", "food"], ["Not a good experience, The family went to brunch, requested a seating that is brighter because my mom has a low vision.", "atmosphere"], [" We were seated at the back, it dim and dark.", "atmosphere"], [" There was a brighter table which I discovered later.", "atmosphere"], [" The food was …", "food"], ["I was not really impressed.", "none"], [" The Appetizer (texmex Rolls) was amazing.", "food"], [" But the main course (Alfredo chicken & broccoli chicken Pasta) Just wasnt it!", "food"], [" We didnt even ate the half of it, it was greasy and really not delicious.", "food"], ["So right off the bad they sat my family at a table with severely chipped edges so we had to be cautious with the kids.", "Hygiene"], [" Next it took very long to have someone attend to us for drinks-  I asked for 7 drinks total, they only brought out 5 and …", "service"], ["The restaurant was packed and they were short of help so they didn't have a lot of the options in the menu, it took almost an hour for us to be able to eat something but the manager offer a complimentary dish so I guess it wasn't that bad.", "Service"], ["Always a great time with family!", "atmosphere"], [" The food is so good my only complaint would be that there’s hardly ever a time that there’s any space in my belly for dessert but in those instances we always take the dessert to go!", "food"], [" Definitely recommend ", "none"], ["I had the Thai Coconut Lime Chicken and it was better than I could have ever imagined.", "food"], [" The sweet fried coconut flakes were absolutely delicious.", "food"], [" The chicken pieces were meh but the curry was outstanding.", "food"], [" Who would have thought pineapple …", "food"], ["Another fantastic experience at the Cheesecake Factory.", "atmosphere"], [" Although this has been my favorite restaurant for decades, I finally tried the Original cheesecake and who knew!", "food"], [" It’s absolutely wonderful.", "atmosphere"], [" I am so obsessed with this beautiful place.", "atmosphere"], ["Bought some slices for take out, tipped over 15%.", "service"], [" Then discovered I was charged for more slices than I ordered.", "service"], [" Tried to resolve the mistake on the spot, waited for 10 minutes, after which they told me they would refund the erroneous charge …", "service"], ["Be cautious when considering this location for the cheesecake factory.", "location"], [" The servers here are highly unprofessional, disorganized, and behave like a street gang.", "service"], [" It's unbelievable that they engage in conversations filled with dirty words and …", "hygiene"], ["Had a great lunch here.", "food"], [" Huge selection and quality food.", "food"], [" Took two pieces of cheesecake for a evening dessert.", "food"], ["  Will return.", "none"], ["Great food, service, and atmosphere!", "food, service, atmosphere"], [" Love that it’s in the mall - makes it easier to walk off the calories  I got the Mexican salad from the skinnylicious menu and loved it!", "location"], [" My partner got the meatloaf and also loved it but felt guilty …", "food"], ["BEST COCKTAIL DRINKS YOU CAN EVER GET IN MANHATTAN NY!", "food"], [" they are in New jersey , I'm trying to find an excuse to go to NJ every time so I can travel from manhattan and having best drinks and food, Ordered the coconut mojito that …", "food"], ["Very delicious ordered cheesecake strawberry price is 11 $, very recommended,  cashier was very helpful and smiles", "food"], ["Good taste and ambience along with good service.", "food"], [" Not a place for large groups though", "none"], ["I had a blast that day.", "none"], [" Everything was perfect - from the food to the staff.", "service"], [" I was there for hours, and I didn't feel like I was being rushed out, like some places will do.", "service"], [" After 3 hours or so, my friend and I decided to get dessert, one we ate, and another to go.", "food"], [" If I stayed longer, I would have probably had dinner that same day.", "none"], ["Ordered appetizers ; Mac and cheese fried balls , Street corn , and an avocado beet “salad “that I wish I would have took a picture of and a cappuccino to start off and it was horrible.", "food"], [" Cappuccino was cold and milky !", "food"], [" Didn’t even drink it …", "none"], ["Me and my classmates from elementary school met here for dinner with our 8th grade teacher for her birthday!", "atmosphere"], [" It was great seeing everyone after over 30 years!", "none"], [" Amazing food and lots of catching up.", "food"], [" Thanks cheesecake Factory for hosting such a memorable experience.", "atmosphere"], ["The food was subpar, but it was the service that was horrendous.", "service"], [" Our servers name was “precious”.", "service"], [" She took forever to bring out drinks and food.", "service"], [" IT WAS 2pm ON A TUESDAY.", "none"], [" We were pretty much the only ones there.", "atmosphere"], [" When we told her that we were …", "none"], ["Loved this place.", "atmosphere"], [" Food was really great and the portions were really huge.", "food"], [" 2nd time we took one dish per couple.", "food"], [" Cheesecakes are absolutely amazing and there are tens of flavours.", "food"], [" Highly recommend this place!", "none"], ["This is the first and the only Cheesecake Factory I've been to so I can't really compare it with their other outlets but my experience has been really good.", "food"], [" The drinks were good.", "food"], [" We ordered chicken pot stickers which were delicious.", "food"], ["Came back recently and had a disappointing experience.", "service"], [" I had ordered the Carne Asada steak dish and one of the steak medallions on the plate was still mooing.", "food"], [" I mentioned it to the waitress who apologized but didn't offer to have the piece …", "service"], ["Received the most ignorant service at this place.", "service"], [" We were asked to wait for 20 mins for a table while they were empty and then after 30mins we were given to sit at the same tables.", "service"], [" It took another 10mins for the waiter to come ask for us.", "service"], ["Unfortunately I can’t give less than one star.", "service"], [" I order BBQ ranch Salad from this location.", "food"], [" When I opened my order I saw that there small insect eggs on the leaf of the salad.", "hygiene"], ["Excellent prices for such great portions.", "food"], [" The ceiling decorations are so pretty.", "atmosphere"], [" Beautiful restaurant within Newport Mall.", "location"], [" You can come to eat to relax after a long day of shopping.", "atmosphere"], ["This restaurant does not take reservations on the weekends (this includes Fridays) however we only had to wait about 20 mins for a party of 7 on a Friday night at 8pm.", "None"], ["  Our server was friendly and attentive.", "service"], ["  I did notice something floating …", "Hygiene"], ["hi my name is shawn i was served by a young lady named nyasia.", "service"], ["  overall experience was fine just certain things needed to be corrected.", "none"], ["  i had ordered the cauliflower bites and never received them.", "food"], ["  on of my friends at the table waited the …", "Service"], ["Amazing options for food menu.", "food"], [" Very hard to choose.", "none"], [" We had a few of their pasta dishes.", "food"], [" Great veggie burger for the vegetarian in our group.", "food"], [" He said best he has had.", "food"], ["It was okay.", "none"], ["\nFor some reason.", "none"], [" They put me and my fiance all the way in the back corner.", "atmosphere"], [" I don't know if it was a race issue, because place was empty and there were plenty of …", "None"], ["Recommend.", "None."], [" It was a crowded afternoon and service was relatively slow however, the staff did everything possible to offset the long wait for food and drinks that appeared to be from a lack of employees on duty.", "service"], [" They were as pleasant and as …", "service"], ["This one is located inside Newport mall.", "location"], [" This is pretty much similar to any other cheesecake factory.", "food"], ["Great food and good service.", "food"], [" Made booking online in the morning for a party of 5.", "none"], [" Were seated on time and received great service from Chris.", "service"], [" Ordered couple of appetizers (factory nacho and Avacado nacho) which were both awesome.", "food"], ["The servers at this branch act like a bunch of school kids who've just dropped out.", "service"], [" They lack basic respect and proper training.", "service"], [" They murmur when they pass by customers, shout, and laugh loudly.", "atmosphere"], [" The server who attended to us tonight took …", "service"], ["I love the food & nice staff, but it feels like you're in a cave and need a headlamp to see your partner from across the table.", "atmosphere"], [" Also feels like you're at Coachella with how loud the music is.", "atmosphere"], [" If you like that sort of thing, then this is the place for you.", "atmosphere"], ["Great place with a great ambiance.", "atmosphere"], [" Their menu however it's very extensive and doesn't do a very good job of explaining good items.", "food"], [" The food however is very good.", "food"], [" I ordered a chicken pot pie thinking it was an actual pot pie.", "food"], [" Instead I got a …", "None"], ["We waited an hour before somebody came up to our table to ask what we wanted to drink.", "service"], [" Multiple staff members walked by and looked at us, but never approached.", "Service"], [" Then a group of team members huddled in a small circle to talk about us and …", "none"], ["“food was not up to mark.", "food"], [" others cheesecake outlets offer great taste”\n\nIt was my brother b’day dinner party and we decided to come here.", "food"], [" I have been to …", "location"], ["It's a Cheesecake Factory, so you know what to expect.", "food"], ["  It was right in line with others I have visited.", "none"], ["  Good food in a nice family friendly atmosphere.", "food, atmosphere"], ["  If you are taking the train it's right by the platform and easy to access, just a few minutes walk.", "transportation"], ["Saturday evening.", "none"], [" Had to wait 40 minutes but definitely worth it.", "food"], [" Food was excellent and drinks were good.", "food"], [" Only wish they had more booths.", "atmosphere"], ["Amazing food!", "food"], [" This is our first dining out experience in our neighborhood in a year and we are so glad we chose this place.", "atmosphere"], ["Bread is amazing.", "food"], [" Nice ambience.", "atmosphere"], [" Restrooms are ok.", "hygiene"], [" Place is clean overall.", "hygiene"], [" Staff is ok.", "service"], [" Food is pricey but some dishes are good esp their pastas.", "food"], ["CANT believe I spent $40 on this.", "none"], [" The chicken and broccoli pasta had 2 pieces of chicken and maybe 5 of broccoli?", "food"], [" No sauce nothing.", "food"], [" Very disappointing.", "none"], [" I advise to not order take out from here", "service"], ["Nice place to have dinner.", "atmosphere"], ["\nIt is very busy place so be prepared to wait 20 to 40 minutes in the evening time.", "None"], ["Quantity is worst and food was amazing taste\nChocholate truffle cake", "food"], ["Absolutely great service and great food.", "food"], [" However, I have to leave 4 stars because I was given to go the smallest, thinnest piece of cake I have ever received at a Cheesecake Factory in my life.", "food"], [" I was given a slice of cake for a 3 year old.", "food"], ["We waited 30 mins for the appetizers and 40 mins for our dinner.", "service"], [" The food was just okay.", "food"], [" The bathrooms were clean.", "hygiene"], ["The lighting and setting were nice, very chill and relaxed.", "atmosphere"], [" The waitress, Precious, was friendly and professional.", "service"], ["  Hope to always get such great service.", "service"], [" The food was delicious despite there being almost no salt in anything seemingly.", "food"], [" The cocktail was good although a bit too sweet.", "food"], [" The lolicous strawberry cheesecake was quite good.", "food"], ["Great food, service was OK, it's a big place and super busy, so you won't get the small warm restaurant feel here.", "atmosphere"], [" great to eat.", "food"], ["Pathetic service!", "service"], [" Food quantity is poor!", "food"], [" My stomach is upset after eating Parmesan chicken.", "food"], [" Staff is not customer friendly.", "service"], [" I wouldn’t recommend this place to anyone.", "none"], ["I visited Cheesecake Factory last Tuesday and m experience was horrible be it food or service.", "service"], [" I couldn’t believe a reputed restaurant like this would deliver such substandard service.", "service"], ["Best Place ever food is delicious, place is super clean floors are beautiful here they are very shine  thank you for the good food food and very friendly staff here in this location thank you thank you everyone", "food, hygiene, atmosphere, service, location"], ["Being a long-time customer, this was the first time I ate at this location.", "location"], [" The server wasn't bad, but considering the restaurant was near empty, it took too long for us to get her attention.", "service"], [" When the main course arrived, meals were …", "food"], ["Service was excellent.", "service"], [" My food was spicy and it wasn’t specified in the menu but with many cups of water I was okay.", "food"], [" I went for my birthday and they made it special.", "service"], [" Greatly appreciated  …", "None"], ["Left disappointed.", "none"], [" The bar around 5 pm was full, so told to sit at a nearby table top.", "atmosphere"], [" The hostess never gave me a menu.", "service"], [" I flagged two servers if this was their table?", "service"], [" They replied \"No\".", "none"], [" The floor Manageress in glasses walked by me several …", "service"], ["Ambience, staff, food, quality, quantity - perfect.", "food"], [" Must try our place with family and friends.", "atmosphere"], [" I would say each and every dish of theirs is worth trying.", "food"], [" If you can't think of any place and crave for good food- just go here and to add cherry  on the cake - dont forget to order their cheesecake.", "food"], ["We were looking forward to visit this place for a long time.", "none"], [" The steward did a great job taking care of us but, the food as not right there.", "service"], [" I ordered a Mojito and margarita.", "Food"], [" We were surprised the mojito came in such a large glass, but when …", "none"], ["I try to get something different every time I go there and I have never been disappointed.", "food"], [" The service is excellent and the atmosphere and ambiance is top quality, very romantic for the lovers.", "atmosphere"], ["I have been to this location a few times and I am constantly juggling a 3 or 4 star rating depending on the visit.", "none"], ["  For the sake of the pandemic, I will move it back to 4 stars.", "Hygiene"], ["Great atmosphere for a first time visitor.", "atmosphere"], [" Indians looking for a good place to take a girl for a date could be a good cost effective option.", "none"], ["The service was slow, food and drinks took forever.", "service"], ["  The 2nd round of drinks were ordered before our meals arrived and we were waiting for them still after finishing dinner.", "service"], ["  I wouldn't go back.", "none"], ["Went here with a friend after work for early dinner.", "none"], [" The staff were super attentive and friendly, didn’t make us feel rushed at all even though I had trouble deciding my food.", "service"], [" I ended up ordering the Cajun pasta which was delicious.", "food"], [" The chocolate cheesecake was also amazing as expected.", "food"], [" Really wish I could just eat here everyday~", "food"], ["The Cheesecake Factory earns a well-deserved 4 stars for its extensive menu, consistently delicious food, and inviting atmosphere.", "food"], [" With a vast array of appetizing options, it caters to diverse palates, making it a perfect choice for group …", "food"], ["The ambience is good and they were kind enough to consider our dietary restrictions and prepare the food.", "atmosphere"], [" There was lot of rush being a weekend so the wait time was about 20-30mins.", "none"], [" Do have their pizza and nachos.", "food"], [" Their veggie pasta are okay.", "food"], ["We’ve been here probably once or twice every week lately this month.", "none"], [" After Pandemic  so refreshing to see incredible service, great drinks, consistent DELICIOUS food every single time we ordered every single dish, yummy.", "food"], [" After many …", "none"], ["Tasty food and great vibe.", "food"], [" This is go to place for us here in Jersey City.", "none"], [" We love the bread which they serve complimentary", "food"], ["Good price-quality balance but I think the prices has been increased since the last time I came to US.", "none"], ["The Cheesecake Factory offers a very wide variety of food to choose from and it would be hard to not find something that appeals to you.", "food"], [" Not all dishes are the best.", "food"], [" I had eggplant parmesan this visit which was not as hot as I would of …", "food"], ["Been here several times for lunch and dinner but my first time trying Brunch.", "food"], [" Glad I did it was delicious.", "food"], [" Loved the cinnamon roll pancakes  …", "food"], ["Meals did not come out to at the same time and there was only two of us.", "service"], [" Mine arrived 15 minutes later than the other.", "none"], [" No water provided.", "service"], ["This place was amazing!", "atmosphere"], [" The food was absolutely delicious , there was so much to choose from but I decided to have the Korean fried chicken with brown rice.", "food"], [" To be honest Best I’ve ever tasted, my lady had the Jamaican black pepper chicken.", "food"], ["Terrible customer service, with no understanding to kids timing.", "service"], ["\nIt took them forever to sit us, and another forever to bring our dishes (and there was literally no one at the restaurant).", "service"], [" Waiters don't even bother to check on us.", "service"], [" I would have ignored everything if the food was good, but it was honestly below average.", "food"], ["My whole family loves this place, my kids love the spaghetti and my wife is sick for the tiramisu.", "food"], ["I love this place.", "atmosphere"], [" The food is excellent.", "food"], [" The staff was very attentive.", "service"], [" Don't even get me started on dessert.", "food"], [" Fantastic!", "none"], [" Definitely will visit again.", "none"], ["What a mess!", "None"], [" Place is not that clean we had to ask to replace our utensils.", "hygiene"], [" Food was terrible couldn’t eat any of it!", "food"], [" Fries were stale, took a bite of the burger and couldn’t stand how it smells!", "Food"], [" Definitely do not recommend and won’t be coming back EVER!", "none"], ["Before I could even dig into my cheesecake I found two pieces of hair.", "hygiene"], [" Disgusting!", "hygiene"], ["The food is always stale.", "food"], [" I mean I get it the long menu is the Cheese cake factory's signature but the food is almost always stale.", "food"], [" The service is good.", "service"], [" The atmosphere is dark.", "atmosphere"], [" An ok palce.", "none"], ["This place has an astounding interior.", "atmosphere"], [" Very polite and attentive waitresses will leave your served in the best way.", "service"], [" The variety of tasty meals won't leave you without a choice.", "food"], [" In fact, I've spent 15 minutes making a decision what I want to …", "none"], ["Worst experience that I ever had in a restaurant, we order drinks, a burger and some pasta with shrimps, drinks took 15 minutes to serve, food took 45 minutes and came up wrong no even up to standards , burger came up cold the only thing …", "Food"], ["Food was ok but really liked the drinks there", "Food"], ["We normally love this place it.", "Atmosphere"], [" It's our go-to for birthday dinners.", "atmosphere"], [" But last night when we went for my roommates birthday it was AWFUL.", "atmosphere"], [" one of the servers dropped the 3 bellinis we ordered right as they got to our table, showering us and …", "service"], ["Service is hit or miss here.", "service"], [" This past Sunday was a miss.", "none"], [" Our waitress took forever to do everything.", "service"], [" We were seated at the bar section, which looked pretty full.", "atmosphere"], [" Maybe they need two people covering that area.", "none"], [" Food was consistent - except …", "food"], ["The huevos Rancheros is really good here, and the drinks are great too.", "food"], [" I liked the blueberry cheesecake, but the other cheesecakes like the caramel pecan aren't too fresh sometimes.", "food"], ["Hubby and I stopped in for lunch yesterday.", "none"], [" The mushroom burger with carmelized onions and cheddar was divine!", "food"], [" If I hadn't already gorged myself with honey wheat bread,  I probably would have eaten two.", "food"], [" Our server was attentive and so very pleasant.", "service"], [" Took a piece of cheesecake home, and ohhh the deliciousness  …", "food"], ["I love this place.", "atmosphere"], [" The food is amazing.", "food"], [" Love the sangria.", "food"], [" It's located in the mall, so you can combine it with a bit of shopping.", "Location"], [" The crab cakes, sangria and the parmesan chicken are my fav!", "food"], ["This place is really good.", "food"], [" I love the cheescake, Ive had it before.", "food"], [" Today I ate the  four cheese pasta and it was amazing.", "food"], [" The sweet potatoe fries was the best for me.", "food"], [" I recommend this place because it is clean, the food is good and the customer attention is so good.", "hygiene, food, service"], [" Five stars for them.", "none"], ["Visited here on 08/12 evening.", "none"], [" The front desk servers (two women) were very unprofessional, rude, and with bad attitude.", "service"], [" They were playing with their phone all the time.", "service"], [" Thank god I don’t have to tip them.", "service"], [" This restaurant should definitely train the front desk workers again.", "service"], ["Fairly okay, food is good but service may be slow!", "service"], ["I brought my daughter here to celebrate her birthday.", "atmosphere"], [" From the time we entered the restaurant, everything sucked!", "service"], [" Everything!", "None"], [" The customer service was not good at all.", "service"], [" The water, bread and butter were the only items that made it to the …", "food"], ["I celebrated my birthday here this October!", "atmosphere"], ["  As always the food & service was good.", "food"], [" Our server was courteous & attentive.", "service"], ["  My only complaint is our orders took long to be served.", "service"], ["I would like to first start off by saying I ordered online so it would be ready by the time I got there, I live about 25 minutes away for reference.", "none"], [" I ordered the Chicken Milanese and had to wait awhile when I first arrived.", "food"], [" At first it was …", "none"], ["Nice place, usually go there for their delicious Pineapple upside down cheesecake and factory nachos/wings.", "food"], ["Been going to this restaurant for a while and always impressed by their extensive menu and selections they have to offer.", "food"], [" We had spicy chicken chipotle pasta and Pasta da Vinci.", "food"], [" The chipotle pasta was really nice, we didn’t enjoy the Pasta …", "food"], ["This place is a synonym for ‘Pathetic’.", "none"], ["\nWe went here twice.", "none"], [" First time the order came after 55 mins and food was equivalent to stale.", "food"], [" Today we again went and server informed us after 40 mins that our …", "Service"], ["WAITED for hostes to seat us 15 minutes, not crowded,  staff not friendly, seems when ask a question your bothering them!", "Service"], [" FIRST AND LADT TIME I WILL EAT HERE AGAIN!", "food"], ["It’s my first visit to Cheesecake Factory.", "none"], ["\n\nThey have a long selection of flavours to choose from.", "food"], ["Awesome food and great staff love the food and drinks are the best!", "food"], [" Will be going back very soon!", "none"], ["Oh these drinks were so so good.", "food"], [" I kept ordering them lol i was hoping it was free refills but nope lol.", "food"], [" $7 each (virgin drinks)", "food"], ["Bad food and overcrowded.", "food"], [" The service was patherltic.", "service"], [" The side with my dish was served about 10min late.", "service"], [" Not going there again.", "none"], ["Pick up order with no butter or utensils.", "None"], [" So when I got back to work I had nothing to eat my food with and dry bread.", "food"], [" I put in the order I wanted butter and utensils.", "service"], [" This is the second time this happens.", "none"], [" Very disappointing and ruined my lunch hour.", "none"], ["Godiva Brownie Sundae was HARD as hell & when we told the server: Andrea V.", "food"], [" At the Jersey City location - she said it was suppose to be like that.", "none"], ["  besides her barely coming around to ask if we needed anything.", "service"], [" We had to ask other servers …", "service"], ["Steak was disgusting; bad quality (not about the cooking) Mash was okay.", "food"], [" Best part was the bread.", "food"], ["Cheesecake Factory restaurants tend to be consistently decent across the country and this one is no exception.", "food"], [" Service at the bar was great and I can tell you from experience that Hector is a 5 star bartender and makes one of the best dirty gin martinis you’ll ever have.", "service"], ["Forget our servers name but she was the best.", "service"], [" Exceeded our expectations in every way.", "none"], [" Was told 30 minute wait and we only waited 15 minutes.", "none"], [" Great service, great food and drinks.", "food"], ["Not the best!", "none"], [" Got put in a corner and kind of forgotten about.", "Service"], [" Starter arrived no napkins had to ask twice for them and then again for our drinks to be refilled.", "service"], [" But food was good other then that", "food"], ["Good atmosphere, variety of dishes, good service and music.", "atmosphere"], ["  I recommend the Fried Calamari, Shrimp Bistro and Meal loaf and you cannot miss the extraordinary ones Cheesecake!", "food"], ["Recently got food from here for a work lunch to go and it was absolutely delicious!", "food"], [" They also have really great pizza here!", "food"], ["The worst is going to ever came in my life I've been all over over 15 years The cheesecake factory so one in New Jersey City horrible bartender horrible manager everyone.", "service"], [" manager very unprofessional in July 4th weekend …", "service"], ["The food wasn't that good for the price .", "food"], [" Service was great.", "service"], [" To bad I can't say the same about the food.", "food"], ["The food and drinks were good and our server Baidy was so pleasant and helpful.", "service"], [" He made the evening even nicer.", "atmosphere"], ["I ordered a fresh strawberry cheesecake pie for pickup.", "food"], [" I requested extra whipped cream and strawberry and I got 1 strawberry and a whooping 4 oz of whipped cream.", "food"], [" Thank you Daniel!", "none"], ["Their nachos are sooooooo damn good.", "food"], [" And the menu is huge.", "food"], [" I hate the lighting at this branch and the design on the walls is appalling but those nachos make it worth it.", "atmosphere"], ["Cheesecake Factory is one of the best restaurants I have ever seen.", "atmosphere"], [" The Cheesecake Factory story begins in Detroit, Michigan in the 1940’s.", "none"], [" Evelyn Overton found a recipe in the local newspaper that would inspire her “Original” Cheesecake.", "food"], ["Service was good.", "service"], [" Food was horrible.", "food"], ["\n\nMy crab and artichoke dip was okay.", "food"], [" A little more like mayo, and cheese dip.", "food"], ["Beautiful place, friendly staff and delicious food.", "food"], [" I'm impressed.", "none"], [" Didn't expect it to be this good", "food"], ["The pasta tastes very bland compared to other cheesecake factories.", "food"], [" The hostesses at the front were chatting among themselves while we waited in line.", "service"], [" My server was great though.", "service"], ["We were sat down and had to wait roughly 15-20 for the  server to come by.", "service"], [" Took another 10 minutes just to get our drinks, appetizer came out quick, but took a while to get refills on our drinks.", "service"], [" The food was great but our stuffed mushrooms that we got were warm, they weren't cold nor hot as if they were sitting there for a while.", "food"], ["Had gone there on a brunch date.", "atmosphere"], [" They were out of a seasonal fish I wanted so they replaced it with another, which was not a problem.", "food"], [" They cook everything in butter so the food is a bit on the richer side, I had to pack some for home.", "food"], ["Wonderful time at this location, good food and great service!", "food, service"], [" Please beware that at the time of writing, there there was a family of mice in the restaurant under one of the table booths.", "hygiene"], ["I have to say this was the worst food I’ve had.", "food"], [" I had it delivered to my hotel.", "transportation"], [" Food was greasy and not hot.", "food"], [" Just a little warm.", "Atmosphere"], [" The driver didn’t bring my drink with him.", "service"], [" I am very disappointed ", "none"], ["Probably the best restaurant in downtown JC.", "none"], [" The customer service here is pretty darn good but this place is extremely busy on weekend nights and so you gotta plan ahead.", "service"], ["The cheesecake is amazing but expensive.", "food"], [" The burger was okay but the fried Mac and cheese was the best of the night.", "food"], ["I like the darker ambiance of lighting it makes me feel more relaxed.", "atmosphere"], [" My food was good definitely satisfied with the portion size but the service was just ok it was disorganized trying to get a booth and one of the meals came out cold actually had to send it back Not opposed to trying again though !", "food"], ["Service and food was great.", "food"], [" The atmosphere didn’t give me that “covid 19”.", "atmosphere"], [" Server was quick and nice.", "service"], [" Pineapple chicken and appetizers were bomb", "food"], ["The Baja tacos are soo good and I love getting Pina coladas since so few places either offer them or make a good one.", "food"], [" Cheese cake factory does both.", "food"], [" Too stuffed to order dessert today but I've had it before and the options are fantastic.", "food"], [" Service was the best I've had in quite a while", "service"], ["The service was so terrible the last couple of times we came (slow and extremely rude), that we decided to just order to go and avoid the staff.", "service"], [" The people behind the cake bar ignore the customers standing in front of them.", "service"], [" They gave us the …", "None"], ["Cheesecake Factory is great for date night.", "atmosphere"], [" The good food and drink and the cheesecake, of course is definitely worth the visist.", "food"], ["Me and my lady had a  great time .", "atmosphere"], [" my lady had such a great time wouldnt you agree that customer service was  on 100%  have you ever been rush to eat well.", "service"], ["thank goodness.", "none"], ["there was none of that not even the slitest feeling SHOUT OUT TO OUR WAITER.", "service"], [" MANNY / THANK YOU TO THE HARD WORKERS OF ALL  #CHEESECAKE FACTORY", "food"], ["While dining at the Cheesecake Factory located within the Newport Centre Mall in NJ, I bit down on a hard object and nearly swallowed it.", "food"], [" After spitting it out, I found there was a  screw in my meal, embedded in the brown rice I was eating …", "hygiene"], ["Overall,  it was ok.", "none"], [" Was not happy with my burger coming back pink.", "food"], [" Both mine and another ordered burgers and expressed no pink, only to get them with pink.", "food"], [" I had mine redone.", "none"], [" It's my one thing I make sure to tell waitstaff beforehand.", "service"], ["One if my worst Cheesecake Factory experiences at Newport Mall in Jersey City last night.", "service"], ["\n1) Service was veryyyy slow, and sloppy.", "service"], [" Cheesecake factory servers used to be …", "service"], ["The staff is nice, the cheesecake was as you expect, the steak whoever was the worst, wasn’t able to finish it.", "Food"], ["The food was so delicious!", "food"], [" Everything was on point !", "none"], [" And our waiter Richard was beyond great!", "service"], [" I would recommend this place.", "none"], [" Also I would recommend to try the tropical smoothie and the macaroni and cheese burger  soooo soo good!", "food"], ["Food is great.", "food"], [" Drinks are good.", "Food"], [" Service can be a bit slow at times.", "service"], ["\nSomehow, takeout cheesecake takes quite a bit.", "food"], [" So don't think you can just pop in and out if you haven't ordered in advance.", "none"], ["\nI do enjoy coming in to eat though.", "food"], ["Took over 35 minutes for a small salad.", "service"], ["  The cashier simply held on to the bag while I waited.", "service"], ["Cheesecake has THE BEST TURKEY BURGER EVER!", "food"], [" I love that I can get it with a gluten free bun too.", "food"], [" Staff was friendly as well.", "service"], ["It was the dirtiest restaurant that i’ve ever visited.", "hygiene"], [" we had to ask for changing our forks and knives but our server gave us more dirty one.", "hygiene"], [" i couldn’t believe her service.", "service"], [" it was awful.", "none"], [" she was really unfriendly.", "service"], [" no eyecontact.", "service"], ["Delicious food made by amazing chefs and the prep assistants are great as well!", "food"], [" I was honored to shadow them for a day and got to see what it entails to run a kitchen!", "none"], [" Wow I am impressed on how well they work together and get exceptional food out to the customers!", "food"], [" Keep up the great work CCF team  …", "none"], ["I’m not sure if they’re short staffed, but what a bad experience.", "service"], [" They brought one entree with the appetizer with the other entree coming later.", "Service"], [" The appetizer was tamale cakes, which came burnt.", "food\n"], [" The waiter didn’t take the menus, didn’t …", "service"], ["Not worth the money.", "none"], [" You can get the same style food at Applebee's or Dave and Buster for cheaper and get seated quicker by staff that remembers you are waiting.", "service"], [" Anna if they give you a wait time, they will contact you within that time.", "service"], ["Went here for breakfast and was very underwhelmed — waited over a half hour for breakfast items, literally eggs, toast and tortillas, although the restaurant was empty.", "service"], [" The silverware, specifically the forks, were dirty.", "hygiene"], [" Our waitress was great, really the only reason I’m giving this a few stars.", "service"], ["Great food, great cheesecake (the key lime pie cheesecake is AWESOMAZING), great, friendly service, and great atmosphere.", "food"], ["Food was really good.", "food"], [" Cheese cake is always top notch!", "food"], [" Service was extremely slow almost a hour for food to come out.", "service"], [" The place was almost completely empty.", "atmosphere"], ["  But definitely would come back.", "none"], ["The food was surprisingly exceptionally fresh and delicious.", "food"], ["  Our server was wonderful and attentive.", "service"], [" Had a reservation and the Host area was a disaster, so much that the manager reprimanded all of the hosts in front of us and other customers.", "service"], ["Waited 25 minutes before being served.", "service"], [" Ordered a rib eye steak.", "food"], [" Ordered mine rare.", "food"], [" Waited 45 minutes - that's fine.", "none"], [" Came out more cooked than well done.", "food"], [" Sent it back.", "Service"], [" Waited another 40 minutes.", "None"], [" Here came a steak with frozen in the middle.", "food"], ["As the name suggests, this is only good for cheesecakes.", "food"], [" Please don't expect any decent service when you are dining in especially if you're a group of 4 or more.", "service"], ["I have visited this outlet more than 20 times, and every time my experience with the front desk was far from good.", "service"], ["\nI don't know why they hire such incompetent people as their front desk!", "service"], ["My worst Cheesecake Factory experience ever.", "food"], [" First, the server's attitude was sluggish, and he got my order wrong.", "service"], [" I ordered a fried chicken waffle eggs benedict and I only got a fried chicken waffle.", "food"], [" Another server passed by and asked me …", "service"], ["This is one of my favorite restaurants in jersey city.", "location"], [" Customers service and food are great.", "service"], ["Very extensive menu so had to take my time to decide what to eat\n\nLuckily everything on the menu we tried was great!", "food"], ["Delicious!", "food"], [" I had pretzel bites fondue and it was so good!", "food"], [" One of the best things I've ever eaten!", "food"], [" My burger was good too and my cheesecake  …", "food"], ["Service was great, the food was mediocre at best.", "food"], [" Cheesecake was good.", "food"], ["I used to look forward to going eating here.", "food"], [" The Food and service was horrible.", "food and service"], [" Me and my party sat for 25 minutes before anyone came to our table.", "service"], [" When the person finally came to our table took our drink order.", "service"], [" Bread was not even warm and …", "food"], ["My server AlJabree made me & my fiance experience here one to remember.", "service"], [" He recommended the “basque” cheesecake that she just cant get over!", "Error: 500, {\n  \"error\": {\n    \"message\": \"The server had an error while processing your request. Sorry about that!\",\n    \"type\": \"server_error\",\n    \"param\": null,\n    \"code\": null\n  }\n}\n"], [" He was very attentive to our table and kept us updated & gave refills before asking.", "service"], [" Anyone coming to this cheesecake we recommend asking for the server Aljabree !", "service"], ["Consistently excellent food and service.", "food"], [" I love the variety on the menu also.", "food"], ["Not tasty as expected.", "food"], [" The location is too fancy and dark in respect with the food served.", "location"], ["Server was nice but that’s the only positive thing about the place.", "service"], [" We made reservations for 7pm, arrived early at 6:40 so the hostess said she will text us when our table is ready.", "service"], [" While waiting we saw 2 separate groups just walk in and …", "service"], ["Food is alright, but the place sucks.", "atmosphere"], [" Waiters, especially the attendants have got an attitude.", "service"], [" They pretend to be busy even if if they are not.", "service"], [" They have time to joke around but not for customers.", "service"], [" This happened twice at the jersey city location and we ended up leaving.", "none"], [" Not going back ever again.", "none"], ["Great service tasty food.", "food"], [" Portions are huge but matches the amount of money they charge.", "food"], [" They should make macro information available for their menu so the customers can make better decisions", "food"], ["Food and Drinks are great.", "food"], [" Service was abysmal.", "service"], [" Been here 1hr+ have received 1 cocktail.", "service"], [" Can't wait for a check so we can dip out.", "none"], ["Delisious food (california salad and burger were absolutly perfect!", "food"], [") and quick, nice service.", "service"], [" Amazing cheesecakes!", "food"], [" We have enjoyed our lunch very much!", "food"], ["Love food here!", "food"], [" But you need to wait around 1 hour to be seated, in weekends .", "service"], ["I LOVE this chain!", "food"], [" So many food options!", "food"], [" But more importantly … so many cheesecake options  …", "food"], ["Please please tell me how you can possibly forget the fries with the burger?", "food"], [" All I did was order a simple burger with fries for delivery from you and you didn’t include the fries!", "food"], [" How is that even possible?", "none"], ["Average meal at best, it’s been a while since we visited a cheesecake factory but I remember them being better than this.", "food"], [" Service was friendly but very slow.", "service"], [" If your looking for non fancy normal food then this is a good spot to hit.", "food"], ["I came to redeem a gift card for an unpleasant takeout order and honestly not sure I'd do sit down ever again.", "food"], [" Out waiter was a bit forgetful and clumsy- he literally broke a dish and kicked it under a table.", "service"], [" I got calamari which was super salty and I found chicken tenders in the calamari?", "food"], ["The food there is sooooo delicious.", "food"], ["  Was not disappointed at allllll.", "none"], ["Honestly saddened by today’s experience.", "service"], [" My wife and I finally had a night off to ourselves, so we decide to have a date night and chose this place.", "atmosphere"], [" This was quite frankly disgusting.", "hygiene"], [" We were sat down in a timely manner , but were greeted …", "Service"], ["One place to find the cake you want.", "food"], [" I love their desserts but the food needs some rework.", "food"], [" In general they are good.", "none"], ["Place is disgusting.", "hygiene"], [" No air conditioner on, Saturday 8/6/22.", "atmosphere"], [" Staff claimed they were hot as well.", "atmosphere"], [" Decided to eat in the patio area which is in the mall.", "location"], [" Big mistake.", "none"], [" Service sucked, food was actually STALE, bread was hard as a rock, took 25 …", "food"], ["Awesome place .", "atmosphere"], [" Great food and so many options.", "food"], [" You will get both veg and non veg options.", "food"], [" Salads are great too.", "food"], ["\nAnd of course cheesecakes are must try.", "food"], [" Prices are pretty moderate, enjoy !", "food"], ["Always get great service here.", "service"], [" The food can be a hit or miss some days.", "food"], [" The bread isn’t the best I’ve had.", "food"], [" But it’s never bad overall!", "none"], ["We ordered a Rigatoni Pasta without meat (because we're vegetarians) and only when we ate some of it we realised there were small chicken pieces in the dish.", "food"], [" Even after informing and showing our server the pieces, the dish was not taken off …", "service"], ["\n\nFood was not great.", "food"], [" I got the 4 cheese pasta with chicken.", "food"], [" Wife got chicken and …", "food"], ["Had a great time here, very reliable country wide in taste.", "food"], [" If you know Cheesecake then this one is the same as the one you’ve been too.", "none"], [" Came for a business dinner and we had a grand time.", "atmosphere"], [" It’s great that each chain has the same atmosphere and standard.", "atmosphere"], [" Staff was able to seat us immediately and wait staff was fast and attentive.", "service"], ["Enjoyed a grandmother/granddaughter dinner.", "atmosphere"], ["  Enjoyed the calamari, shrimp and chicken gumbo and the beet and avocado salad.", "food"], ["  The fiery shrimp and the warm spinach artichoke were average actually the shrimp felt like they came out a box.", "food"], ["Worst meal ever.", "food"], [" Slow service.", "service"], [" Overpriced.", "food"], [" Went again on 10/19/23 for a team lunch.", "none"], [" Much better food was spot on.", "food"], ["Just Awesome !", "none"], [" The complimentary bread they serve you before your order is very very tasty.", "food"], [" Even vegetarian options are available but not much.", "food"], [" You have cocktails.", "food"], [" The quantity served millbr sufficient for 3 people so order accordingly.", "food"], [" If you want to go for less quantity you can order from Skinner's menu.", "food"], ["Great place for cheesecake, and just to chill for a while eating good food after a day at the mall.", "food"], [" This chain is very consistent through out the different locations I have visited.", "none"], [" Impressive", "none"], ["Horrible, awful just the worse experience at Cheesecake factory ever.", "service"], [" We dine here often, but only in the west coast.", "location"], [" It's always been extremely tasty, never let us down until now.", "food"], [" It started off by us being immediately sat, great!", "service"], ["A place that every time I have visited it I have been pleased.", "none"], ["\nDelicious food and excellent service!", "food, service"], ["Great options for cheesecake.", "food"], [" My personal favorite is the vanilla bean cheesecake.", "food"], [" It's the perfect combination of flavors.", "food"], [" They could do better with the dinner menu though.", "food"], ["I liked my dish, eventhough the chicken was a bit dry.", "food"], [" But, overall a good first experience.", "none"], [" Love the dessert.", "food"], [" The server was very friendly.", "service"], [" Kids enjoyed their meals, especially the pizza Flatbread.", "food"], [" Will come back for cheesecake.", "food"], ["Service good.", "service"], [" Food good but my drink the pineapple mojito taste like infused water ,pineapples & mint.", "Food"], ["My new favorite spot to go too.", "atmosphere"], [" Everything was 5 Stars", "none"], ["Went for my husband's birthday.", "atmosphere"], ["  Our waiter, Charlie,  was very attentive, quick, and efficient.", "service"], ["  And food was fabulous as always!", "food"], ["We loved our food.", "food"], [" Everyone can find domething to order on the menu.", "food"], ["\n\nThe Burgers are great and the Steak was near perfect.", "food"], ["One of my favorite places.", "none"], [" I really really LOVE their ultimate red velvet cheesecake.", "food"], ["They’ve increased the price of the cheesecakes while reducing the size of the cheesecake drastically :( disappointed", "food"], ["Francisco was our waiter and he took really good care of us!", "service"], [" The plates were big and everyone enjoyed their meal.", "food"], ["Bad service and mediocre food.", "food"], [" We made a reservation and came a bit early, so we were fine waiting until we received a text stating that the table was ready.", "service"], [" However, despite the text, the hostess couldn’t locate a table for us, and so we …", "service"], ["Best cheesecakes , plus the food is so good !", "food"], ["Just came in to buy a cheesecake for my daughters birthday.", "food"], ["  They were limited in 7\" and all I wanted was strawberry or vanilla bean.", "food"], ["  Both weren't available initially.", "none"], ["  Guy went to the back to check and came back with the last or one of the last.", "food"], ["  Great service!", "service"], [" The only thing that made it 3 stars was that i got like 3 chicken breasts but the taste was sad.", "food"], [" The staff is wonderful though and i felt taken care of.", "service"], [" I didn't go here for good food, it was just close and i was hungry", "location"], ["Our server was great.", "service"], [" Great food and nice ac.", "food"], ["The one in the Newport mall had bad service.", "service"], [" We got a server after 40 minutes waiting and quality of food was also not at par with the other outlets in NJ", "service"], ["Great food however service is a bit slow.", "Service"], ["  I ate there two days in a row - Sunday Juneteenth  and Monday 6/20/22.", "none"], ["  It was the Skinnylicous grilled salmon along with the beet/avocado salad that bought and it did not disappoint.", "food"], ["   I enjoyed the dinner along with the wheat bread basket.", "food"], ["I just got out of this restaurant after waiting for half hour for the server to come take our order.", "service"], [" No one ever showed up after we were seated.", "service"], [" Went to the bathroom while waited and floors were extremely greasy and slippery.", "hygiene"], [" Was a blessing …", "none"], ["Huge size of dish.", "food"], [" Average taste.", "food"], [" More of a lunch place.", "food"], ["I went yesterday to the Cheesecake Factory for a friend’s birthday.", "none"], [" It was a bit of a wait but, our server Ally was the best server I’ve had at any restaurant in general.", "service"], [" Very attentive, made sure we had what we needed, and checked on us …", "service"], ["Wow ok  After waiting  and hour for a table the service was top of the line very gently and the experience and recommendation of the employee the best we are very pleased with the service and the food we loved everything .", "service"], ["Really unhappy for low quality service.", "service"], ["\nWe took our family for our kid birthday dinner but they forgot the process the dinner for our birthday kid.", "Service"], ["  The server’s attitude was great and happy, there …", "service"], ["It is an amazing place.", "atmosphere"], [" We had Hershey's cheese cake.", "food"], [" It was super delicious  …", "food"], ["I really enjoyed the food and the atmosphere.", "food and atmosphere"], ["  The avocado egg rolls were amazing!", "food"], [" Everything was excellent.", "none"], ["  Me and my family will definitely be coming back!", "none"], ["Worst place to order food sat down for 10 minutes none came to the table I guess I won’t be coming back ‍ …", "service"], ["Incredible\nMy server Alexis is amazing.", "service"], [" Great at her job and very attentive.", "service"], [" She always remembers what i like and make amazing suggestions.", "service"], [" Every time I go back, I only ask for her session!", "service"], ["Everything was amazing, the henny colada, and the tex max egg rolls.", "food"], [" Andrea the bartender was stellar!", "service"], [" Will be back.", "none"], ["I ordered to go, jambalaya pasta with shrimp.", "food"], [" Had I not been on the highway by the time I started eating, I would've returned this mess.", "food"], [" It was awful.", "none"], [" The pasta was so overcooked.", "food"], [" It was mushy and dry.", "food"], [" I'll never visit this location again.", "location"], ["Just came from this place with the family ans was good drinks was good also", "food"], ["Our waitress, Natalie, was friendly and personable.", "service"], [" The food service was a bit slow.", "service"], ["I just went for the cheesecake but ended up getting a burger to go which was  but the fries honestly sucked!", "Food"], ["Mediocre experience.", "none"], [" The spicy chicken chipotle pasta was bland and no kick to the chicken.", "food"], [" Hardly any sauce and a bit dry.", "food"], [" The jambalaya though, was amazing!", "food"], [" From the smoked peppers and balance of spice and savory flavors, it was great.", "food"], ["The chicken was completely raw.", "food"], [" DO NOT EAT HERE.", "food"], [" Will never come to this location again.", "location"], ["This place has been the absolute worse location I’ve ever been to and I love The Cheesecake Factory.", "location"], [" The server was inattentive, unprofessional and downright rude.", "service"], [" After expressing dissatisfaction for the 3rd time I requested the manager …", "service"], ["They always mess up.", "service"], ["pick orders.", "service"], ["need to check the bag before you leave.", "hygiene"], ["and now on hold on phone for 10 minutes", "none"], ["JW Pink Lemonade is delicious as well as the  chicken taquitos.", "food"], [" Great service.", "service"], ["I have very mixed feelings about my experience here.", "none"], [" When I first came in and approached the host stand, the two hostess' that were standing there seemed bothered that I asked for a table for two.", "Service"], [" After one hostess found a table, the other …", "service"], ["I love your cheesecakes and i joined the rewards program because of it but i ordered online today for pick up and to claim my birthday cake reward but i was  disappointed when i got home.", "food"], [" I ordered chicken riesling as my usual but there's …", "food"], ["We used to eat here every other week and I love it, just little disappointed last night the lady in front is kind of rude she ask me my phone number what is my service and wait for 30 mints.", "service"], [" She said she will call my name or send me txt if …", "none"], ["The front desk told us to wait for 20 min.", "service"], [" Even though there were countless empty tables, the front desk did not call/ text us after 20 min wait.", "service"], [" To be noted, it was 9:30 pm, not a regular dinner time.", "none"], ["I wish I could give this location 0 stars.", "location"], ["  I understand ever since Covid finding employees has been hard for many establishments but that is still no excuse for poor service.", "service"], ["Great food.", "food"], [" Tried Jamaica Chicken with black beans and chicken samosa.", "food"], ["\n\nRemembering this experience, i brought my friend for a dinner here and we had to …", "food"], ["Amazing food and the cheesecake is just fab.", "food"], ["it just melts in your mouth.", "food"], ["the one that started  it all.", "none"], ["#cheesecake", "food"], ["Really good experience and food.", "food"], [" Alot of food", "food"], ["As soon as we came in there was a 15 min wait.", "none"], [" That’s pretty normal, however the wait staff was extremely unprofessional.", "service"], [" Fighting with each other right in front of our table.", "atmosphere"], [" Waitress was taking our order and arguing with a coworker at the …", "service"], ["Great service and the food portions were huge!", "food"], ["I really loved their Flatbread Pizza (vegetarian) in Neport Jersey City Location in the mall.", "food"], [" My friend ordered a beetroot and avocado salad and it was super yummy too.", "food"], [" Overall a great experience.", "none"], ["Amazing food and service.", "food"], [" I have eaten at other locations but I can easily say this was hands down the best location I have eaten at (despite the wait time).", "location"], ["They have done fraud with my card.", "none"], [" Im never going back.", "none"], ["Hostess gave a 30 min wait time.", "service"], [" we said okay.", "none"], [" but the call or text message never came.", "none"], [" lot of tables were available.", "atmosphere"], [" we thot she was annoyed by our presence.", "atmosphere"], [" we left after 30 min wait time", "service"], ["A small sit-out for Cheese Cake eaters need to be thought of.", "atmosphere"], ["Cheesecake are awesome,  food tastes just as good.", "food"], ["  Nice ambiance and friendly service", "atmosphere"], ["I arrived at 9:15 pm yesterday and they close at 10 pm.", "none"], [" Over half the tables were empty and the hostess told me the wait time was 20 minutes.", "none"], [" I understand you want to go home early but I just wanted a glass of water and maybe a slice of …", "food"], ["great ambience, great food and also affordable price.", "food, atmosphere"], [" there are usually reservations available and they hold the table for 10mins but if you are late for 11 mins you have to wait until there is another table available.", "None"], ["the hostess and their assistants were rude and made us wait for unnecessarily long time, while multiple free tables were in front of us.", "service"], ["Absolutely loved it.", "atmosphere"], [" Great friendly atmosphere, wait staff.", "atmosphere"], [" Great food.", "food"], [" Will definitely go again soon.", "None"], ["The food is honestly always just eh.", "food"], [" But do you go to the “Factory” for the food or the experience?", "atmosphere"], ["Everything and everyone was fabulous.", "Service"], [" Our server was fantastic.", "service"], [" He was so very attentive.", "service"], [" The food was great.", "food"], [" The atmosphere was comforting and welcoming.", "atmosphere"], ["Nice ang big dishe's but a very slow service,", "service"], ["Could of easily been 4 stars plus.", "none"], [" I waited approx 45mins for my burger meal and lemonade.", "service"], [" I was told will be a 25min wait.", "none"], [" I asked for my order and was given my meal without my beverage ordered.", "service"], [" I then requested my beverage.", "service"], [" My food was …", "food"], ["Love this place.", "atmosphere"], [" Food is really delicious and is so convenient right across from the light rail.", "food"], [" Have always had great experiences here.", "none"], ["The food was okay.", "food"], [" Food took a while to be served.", "service"], [" Ok experience", "none"], ["This is my second visit.", "none"], ["\nI did came back at Yer a few months and let me tell you, yo got all the stars back.", "none"], [" I really enjoy every meal and Enrique Made all the difference.", "food"], [" He was nice, …", "service"], ["This place is awesome.", "Atmosphere"], [" Great food and great service.", "food"], [" Food is so fresh.", "food"], [" This place is perfect to hangout at bar.", "atmosphere"], ["The below was take out for the turkey burger.", "food"], ["5, feels light, cmon.", "atmosphere"], [" also missing onions and mushrooms.", "food"], [" 2 stars because Im assuming this is not the norm.", "none"], [" At least with the \"side salad\" i.", "food"], ["lettuce, i can put on top of the burger lol.", "food"], ["Lovely atmosphere, great vibes and very good options for vegetarians", "atmosphere"], ["Definitely An amazing place to eat .", "food"], ["there is so much on the menu it's hard to choose .", "food"], ["but you definitely want to have a slice of thier cheese cakes  …", "food"], ["Wait staff had no problem accommodating a group of 9 without a reservation.", "service"], [" Food was good.", "food"], [" Didn't rush us out.", "service"], [" Service was great", "service"], ["Staff made us wait when the tables were empty.", "service"], [" Later, they gave us a table right next to a dirty table with dishes, which they didn't clean after several requests to both host and waiter.", "Hygiene"], ["Went for dinner this past Saturday.", "none"], ["  Salad bar was discontinued for the day, meaning no salad options from their menu could be ordered.", "food"], ["  Unfortunate, but we'll improvise.", "none"], ["  Things worsen when a roach suddenly emerges from the couch and …", "hygiene"], ["If you have plenty of time and patience, you may give a try.", "none"], [" I never experienced such a welcoming front desk anywhere.", "service"], [" 0 customer friendly.", "service"], [" They don't care about your order, they bring it when they found the food is lying unattended.", "Service"], ["The food was really good with a fair price.", "food"], ["Service was ok.", "service"], [" Food was ok.", "food"], [" NOTHING SPECIAL", "none"], ["The atmosphere is beautiful.", "atmosphere"], [" The staff are very humble and extremely polite.", "service"], [" The food was to die for, so tasty, fresh, great appearance and the service was out of this world.", "food"], [" Well played my friends, well played.", "none"], ["I had the Thai Chicken salad and it was so delicious.", "food"], ["  It tasted very flavorful and zesty.", "food"], [" Plus it's so fresh and healthy.", "food"], [" I highly recommend the dish.", "food"], [" The service we got from Jabari was also top-notch.", "service"], ["Went for lunch on a Saturday around 1pm.", "none"], [" Waited a good 20 minutes for drinks and when they arrived it was a huge disappointment.", "service"], [" The skinny mojitos were tall glasses with ice and sweetened seltzer.", "food"], [" Food was meh.", "food"], [" Skip if you like good food.", "food"], ["Don't go after 8pm on the weekend!", "none"], ["\nThe communication between the kitchen staff and the waiter was bad.", "service"], [" The waiter was very professional and apologetic.", "service"], [" However, the waiter came back on four …", "service"], ["Lovely Ambience.", "atmosphere"], ["  Variety of food choice", "food"], ["Good food, good cheesecake, and great service.", "food"], [" Our server was delightful and helpful.", "service"], [" We enjoyed our dinner and recommend the key lime cheesecake.", "food"], [" I love that they not only serve coffee, but also cappuccino and lattes!", "food"], ["Didn't experience non of the above.", "none"], ["\nWaited 15 minutes no waiter.", "service"], [" Made a complaint  no waiter.", "service"], [" Spoke to manager no service.", "service"], [" Best option was to leave.", "none"], ["  Went a cross to kings of Kobe fantastic experience.", "Atmosphere"], ["Our experience here was great.", "none"], [" Justin was great she was very attentive and very friendly.", "service"], [" My sweet corn Tamales were as great as always.", "food"], [" If i was them I'd put a jumbo shrimp on each one but alone is great too.", "food"], [" Also had Korean cauliflower …", "food"], ["Food was very good  we dined in was a little wait to have a server come to our table to take our order an bring drinks,but once they did it was well worth it great drinks n food", "Food"], ["Disturbingly dirty, I got an eye infection after eating there and the bathroom was flooded.", "hygiene"], [" Disgusting, never again.", "hygiene"], ["The food here is so delicious  and yummy  The Staffs are friendly and welcoming.", "food, service"], [" The location is ideal and the restaurant  is upscale.", "location"], ["Came here for apps and drinks, food was okay.", "Food"], [" Service was okay", "service"], ["We went for a nice dinner during a Saturday evening.", "atmosphere"], [" It was a great experience overall.", "none"], [" We had ordered dynamite shrimps , pasta , pizza and of course cheese cake (original and red velvet) .", "food"], [" Everything was so perfect I  it …", "atmosphere"], ["When I got to the location I had to stand in line and the concierge  let some ladies skip me and I was OK with it then he let some other guy skip me and I got mad and I told him that why is he letting everybody skip me then he just got me a …", "service"], ["Food is mediocre and bland.", "food"], [" The service and the cheesecakes were good.", "food"], ["The bacon-bacon cheeseburger was filling.", "food"], [" Lastly of course ended with a cheesecake it was very good!", "food"], ["Can't give five stars because our utensils were filthy when we arrived.", "hygiene"], [" One even had rice stuck on it.", "food"], [" Luckily, our server was so nice and replaced them without a second thought.", "service"], [" Food was also great and well-portioned.", "food"], ["Service at our table was great.", "service"], [" Food was fresh and hot.", "food"], [" We all enjoyed our meals.", "food"], [" My only complaint was when we wanted to buy a whole cheesecake to go, the counter staff and manager were on the phone frantically figuring out an issue with …", "service"], ["I wanted to eat a giant Belgian waffle, so I took the light rail.", "food and transportation"], ["  I ordered a virgin pina colada and latte.", "food"], ["  It was very unpleasant because the strawberry had the smell of chopping board, but I endured it without complaining.", "food"], ["  It's annoying just thinking about it", "none"], ["Amazing food.", "food"], [" Crab bites, chicken wings , thai lemon chicken, staff is good, but REALLY slow service and is always over crowded.", "food, service, atmosphere"], ["Excellent service.", "service"], [" The food was tasty And timely.", "food"], [" Definitely would recommend this to a friend or family", "none"], ["As the name says cheesecake is their specialty but they also have amazinggggg veggie burger and breads.", "food"], [" Will go back.", "None"], ["They gave more food.", "food"], [" Posh & a bit costly restaurant.", "Atmosphere"], [" Very less vegetarian options", "food"], ["They have the best cheesecakes.", "food"], [" We had our order to go and it was very quick.", "service"], [" Staff is always very nice.", "service"], [" The Godiva chocolate cheesecake is amazing!", "food"], ["Ordered the fried calamari and an egg roll dish.", "food"], [" 20-30 minutes I get the egg rolls and I’m told they’re out of calamari.", "food"], ["\nI’m so done with cheese cake factory restaurant, I have been to several …", "food"], ["Food was great!", "food"], [" But the waitress took forever after we were seated", "service"], ["They give u the thinness  slices of cheese cake  for takeout, not worth it!", "food"], [" Might as well stood and ate as long as we waited to get 2 slices just for them to be thiner than the slot in the package  on top of completely ignoring my request for a specific slice.", "food"], [" not worth it.", "none"], ["Our first Dining experience when visiting the area and one we were greatly looking forward to having visited other branches around USA and being blown away.", "food"], [" WOW how one branch can let a brand down !", "service"], [" The worst service I have ever …", "service"], ["This worst branch of the Cheesecake Factory.", "none"], [" I am really obsessed with this brand but this location is really bad!", "location"], ["This  Waiter named Eric was amazing .", "service"], ["he made our night fun.", "atmosphere"], [" He listened to what we ordered and got it right.", "service"], [" He is super awesome.", "none"], [" Please ask for Eric when you visit this restaurant and tip him good.", "service"], [" Also he is handsome without his mask  .", "none"], [" Thank you Eric.", "none"], [" You so rock.", "none"], ["Very poor service.", "service"], [" It was as if the waiter was selective in ignoring my table and I am sure he thought he was doing me a favor by taking my order and bringing in food.", "service"], [" I would skip this restaurant.", "none"], [" Everything from bringing in water to bringing in napkins, was a challenge for this restaurant.", "service"], [" I would give negative stars if I could.", "service"], ["Delicious as always, nice service.", "food, service"], ["Painfully slow service, pasta was very drive, and shrimp was overcooked.", "service"], [" Usually had a good experience in Cheesecake Factory until i dined in at this location.", "service"], [" May be kitchen has a bad day or it was just end of day fatigue.", "Service"], [" Happy that my neighborhood Cheesecake Factory is not this bad.", "food"], ["Good environment.", "atmosphere"], [" The inside is beautiful.", "atmosphere"], [" friendly staff, great food, and clean bathrooms.", "food"], ["I love cheesecake factory food and decided to order dinner,factory nachos, Evelyns pasta, fettuccine and of course cheesecake.", "food"], [" I was so disappointed in the food.", "food"], [" The nachos were soggy and very oily.", "food"], [" The fettuccine was good but the Evelyns …", "food"], ["Excellent service.", "service"], [" Fresh as hell delicious cheese cake ( you know ).", "food"], [" Huge sitting area to enjoy the meal.", "atmosphere"], ["I sat at the bar and the service was really good.", "service"], [" I ordered a drink and a lemon cheesecake which was very delicious.", "food"], [" Overall Good experience.", "none"], ["The Grilled Salmon and pasta was the best.", "food"], ["  Then finally: the Raspberry lime cheesecake, I was out after that folks!", "food"], [" Very satisfying food always.", "food"], ["I have never seen this place empty!", "atmosphere"], ["\nThe menu is vast with so many options to choose from.", "food"], ["I ate the worst mashed potatoes there, they mash the potatoes with the skin without adding any milk or butter  …", "food"], ["Server Jasmine was dope and looked after all the allergies we had.", "service"], ["\nGave plenty of recommendations and was a laugh in general.", "Service"], [" Manager on duty was also delightful.", "service"], ["They food is always good  …", "food"], ["Great place beautiful atmosphere great staff food great for the price point also very inexpensive offerings", "atmosphere"], ["Friendly staff, lovely salads.", "food"], [" Above average for the US.", "none"], ["Great place, not only for cheesecake.", "food"], [" New skinny options are great option if you do not want a 2000+ calorine meal.", "food"], [" Also great selection of beer and wine - try the CF private reserve.", "food"], ["The place is ok but the food wasn't good enough than I expected", "food"], ["Not a fan at all.", "none"], ["  Cheesecake factory has always been hit of miss for me, and I don't mean overall.", "food"], ["  I mean by location.", "Label: location"], ["  Some locations are a hit and some are a miss.", "location"], ["  This is one of those restaurant chains that can easily leave one disappointed due to the individual quality and management of each restaurant.", "none"], ["Food was  pretty good the franchise cut the food portions down place  is big spacious", "Food"], ["Terrible service!", "service"], [" Awful tasting cocktails that didn't worth the $15, delayed taking our orders for more than 20 mins.", "food"], [" And the slices of Cheesecakes have  downsized but paying the same price.", "food"], [" Second time there.", "none"], [" Both times was awful.", "none"], [" I will not go again.", "service"], ["This is my first time at the Cheesecake factory.", "atmosphere"], [" They are out of lasagna, Korean cauliflower and bread by 2.", "food"], ["30pm on a Saturday.", "none"], [" The fried Mac and cheese were a bit salty.", "food"], [" It's been close to an hour since we ordered the impossible burger.", "food"], [" Service is way too slow.", "service"], [" I had better expectations.", "none"], [" Maybe they were under staffed", "service"], ["The second time I came this year is today.", "none"], [" I was very DISAPPOINTED that my waiter was inconsistent with wearing his mask.", "Hygiene"], [" Hostess and some waiters don't take mask wearing seriously at all and some don't even wear it.", "hygiene"], [" You put all your …", "none"], ["I enjoyed visiting this location.", "location"], ["  The food was great, and the service was excellent.", "food"], ["My favorite place to eat !", "food"], [" Alot of Gluten Free options to choose from.", "food"], [" Even the with the cheesecake  …", "food"], ["Service was lacking hard.", "service"], [" Food was OK.", "food"], [" Cold fries and I asked for coffee.", "food"], ["  Came in a glass cup, no cream or sugar.", "food"], [" Server didn't ask if we wanted refills.", "service"], [" Just not a good day here", "none"], ["The food is good as always.", "food"], [" The service is a little slow.", "service"], [" They usually have the birthday celebration cake available, which is really good", "food"], ["What a disappointment!", "none"], [" After we were seated, and received our drinks, we went to order our food and we were then notified that they didn't have anything we were going to order.", "food"], [" The pasta station was closed.", "food"], [" Half of the apps they didn't …", "none"], ["Our server was really nice but service was really slow.", "service"], [" While the restaurant was mostly empty when we arrived it quickly filled up and it felt like it was really understaffed.", "service"], ["It's a really nice place to dine in, and i rate the service with 5 stars.", "service"], [" specially \"samm\" she interacts beautifully with their customers.", "service"], [" loved the steaks", "food"], ["My experience may differ from others but I rate this Cheesecake Factory a 1 because when you order from the Cheesecake Factory you expect quality and good customer service especially for the price you pay.", "service"], [" I did not receive that.", "None"], ["The costumer service it's good, but if you are looking for something that is worth your money, do your self a favor and don't come.", "None"], [" The place it's okay on its self, food it's mostly warm, my friends Chicken Carbonara was tasteless, the sauce had no flavor.", "food"], [" Almost like water.", "food"], [" It's good just to kill the hunger.", "food"], ["I ordered a Stella, and he poured me an ipa even though I ordered a Stella draft….", "service"], ["Got angry when I told him it not was a Stella (a foggy beer is not a Stella) and tasted all wrong…!", "food"], [" Gave me a new one, and now the one I ordered from the …", "food"], ["Excellent overall menu.", "food"], [" Made the mistake of not ordering my burger rare and received a shriveled hockey puck instead of a juicy patty.", "food"], [" Also noticed that over the past thirty years, the price of cheesecake has tripled and the size of the …", "food"], ["End of night.", "none"], ["  Saute station was closed so available menu was very limited.", "food"], [" The food we did receive was not well prepared.", "food"], ["  An under cooked burger, over cooked macaroni and cheese bites, and a caesars salad with no croutons.", "Food"], ["  Waitress was …", "service"], ["Great food, however service could of been better.", "service"], [" Didn't even get my Daughter's birthday cake and song because we waited over 20 minutes for it and then canceled dessert.", "service"], ["Came here just for dessert and french fries in the afternoon, and let me tell you, the cheesecake is out of this world.", "food"], [" The best I've ever had!", "food"], [" The one I ordered was Banana Cream Cheesecake, incredible, I haven't even tried the other …", "food"], ["Red velvet and Oreo dream cheesecake is too good.", "food"], ["We ordered Korean style spicy cauliflower.", "food"], [" Which was sweet without the spice.", "food"], [" If you want spicy food, look elsewhere.", "food"], [" I am terribly disappointed.", "none"], [" Staff were great.", "service"], [" Going above and beyond.", "service"], [" The food options, not so much.", "food"], ["\nCheesecake factory should go back to focusing on cheesecakes alone.", "food"], ["We visited in a group not 20 people.", "none"], [" Had given prior  booking but on reaching we had to wait for 20 minutes.", "service"], [" The food was good.", "food"], [" We found multiple veg options too.", "food"], [" The food was served quickly during lunch hours which was good.", "service"], [" We asked for …", "service"], ["The server Leo was excellent and the food was pretty good as well, the Classic burger was very good I thought and the service was very fast.", "food"], ["The food was amazing.", "food"], [" I went there yesterday and the pizza was wonderful.", "food"], [" The pasta was to die for the and the burgers were heavenly.", "food"], [" The milkshakes and cheesecake really brought the whole meal together.", "food"], [" It was wonderful and I can't wait to go back again.", "atmosphere"], ["About 3 weeks ago I wrote a review giving 5 stars.", "none"], [" But today I am giving 3 stars because the server was very rude ( throwing the container on the table) , not asking if we would like to have something else.", "service"], [" It seems that he doesn’t like his …", "food"], ["Loved the ambience!", "atmosphere"], [" Quantity and quality both are perfect.", "food"], ["It was a good meal.", "food"], [" They were very crowded but we got a table within 15 minutes.", "none"], [" Our server was great, answered all our questions and was a delight.", "service"], [" I enjoyed their frozen margaritas.", "food"], ["I’ve given one star because there’s no option for less than this\n\nWe’ve been to CCF quite often and enjoyed food.", "food"], [" Being vegetarian options are …", "food"], ["The food here is like amazing, the quantity was great like we ordered 8 dishes but were done eating after the third dish itself (between 3 people) the service was good but it was a lil slow as this place is always packed up!", "food"], [" The chicken …", "food"], ["The cheesecake stall takes an awful amount of time to prepare takeout orders.", "service"], [" Worst part, cashier entered our order wrong and we were made to wait over 25 minutes to get our order.", "service"], [" Customers who came before/after us got their order fast …", "service"], ["Checked in to make a reservation for the Bar area at 5:15PM on March 19th.", "none"], [" When we were called and arrived, we found that all the bar area seats were full of recently seated guests .", "atmosphere"], [" The host we made reservations with directed us to a …", "location"], ["Came to this place with my girlfriend to eat after being seated right next to us three family sat next to us the waiter came over and attended the three families that came in and set down after We did.", "service"], [" The waiter Steven served all three …", "service"], ["Very bad service and attitude of receptionists.", "service"], [" (Not service staff).", "none"], [" Standard of food ha also gone down very much in this Cheesecake Factory.", "food"], ["Normally I have a relatively fine experience, today there was not only a complete lack of communication from one department to the other but also just very rude support in general.", "service"], [" Very disappointed", "none"], ["Food was hot and great", "food"], ["Been here several times but today 10/30/21 the hostess was such a disorganized mess.", "service"], [" Couldn't keep track of anyone or the seating.", "service"], [" A good 1/3 of the restaurant unseated and a long line out the door.", "atmosphere"], ["  She clearly didn't know what she was doing or was way to overwhelmed with the 2pm rush.", "service"], ["If you get half an hour before closing time.", "none"], ["just forget coffee!", "food"], ["  We were not informed as normally other restaurants do, that the kitchen was closed already, and even got a \"hurry up\" message:  \"no coffee,  we are EVEN closed\" while we saw …", "service"], ["Our server Shantelle was one of the best I have encountered in a while.", "service"], [" She was cheerful and friendly and took time with us despite the restaurant being so busy.", "service"], [" We didn't feel rushed at all.", "none"], [" The food was really good albeit a bit on the …", "food"], ["The Service was horrible today.", "service"], [" From the bar to the server.", "service"], [" Everything took about 20 mins.", "none"], [" Me and my grandma had the worst experience and had to send back both our food and drinks.", "food"], [" The worst part is they weren’t even busy!", "service"], ["Not managed well.", "service"], [" My boyfriend specifically told the waiter that he’s allergic to shellfish, the waiter even wrote it down on the order sheet.", "service"], [" My boyfriend received his food, ate it and it was shrimp in it.", "food"], [" The waiter apologized, got the …", "service"], ["This location falls short.", "location"], [" They are dirty.", "hygiene"], [" They lack quality in the food they prepare and service.", "food, service"], [" They sit you in dirty seats and filthy floors.", "hygiene"], [" The silver wear is crusty and hair on the napkins.", "hygiene"], [" The employees stand around and chat to one …", "service"], ["If you're looking for a fine dine experience, friendly staff and hot food served in-time, then please choose to go somewhere else.", "service"], [" At this cheesecake, our server was very rude.", "service"], [" It was a task to call her to get something and they seem like …", "none"], ["We ordered cocktails and appetizers while we waited for our take-out.", "food"], [" The service wasn't bad at our table.", "service"], [" The problem is that when we got home we realized that one of our orders was not in the pre-packed bag that we were charged for.", "service"], ["Great hospitality & well seasoned seafood!", "food"], ["This location is honestly the worst.", "location"], [" My family and I waited over 90 mins to be seated which wasn’t an issue but once we were called for the table we had to wait an additional 10 mins and was told “they’re cleaning your table now” which …", "service"], ["Service - 3\nFood - 4 …", "Food"], ["I was quite pleased with my experience here.", "none"], [" The waiter was nice and patient, and the food was delicious.", "food"], [" It’s a good problem to have when a menu is so big you can’t even decide what to get.", "food"], [" Really liked the chicken and shrimp dish that I …", "food"], ["- Waiting Time : It doesn’t matter whether you make a reservation or not - you should always be ready to wait.", "service"], [" Twice, I have made a reservation and both the times I was told wait for 20 min.", "service"], [" In addition, the reception desk ladies are not …", "Service"], ["Wait was a little long.", "service"], [" Food was great, cheesecake.", "food"], [" Say no more!", "Great! Let's get started. Please provide the comment for me to label."], ["Food is amazing.", "food"], [" The manager is a sweet heart but the service is the worst I have ever received.", "service"], [" Honestly they advise you its an hour its tKes them an hour to sit you down.", "service"], [" The appetizers got to my table cold.", "food"], [" There wasnt any ice available …", "none"], ["It's a lovely place the food there tastes  wonderful for both adults and children.", "food"], [" I will definitely be coming back there for more.", "None"], ["The best Cesar chicken salad to try is here Also, Mac & Cheese balls  …", "food"], ["The food and drinks were amazing and the portions were big but the service was bad.", "service"], [" After bring us the drinks and food she didn't check on us at all, only after we were done eating.", "service"], [" The restaurant wasn't busy at all and she checked on her …", "atmosphere"], ["Excellent test of cake and so many varieties.", "food"], [" I love cake here and food.", "food"], ["Ordered for dinner via delivery.", "none"], [" Everything was excellent!", "none"], ["\nThe mushroom burger was amazing!", "food"], [" Perfect seasoning, sauce, mushrooms and bun.", "food"], ["\nThe fish and chips did get a little soggy but that can't be helped for delivery …", "food"], [" Wish they had a birthday discount on cheesecake …", "food"], ["One star only to comment.", "none"], [" I do not recommend anyone to visit this restaurant ever.", "none"], [" The reason for the staff from the manager to the workers is the worst treatment and very slow.", "service"], [" I hope the entire staff will change because it affects the place", "service"], ["Very nice staff.", "service"], [" I once had issue with the food and they replaced my order with no questions asked.", "service"], [" They are open till late even after mall closes which is a blessing during Covid policies.", "none"], [" Fresh bread and fresh food.", "food"], ["Service can be more friendly… otherwise 7/10", "service"], ["Food was great.", "food"], [" But service was very slow", "service"], ["We spent 20m waiting for the server.", "service"], [" An hour for the food to be served.", "service"], [" I ordered Jamaican shrimp but it was some random shrimp curry with a few cilantro on top.", "food"], [" The rice was uncooked.", "food"], [" It was evident that they were understaffed and the some of the servers were struggling to keep up.", "service"], ["Went here over the weekend and disappointed by the lack of food from the menu.", "food"], [" I had to order a random meal just so I have something to eat in our party and the food was not good.", "food"], [" The server was nice that’s why I’m giving this two stars but it was unacceptable.", "service"], ["Newport Mall, Jersey City.", "location"], [" Absolutely terrible.", "none"], [" Was told a 20 minute wait, waited 40.", "Service"], [" Went next door to Panera, waited, orderd and ate.", "food"], [" An hour and a half later, still have not received the text message.", "none"], [" So I first visited this when it originally opened and the food was salty!", "food"], [" 3 different dishes!", "food"], [" I chalked it up to the new beginning.", "none"], [" I then went again this past week (date wanted to go).", "none"], [" I walked in and went to the host station.", "none"], ["Excellent food, nice environment.", "food"], [" Great place to share with family and friends", "atmosphere"], ["We were observed like animals , the food was probably amazing and the people were probably amazing, but the men at reception looked down at my kids and my husband and addd another 45 minutes to our time, but let other people through!", "Service"], ["I'm sure the cheese cake is good but never got to taste it.", "food"], [" My wife and I were shopping and she suggested we eat at this location.", "location"], [" She has in the past had a good experience in other locations, but has never been to this one.", "none"], [" It was my first …", "none"], ["The cheesecake was great, and since it was the server’s choice I’d say trust their recommendations if you’re confused.", "food"], [" A nice vibe, with very sweet employees and yum cheesecakes", "Food"], ["Marghenello is a miracle.", "food"], [" He’s the most quality server I’ve seen at a Cheesecake Factory x10.", "service"], [" He made my bf and I’s first truly spontaneous date a super warm, cared for, and delicious experience.", "service"], [" I think we really started feeling our love …", "none"], ["So we decided to come here on a Saturday evening on and try this place because it was a new place for us.", "atmosphere"], [" We had never been there and everybody talks about it , what looks to be a promising place with a dark bar like atmosphere seem to have …", "atmosphere"], ["We know the food is good but I had a horrible experience at this outlet.", "service"], ["\nFirst of all I don't get why cheesecake doesn't have online reservations specially when they have a good demand.", "None"], ["Poor care to attending customers, waitress was mad when light things were asked such as refills and ordering.", "service"], [" To add on, the utensils were dirty and waiters didn’t give much care for it, to add on the table had bugs on it.", "hygiene"], [" These are clear …", "None"], ["Not too bad but not that great.", "none"], ["The pasta I had was good but too creamy and greasy.", "food"], ["  A lot of things are over priced too.", "none"], [" It's an ok place to eat.", "food"], [" If you want basic food give it a try.", "food"], [" There aren't many places for indoor dinner these days that's the only reason I walked in.", "location"], ["Today I made a reservation in this place and they gave me a wait of 40 minutes, after waiting that long they told me that they were sorry and that I had to wait 40 more minutes and that they do not send text messages to communicate the …", "Service"], ["It took me awhile to figure this out for the first time, and I hope this message is seen by the young lady who so very kindly seated and helped my daughter and her two friends the other evening.", "service"], [" I was told she seated them, brought them …", "service"], ["Such a \"great\" experience here started with a waiter who spilled coke on our clothes.", "hygiene"], ["\nThe waiter didn't help us to wipe out the drink.", "service"], ["Food was great however service desires to be better.", "service"], [" Our server was overly busy.", "service"], [" Not her fault I guess but very slow in bringing our drinks.", "service"], [" She almost never asked us if we need anything.", "service"], [" We kept asking for her.", "none"], ["Waiting staff were very knowledgeable and attentive (as we had been there twice in 1 week).", "service"], ["  Everyone enjoyed their meals, the Ribeye Steak were prepared perfectly and we left pleased.", "food"], [" I would've given 5 stars but I was very turned off by …", "none"], ["We didn't get to eat.", "food"], [" But the place is clean friendly.", "hygiene"], [" People were hospitable.", "service"], ["Wonderful place and food great service awesome employees!", "food"], ["I'm rating this place with 1 star, even though I wish I could give them 0!", "None"], [" Trust me- make the drive to Menlo Park Mall, you'll thank me later.", "location"], [" Myself and three other people went yesterday to celebrate an early Valentine's Day.", "none"], ["Big portion size, love it", "food"], ["Worst Cheesecake Factory ever!", "food"], [" My hubby and I have been to so many cheesecake factories in different cities.", "none"], [" We needed to drop off someone at EWR airport so we went to this one.", "transportation"], [" I put my name on the list and was given a buzzer, when I …", "none"], ["I am so happy with the servers from this place.", "service"], [" They are so sweet and humble.", "service"], [" Alexandria the dancer is super sweet and funny.", "none"], [" she will make anyone feel better.", "none"], [" I was super tired that night i went and she wasn't even our server but she made …", "service"], ["Best cheesecakes!", "food"], ["I am giving this review just for the maintenance and the way how they received.", "none"], ["\nMaintenance is not at all good, there is dust settled around the lamps, chewing gum under the tables, tumbler for water is too old.", "hygiene"], [" If you are going in just to buy a cheesecake.", "food"], [" First they forgot to pack the order for long.", "Service"], [" Then there was a minor confusion between the lady who took the order and the one who packed our cake.", "service"], [" The girl who took the order didn’t …", "service"], ["Very good place to come with your family we ordered ribeye steak and it was juicy and delicious", "food"], ["This has to be the worst dining experience I have ever had.", "service"], [" We entered the restaurant with a tired child who wanted to sleep and so we requested a larger booth.", "atmosphere"], [" A host set us up.", "Service"], [" We never saw him again, but 3 others including a very rude …", "service"], ["Our waitress was attentive and accommodating.", "service"], [" The food is the reason only two star.", "food"], [" We had apps and entrees.", "food"], [" The apps were good but the side dish of Mac and cheese was watery and bland along with the fries being stale and just reheated.", "food"], ["Sadly not a great expierence  at this Cheesecake Factory.", "none"], [" To start we waited about 30 minutes to be seated, which is normal in this restaurant.", "service"], [" After that we ordered and we waited about 40 minutes for the food to come to the table.", "service"], ["Everything was perfect we enjoyed it", "none"], ["My party and I were seated pretty quickly, maybe a minute or two after we walked in.", "service"], [" It took a while for the server to come and take our order, but once he did the food came pretty quickly.", "service"], [" The restaurant seems very disorganized!", "atmosphere"], [" Our server …", "service"], ["The portion sizes were fairly large.", "food"], ["very good for the price!", "none"], [" You must try a desert when you are there!", "food"], [" The portion sizes for the cakes are fairly big, you can share with another person and still probably not finish the entire piece in one …", "food"], ["Food was okay.", "food"], [" But WORST service ever.", "service"], ["My friend and I were seated within 15 minutes on a busy Saturday evening.", "None"], [" The outside patio is neat and on a quieter end of the mall, which makes it relaxed and comfortable.", "atmosphere"], [" Our food came out promptly.", "service"], [" Our hostess got confused a couple of times (I assume she was new), but she was very friendly.", "service"], ["Food doesn't have the same kick to it, I order something with chicken in it and it tasted like fish.", "Food"], [" Sit in the bar area during happy hour and the servicer tried to charge me more.", "service"], [" Drinks were very wet down.", "food"], [" Save your dollar not worth the price", "food"], ["Service was slow, place was bustling with people, but you can tell the staff tried their best to make the experience positive for us, which they did.", "Service"], [" A few waiters would either forget our request for bread, or bring in a batch after we …", "service"], ["Love the food, but I wish the menu had more items that were not over 1,000 calories each.", "food"], ["Worst Experience Ever!", "service"], ["\nMe and my friend went to this place last night for the dinner, initially no one was attending us for 20 minutes, after that we ordered a dish of pasta and fries …", "Service"], ["I feel so upset about this restaurant.", "none"], [" Please leave the tables right in front of the restroom unoccupied until the last minute for the guest who insists on having food there enduring displeasure.", "service"], [" (There is no such food worth enduring it, I …", "Food"], ["I used to love this place but today I had a bad experience.", "Service"], [" food is still very good but it is monday, it waa not that busy the restaurant.", "atmosphere"], [" It took forever to take my order, get my drink (water btw).", "service"], [" waitress kinda rude when we say hello …", "service"], ["While in Newport mall I decided to stop in an have a cocktail and grill chicken Ceasar salad.", "food"], [" I also had the crab and artichoke dip.", "food"], [" The temperature was rather warm inside the restaurant but besides that it was ok.", "atmosphere"], [" My waitress was a delight.", "service"], ["Waitres was very professional.", "service"], [" Great service.", "service"], [" Food was very good.", "food"], ["If you're not sure what to eat, a cheesecake factory can be a great option since it offers a variety of options to choose from that can please everyone.", "food"], ["Dirty utensils.", "hygiene"], [" Ordered a medium well Classic burgers which came to be served as overcooked and no flavor.", "food"], [" The waitress attending to my table wasn't attentive enough only showed up to take my order and to give the bill.", "service"], [" Overall service is okay, burgers ate bland however atmosphere is pretty okay.", "food"], ["Great service great atmosphere and great  waitress \"Heather\".", "service"], [" The food was very well prepared and delicious  I was very happy to share the experience with my daughter and her friends other mother.", "food"], [" It was a Cleveland Ohio thing happening up in Jersey City!", "none"], ["Only reason I gave it 5 stars is because I couldn’t eat the food I ordered because I’m allergic to mushrooms and it’s in my food but my family seemed to really enjoy the food they received.", "food"], ["Our server Omar L was wonderful, pleasant and attentive, he made the experience great, he was able to get the kitchen to make the changes we requested for our pasta dishes.", "service"], [" First time we ever finished the food because we enjoyed it so much.", "food"], ["A few days ago, was the first time ever I visited the establishment, although I am a local and have had many opportunities to visit in the past.", "location"], [" So, this experience was well anticipated.", "none"], [" Super impressed by interior decor and my husband and …", "atmosphere"], ["The service here is horrible.", "service"], [" The utensils are dirty.", "hygiene"], [" We had to order hot water and dip our knifes, forks, and spoons in it to clean them.", "hygiene"], [" The bathroom had no toilet paper.", "Hygiene"], [" We waited very long to get our cards back from paying.", "service"], ["We had a horrible experience in this restaurant.", "service"], [" From the second we arrived at our table the waitress had a terrible attitude.", "service"], [" As we were ordering she said (ya doing to much).", "none"], [" So we got up and left.", "None"], [" It was my sons birthday and she ruined it.", "service"], [" One of his birthday request was eat at this restaurant, and he was so sad.", "food"], ["Can't beat Happy Hour at The Cheesecake Factory after a long work day(pandemic or not).", "atmosphere"], ["\nTheir Happy Hour menu is the simplest menu you will find from their \"book-like …", "food"], ["The hostess took us to our table.", "service"], [" There was a chair that was missing.", "none"], [" She got us back to the front.", "location"], [" Told us that the other hostess will help us.", "service"], [" The other one took us to the same table and asked us to wait.", "service"], [" She then got a chair from the …", "none"], ["Came here for lunch with a coworker, not impressed.", "food"], [" The hostess had an attitude.", "service"], [" I told the server twice for no mushrooms in my cheesesteak and it was still given.", "service"], ["The first star is required for the review.", "none"], [" The second star is for the wait staff.", "service"], [" They were all very nice and we left a good tip.", "service"], [" The food however is terrible.", "food"], [" I was so sad after coming here.", "none"], [" I have been to many Cheesecake Factory's and …", "food"], ["The first time I went there with my husband was good we loved every thing about it.", "atmosphere"], [" The second time was not good at all the girl who supposed to take us to our table was very rude to my husband.", "service"], [" She was calling his name, then we went there.", "none"], ["Great service from the reception desk to our server!", "service"], [" Food was good!", "food"], [" Only complaint was that my French fries were cold but our wonderful server brought me hot fries without hesitation!", "food"], [" I highly recommend the Keylime martini!", "food"], [" Yummy and of course their cheesecake is why we go there!", "food"], [" Delicious!", "food"], [" My fav is the Dulce de Leche!", "food"], ["I've never been to this cheesecake factory before and never will again.", "food"], [" I understand when places get busy the service may go down a little but my boyfriend and I left so annoyed last night.", "Service"], [" It was a 25 minute wait which was fine.", "none"], ["The spaghetti and meatballs was plentiful and delicious.", "food"], [" The chicken cesar salad was also very tasty.", "food"], [" The potstickers were not hot when they came out but still tasty.", "food"], ["  However, it was a little cold inside and it took awhile for food to come.", "Atmosphere"], ["With Cheesecake Factory, once you been to one, you know what to expect.", "None"], [" The differencing factor is the wait time and service.", "Service"], [" According to Yelp current standing it is at a 3 star.", "none"], [" Experience can change from time of day to server.", "service"], ["The service was great.", "service"], [" The food was delicious.", "food"], [" However I'm not sure if it was because i went on a friday night but, the food took a while to come out and with 2 lil ones with me and no crayons to help keep them entertained I'm gonna rethink …", "service"], ["Me and my family went there this week.", "none"], [" We was told it was a great place to dine.", "atmosphere"], [" The customer service was great.", "service"], [" Most of the food looks good, however, I was not satisfied with my order at all.", "food"], [" I didn't like the food and my family was not impressed either.", "food"], ["\nOVER RATED!", "none"], ["Freshly preparex tasty food with attentive curteous service.", "food"], ["We took my grandson to the Cheesecake Factory, for his birthday.", "none"], [" I absolutely love their avocado toast and Korean spicy cauliflower.", "food"], [" I'm so glad to see that they survived the Pandemic, when so many other businesses have gone under.", "none"], ["Serena is a lovely waitress!", "service"], [" Very intuitive and responsive.", "service"], [" Dominic is a fantastic manager who went above and beyond to ensure we had a great experience.", "service"], [" Very unexpected & most appreciated.", "none"], [" Definitely stands out.", "atmosphere"], ["Extremely disappointed with the service.", "service"], [" The girl who reserves the table at the New Port location has zero regards to customers.", "service"], [" She wasnt even answering the timing questions properly.", "service"], [" She was so rude to my friend that we had to leave the …", "service"], ["Patrons walking around with no masks, appear menus not sanitized, tables not sanitized, and when we came in at 11am at opening it was fine but the hostess put all four tables RIGHT NEXT TO EACH OTHER in a COMPLETELY EMPTY RESTAURANT.", "hygiene"], ["The  ambiance was great as well as the service and the waitresses we're very friendly.", "atmosphere"], [" Also the food  presentation was amazing, but the food lacked flavor and was very bland.", "food"], [" The strawberry lemonade was a bit more sour than sweet , and the …", "food"], ["Menus and tables are sticky, fries were chewy and stale, margherita was watered down, their water tasted gross, it was very mind numbing waiting for the server to come back after we were done with the food", "food"], ["Not so good \nThe place was not clean.", "hygiene"], [" The service was very slow and they brought the dishes that people ordered at long intervals and as a result some of us eat very cold dishes.", "Service"], ["Never again.", "service"], [" I ordered a medium rare ribeye that was cooked burnt.", "food"], [" Probably spent $140 + 20% tip.", "none"], ["  They never replaced and waitstaff was horrible Last time I'll enter a Cheesecake Factory again especially the one in Jersey City.", "service"], ["They worked  very hard to accommodate our group.", "service"], ["  The service and food were excellent.", "service and food"], ["Loved our service.", "service"], [" Very attentive to our table and the food was served hot!", "service"], [" Will come back.", "none"], ["It's been a long time coming, but they finally made it to Jersey City/Waterfront.", "location"], [" Newport has been patiently waiting.", "location"], [" It's located east of the Newport building adjacent to the light rail so need to drive if you're near a LR station.", "location"], ["  Food and waiters are great.", "food"], [" If you work near by, definitely give it a try.", "location"], ["Last month in July w/our lunch special salad was wilted.", "food"], [" The manager Ryder compensated us w/slice of cheesecake & $5 gift card.", "service"], [" Thank You very much for your patience & compassion to give quality service.", "service"], [" Very sad my birthday cheesecake e-mail didn't appear?", "none"], ["The food was great and so was my server.", "food"], [" My issue with this restaurant are the Hostesses.", "service"], [" No eye contact.", "service"], [" No greeting.", "none"], [" They were speaking to each other.", "none"], [" Didn't ask if we wanted a table or a booth.", "service"], [" She sat us at the bar without even …", "service"], ["Went here to celebrate a birthday with cheesecake!", "food"], [" The waitress was great.", "service"], [" She even decorated the plate with a chocolate \"happy birthday\" message, sprinkles,  and provided the little candle.", "food"], [" It was perfect.", "none"], ["Splurged on a big take-out order while quarantined.", "food"], ["  Ordered online and everything was perfect.", "food"], [" Calamari was tender and crispy with a delicious garlic sauce.", "food"], ["  Chicken Costoletta was cooked perfectly, well-seasoned, and the lemon sauce was …", "food"], ["Service was horrible.", "service"], [" We saw the waitress three times.", "service"], [" Once to take the order, once because we needed a refill on drinks, and finally to pick up our plates.", "service"], [" She spent the most time picking up the plates.", "service"], [" Then she had the audacity to put a …", "none"], ["The service was great and the location clean.", "service, hygiene"], [" The food (steak) was great .", "food"], [" The server was on the money.", "service"], [" The lighting and ambiance was nice so all in all would recommend.", "atmosphere"], ["Gloria's The Best .", "food"], [" she made my Experience ultimate and the Team was Great.", "service"], [" cool Place indeed ", "atmosphere"], ["Service was very pleasant But .", "service"], ["\nUpon being seated we were handed menu's that were sticky   and had apparent smudges all over .", "hygiene"], [" I wanted to complain and ask for new Menus but I didn't one …", "service"], ["Worst service worst management this place should be shut down what a horrible experience", "Service"], ["The service was a bit slow.", "service"], [" We waited for 35 mins after ordering for the food on a Monday night around 630pm.", "service"], [" 20mins after we ordered our bar drinks.", "service"], [" Waitress was not super friendly but the food was as typical really good.", "service"], ["Good waitstaff and decent food, but with terrible wait times, lackluster hosts, and a disorganized design up front.", "None"], [" The menu is extremely long, and while it has food of every kind, it might be too much choice.", "food"], [" Cheesecake is good, but much …", "food"], ["I was there with a group of 10 people and our waitress took such good care of us.", "service"], [" A couple of the plates had to be taken back because potatoes and vegetables were not hot, but that was taken care of.", "food"], ["  Over all, it was nice and I am still a fan of the Cheesecake Factory.", "atmosphere"], ["The only thing nice about this place is nothing.", "none"], [" You just keep waiting to get your order for hours and hours and when you finally get it.", "Service"], [" It's the wrong order.", "food"], [" I wouldn't recommend anyone to visit this location.", "location"], [" Please prefer to travel slightly further then to come here and waste your time.", "location"], ["Had ordered from this place after a long time of home cooking in quarantine.", "food"], [" Sadly the salad had sand particles in it, like we get when lettuce is not washed.", "hygiene"], [" Had to throw away everything.", "none"], [" Quantity was too less for the price.", "food"], [" And overall …", "none"], ["For the first time I ate food and drank some goodones here, usually I only eat cheesecake at the Factory.", "food"], [" Food, drink, service everything was good", "food"], ["Great food.", "food"], [" Although it took too long for the food to be ready.", "service"], ["\nThe Waitress was just terrific.", "service"], [" Friendly and helpful!", "service"], ["\nThe Manager was very rude, condescending, and not helpful at all.", "service"], [" She does care about customer comments or making sure a customer has a good experience.", "Service"], ["I'm only leaving it 3 stars because the staff are nice.", "service"], [" However for some reason they can never get this one dish right.", "food"], [" The pasta da vinci.", "food"], [" If you want this dish find another cheesecake factory.", "food"], [" I'm truly disappointed every time I go there …", "service"], ["The manager Dom was very accommodating and understanding of our group.", "service"], [" Just with his customer service it was enough to assure our return.", "service"], [" We had people that were here for the first time and Dom made their first time a great experience.", "service"], ["Food was amazing and so was the service.", "food, service"], [" Clean friendly atmosphere and family oriented.", "atmosphere"], [" If you haven't been here please do this place is awesome.", "atmosphere"], ["Always happy with food at Cheesecake Factory.", "food"], [" Always good service.", "service"], [" Portions are great.", "food"], [" be careful or you won't have room for Cheesecake!", "none"], ["I was excited to try the cheesecake factory as we dont have them in England.", "none"], ["  Service was friendly, but made lots of mistakes, and the place looks up market.", "service"], ["  We went for breakfast/brunch before going to giants game, however the experience …", "none"], ["I’m not pleased at all.", "none"], [" They’re very unorganized.", "service"], [" My reservations were confirmed 3days ago at 7pm for 14 people.", "none"], [" It is now 8:05 pm and we’re still waiting.", "service"], [" I am extremely disappointed .", "none"], [" Never, ever again", "none"], ["Staple of the American lifestyle.", "none"], [" Gio was our waiter, fantastic.", "service"], [" Brown bread point as always.", "food"], ["The service was excellent as was the food we'll go back again", "Service"], ["Had the truffle crunchy chicken.", "food"], [" With mash potatoes and asparagus was very filling.", "food"], [" Finished it and great flavors.", "food"], [" With cinnamon cheesecake.", "food"], [" Also try the their celebration cheesecake.", "food"], ["  They rarely disappoint.", "food"], [" Service was great.", "service"], [" You still get the free bread.", "food"], ["That was the most delicious spicy chicken burger I've ever eaten.", "food"], [" Amazing service, amazing food.", "food"], ["I’ve been to many cheesecake factories in NJ and I’m a huge fan.", "food"], [" This one in particular has let me down multiple times.", "service"], ["\nThe servers style is not customer service driven.", "service"], [" The servers take their time …", "service"], ["It was my first time at The Cheesecake Factory and It was a disappointment I did not even get to eat or get seated onto a table due to the fact that the host was being rude we entered and was told to wait 5 minutes the 5 minutes past and we …", "service"], ["To start with, all covid measures were in place.", "hygiene"], ["\n\nI ordered quesadilla, kids pasta and impossible burger.", "food"], [" Also cappucinno …", "food"], ["Really good food really good rations really good drinks really good vibe I just wish it wasn't so dark if you're dining in the day it's fine but the later you dine the restaurant seems very very dark and you have to kind of use your phone …", "atmosphere"], ["It has been some years since I last eaten at cheesecake factory.", "food"], [" But I agreed to meet up with a friend for dinner there.", "none"], [" We both ordered at the same time but my friend's order came out first.", "service"], [" Mine came out about 20 minutes later.", "none"], [" The turkey …", "food"], ["I agree with some of reviews below.", "none"], [" Waiting staff is great but their efforts are negated by hostess who clearly either doesn't have system in place to know how you have to wait for a table or is plane incompetent.", "service"], [" I liked food and for …", "food"], ["Have a soft spot for Cheesecake Factory and this branch does not disappoint.", "food"], [" No, it’s not gourmet food nor does it pretend to be.", "food"], [" Cheesecake is excellent.", "food"], [" This particular outlet has seating inside the restaurant proper as well as an …", "atmosphere"], ["Everything was good, but I personally like places where I can clearly see my food.", "atmosphere"], ["first night staying in the area for a NYC getaway.", "Location"], ["  visited one weekday night, 2 hours before closing (9pm).", "none"], ["  hostess informed of a 20-min (at least) wait for tables (in JC!", "none"], ["), so jumped to the free-for-grab bar table.", "atmosphere"], ["  waitress was lukewarm …", "service"], ["The food is good but the service is sub par for what they charge.", "Service"], ["    Inexperienced teens and just out of teen years.", "none"], ["  I've learned to tell them how to serve my coffee: bring coffee, bring milk, bring sweetener, bring a spoon.", "Service"], ["After a long wait due to being given a broken buzzer my gf and I were finally seated.", "service"], [" Our waitress, Andrea V, greeted us by saying \"do you know what you want\", and nothing else.", "service"], [" We only saw her twice more the entire evening.", "none"], [" No refills, no …", "service"], ["Came in today, Saturday during dinner.", "atmosphere"], [" Only waited a little less than 15 minutes.", "none"], [" The staff are friendly from the start to finish.", "service"], [" Our first waitress is beyond amazing!", "service"], [" I wish I remember her name but I'm bad with names.", "none"], [" I do remember her …", "none"], ["I've been to the Cheesecake Factory many times but this was my first experience at this location.", "location"], ["  To start, the restaurant looks really nice as it's fairly new.", "atmosphere"], [" It wasn't busy but it took about 10 minutes to be seated.", "service"], ["  Service was good …", "service"], ["I love The Cheesecake Factory restaurants.", "food"], [" They offer a consistent menu with great cakes.", "food"], [" The service was friendly, attentive and efficient.", "service"], [" My kids enjoy the atmosphere.", "atmosphere"], [" Our edamame appetizer was rather greasy and over salted but otherwise this is a great place.", "food"], ["Was good my first time here, last time and today, service was meh.", "service"], [" I got my steak warm served with my appetizer and salad all at the same time, haven't seen my waitress in 20 min.", "service"], ["Horrible experience at “The Cheesecake Factory”.", "service"], [" The servers are too busy, seems they are probably short staffed.", "service"], [" Lots of logistical issues about seat allocation.", "None"], ["My husband and I finally had the chance to go dining at the new Cheesecake Factory  in downtown Jersey City.", "food"], [" Arriving at 6:30pm on a Wednesday guaranteed a good table, no wait whatsoever.", "none"], [" Waiting staff was very courteous and attentive since …", "service"], ["Flatbread pizza one of my fav appetizer at Cheesecake with Basil leaves.", "food"], ["I went there last night,  it was not that crowded and we waited for at least 15 minutes before we see the waitress.", "Service"], [" Then we ordered 2 drinks to start and it took a while as well.", "service"], [" Maybe they were short staffed I don’t know, but the manager was very helpful and the food was amazing.", "food"], ["We placed an order on line to be picked up at 12.", "transportation"], [" The order was placed about an hour ahead of time.", "none"], [" However, we waited for over 20 minutes to pick it up.", "none"], [" Furthermore, we requested paper napkins and utensils but nothing was provided.", "service"], ["I just went there yesterday.", "none"], [" The wait time was long understandably on a Saturday- we were told to wait for 35 minutes for 3 people.", "service"], [" Once we were ushered to our table the hostess was really nice and pleasant.", "service"], [" The appetizers, both chicken …", "food"], ["Best chain ever and I never eat at chain restaurants!", "food"], [" These guys have a fantastic menu and the music makes it feel like a party.", "atmosphere"], ["We have always enjoyed excellent service as well.", "service"], ["The menu selection is long and diverse so there is lots of good stuff to choose between.", "food"], [" Service is always suberb and the staff are always very friendly.", "service"], [" They are quite fast and efficent even if there are a lot of people being served at the …", "service"], ["They have an amazing menu with a variety of options for you to choose!", "food"], [" Cheesecake is their special though having an opportunity to eat in many restaurant and other countries, their food can’t be categorized as the best.", "food"], [" It’s good and …", "food"], ["Customer service was deplorable.", "service"], [" Took my family there to celebrate my daughter's 10th birthday.", "atmosphere"], [" After an extensive wait the table that my family was taken to was not cleaned dirty linens tucked in a corner.", "hygiene"], [" Then after an additional 10 mins …", "none"], ["Service was pretty good.", "service"], [" But overall the cheesecake factory should have more mild options.", "food"], [" It is a ton of things that I cannot eat on their menu because it is spicy and they do not let you substitute it even if you're willing to pay.", "food"], ["The food was nasty, the service was terrible, we waited for 30 minutes just to get bread and water except she brought no water.", "food"], [" Our food took forever, the drinks had like 0 alcohol and the bathrooms were filthy.", "food, hygiene"], ["Delicious food / drink and good service", "food, service"], ["Service was terrible and took forever.", "Service"], [" Food came out cold and didn’t taste great.", "food"], [" Maybe have your staff and managers check in our guests while they are at the table.", "service"], [" It would have been nice if anyone had stopped by to ask how our experience was.", "service"], ["My excitement knew no bounds when it was decided that we will head to The Cheesecake Factory for lunch on a Saturday afternoon.", "food"], [" Little did I anticipate the shocks we were to get.", "none"], ["Strong enough drinks.", "none"], ["food was good but depending on what you order.", "food"], ["the portions may be tiny.", "food"], [" Only waited a half hour tonight.", "none"], ["which is an improvement from my last visit, where I waited an hour.", "service"], [" Of course the cheesecake is  …", "food"], ["Food is ok and drinks are decent.", "food"], [" It is a nice cool place to eat after shopping without having to search for seats in the food court", "Atmosphere"], ["The waiter is attentive but the wait prior was excessive then to be told there is no soup.", "service"], ["  This isn't the first time, if this item is a good seller the manager of the kitchen should plan better.", "service"], ["it's a world of difference from the last visit experience which was a year ago.", "none"], [" it was a welcoming atmosphere.", "atmosphere"], ["staff cared .", "service"], [" actually smiled.", "atmosphere"], ["and worked together.", "None"], ["well oiled machine sorta like.", "none"], ["Not the Cheesecake Factory serving people damn near frozen cheesecakeY’all have to do better.", "food"], ["Very poor service.", "service"], [" Food quality is not bad, but waiters don’t come to you unless you get up and call\none of them.", "Service"], [" They bring your bill before asking if you want the dessert …", "service"], ["It’s unfortunate to order from this place for pick up, to then come home and find the food poorly made and packed.", "food"], [" I almost turned back to the restaurant to bring back the food.", "food"], [" When you’re hungry, you’re hungry.", "food"], [" but wow the type of …", "atmosphere"], ["An hour and half wait turned into 2 hours and 20 minutes.", "none"], [" When calling an hour before they said estimated wait was 15 minutes.", "none"], ["  When we were there said that wasnt true, but that's what the man who answered the phone said.", "none"], ["  They dont know …", "none"], ["The prices are a bit high and the pasta was a little more undercooked than I prefer, but they got the Alfredo sauce nailed perfectly and the Oreo milkshake was great as well.", "food"], ["  Again, a bit more expensive than I would like, but this is …", "none"], ["Note for vegans/vegetarians: the veggie burgers are made with chicken broth.", "food"], [" I learned this two bites into my burger when the waiter told me (they also put aioli on it by mistake).", "food"], [" Super nice but major thing to keep in mind if you don't eat …", "food"], ["Just went to this Cheescake Factory for my sons birthday on Saturday, let me tell you I will never go back again.", "service"], [" Terrible experience!", "service"], [" Firstly the greeter was totally disinterested in gretting, she continued to chat with other staff …", "service"], ["Good service.", "service"], [" Many vegetarian options.", "food"], [" Love their tamale cakes,  brown bread n orange spice tea.", "food"], [" Stuffed mushrooms added to the list is super yummy!", "food"], ["I only come for the weekend brunch but since this place usually seems to be crowded on the weekdays, I assume good food and service on the weekdays is also a realistic expectation.", "food"], ["  As I sometimes work from home on the weekends, I usually …", "none"], ["My husband and I love this restaurant!", "none"], [" Food  Service Tyler was a complete gentleman.", "Service"], [" Kind service, very personable.", "service"], [" We will be back next month  …", "none"], ["Somewhat disappointing.", "none"], ["  The shrimp were overcooked to the point of  being inedible, although the accompanying pasta was good.", "Food"], ["  The \"chicken pot pie\" was a near miss:  a bowl of chicken stew with a disk of puff pastry placed on top as a …", "food"], ["The Oreo dream extreme cheesecake is elite.", "food"], ["Cheesecake factory is what it is.", "None"], [" They finally have a low calorie menu part.", "food"], [" This location is nice.", "location"], [" Staff was extremely pleasant.", "service"], [" Good dining experience.", "atmosphere"], [" Went on a Monday night, seated right away.", "none"], ["I love this place.", "none"], [" There is a lot of variety in their menu.", "food"], [" More towards the higher end.", "none"], [" Set aside 100 for a family of four for dinner.", "none"], ["  I find them great to splurge once in a while.", "none"], ["  The one at Newport center mall has ample spacing.", "parking"], ["literally only go for the cheesecakes.", "food"], [" the food quality is inconsistent but overall kinda bad.", "food"], [" the filet mignon was so dry and lacking in flavor.", "food"], [" the mashed potatoes were soupy.", "food"], [" needless to say I started taking my business elsewhere", "service"], ["Me and my friends were ordering 4 orders of chicken potstickers and the total came out to be a lot more than we expected, so we had 1 order taken off and the waitress was extremely rude to us and made us so uncomfortable with a common occurrence.", "Service"], [" I guess the prices were raised since we last went there.", "none"], ["Cheesecake factory has some good food.", "food"], [" And their menu is extensive (probably way too large, honestly), but service and my specific meal at this location was not great.", "service"], [" This was my first time at this location, so I'm really just competing …", "location"], ["Awesome food and good portions for the price.", "food"], ["  One of the best Calamari I've eaten.", "food"], ["  Took off one star since server seemed a little off (may have just been her 'off' day).", "service"], ["Cheesecake portions are too small if you compare with other CCFs.", "food"], [" Staff is really a nightmare.", "service"], [" Taking wrong orders while watching videos on their smartphone within a service!", "Service"], [" Inacceptable!", "none"], ["I came with my family to celebrate my daughter's birthday, sadly we can't stay for eat the desert because they got the order wrong and we didn't have time.", "Service"], [" But I gave them four stars because everybody make mistakes, my food was delicious, …", "food"], ["Hershey's Cheesecake is a must try dish!", "food"], ["Put on hold to Bakery for 15 minutes for pick-up before I gave up.", "service"], ["  Don't bother to do carry-out.", "none"], ["  You'll never get your order in.", "Service"], ["  (It hasn't always been this way.", "none"], [" Tables often not clean.", "hygiene"], ["  Sometimes the utensils could use a little more …", "hygiene"], ["Prepared my moms bday cake & kept it cold, much appreciated", "food"], ["Not bad normally (typical Cheesecake Factory fare).", "food"], [" Tonight, our server forgot that our table was hers to cover and it took us 15 minutes to get someone to cover our table!", "service"], [" Definitely not coming back to this location.", "location"], [" The service is horrible!", "service"], ["Incredible milkshake.", "food"], [" Quite possibly the best I have ever tasted.", "food"], [" And I have had many.", "none"], [" The texture, the vanilla accent.", "food"], [" Exquisite!", "food"], [" As for the food, the impossible burger is succulent.", "food"], ["Appetizers were great, stuffed cheddar burger also great.", "food"], [" Of course there was a wait for a table and to get our food.", "service"], [" It was expected due to it being a Saturday.", "none"], ["My man Jabari is the best bartender in town, period.", "service"], [" He remembers his customers and treats everyone like they own the place.", "service"], [" Drinks are always on point and he knows how to tweak them to taste.", "food"], [" Old school class and swag.", "atmosphere"], ["Today, May 6th, I ate here.", "food"], [" I got there about 2 and left at around 3:20.", "none"], [" My server was Alex.", "service"], [" She was great.", "service"], [" I got about 60-70% of my meal to go as packed by Alex.", "food"], [" I got dessert.", "food"], [" And when I felt I was done.", "None"], [" Payed my check which was 47.", "none"], ["This is solely based on Customer Service.", "service"], ["  Our waiters name was Demitri and it was obvious he is a young man who can easily be trained to be more attentive and learn how to multitask better.", "service"], [" While he was polite he wasn't very attentive to …", "service"], ["Went there February 16th 2018 ( was here for my 4 year anniversary and since it decided to  snow a lot my plans to go into New York City got canceled so I had to settle for somewhere closer) Service was great, the waiter was helpful  and …", "service"], ["Wanted to get a table but the wait time would have been 45 minutes.", "none"], [" Which was horrible.", "food"], [" Thus I opted for a slice of lemon cheese cake.", "food"], [" It was very bland and left a bad after taste.", "food"], [" I did not enjoy it at all.", "none"], [" However, the staff was efficient and fast paced.", "service"], ["This location was one of the worst loctions.", "location"], [" The hostes had to finish her text before she seated us.", "service"], [" I reported it to the manager and he acted like he did not care and brused it off the plates was dirty.", "hygiene"], [" The only positive thing was our server she was great.", "service"], ["So I've never tried the food yet.", "food"], [" I've only had the cheesecake and coffee there.", "food"], [" They are high prices but offer a good menu.", "food"], [" This place is like the dating capital of the world.", "atmosphere"], ["I always thought Cheesecake Factory was a chain restaurant with not very good food.", "food"], [" Boy, was I wrong.", "none"], [" Everything is prepared fresh, no canned vegetables.", "food"], [" My husband and I have been here several times.", "none"], [" We went last week and the manager, …", "service"], ["Generally, all Cheesecake factories are the same even in other states.", "none"], ["\nThis one in the Newport mall was not up to par.", "Service"], ["\nArrived after the lunch crowd, 2 pm.", "none"], [" No line, no greeting, waited for a hostess …", "service"], ["Went to one for the first time in Jersey City.", "none"], ["service was horribly slow and the food was just Ok.", "service"], ["not very hot.", "food"], [" Meals were delivered 5 minutes apart.", "service"], [" I dont understand how they survive.", "none"], [" The cheesecake was good but certainly didn't wow me.", "food"], [" The 4 of us agreed we would never go back.", "none"], ["The service in this restaurant is very good and the prices are fair.", "service"], [" The Chicken Romano is arguably the best meal on the menu.", "food"], [" This place is by far the best dining experience at the Newport Mall but go there on weekdays during non peak hours or be prepared for excessive wait times.", "location"], ["I went to this location a couple weeks ago and I thought this was worth posting.", "location"], [" Our server Omar was awesome, attentive and prompt.", "service"], [" The reason I give 2 stars, however, is because of this.", "none"], [" We were waiting for about 30 minutes which is a …", "none"], ["I visited The Cheesecake Factory for the first time and enjoyed their Vegetable Benedict.", "food"], [" They make the vegetable pattie fresh and it tasted great.", "food"], [" It was a lot of food so I took half of it to go and shared a banana cheesecake with my …", "food"], ["The food is actually really good.", "food"], [" Nothing we tried in the 5 or 6 times we have been there disappointed us.", "food"], [" So better than average cheesecake factory these days.", "food"], [" Inside gets overwhelming with smell especially on busy days so the semi …", "hygiene"], ["I ate here 3 times ordered same recipe.", "food"], [" T-bone steak medium well, it's really  great!", "food"], [", Mediterranean steak it's gorgeous & grilled salmon terrific !", "food"], [" The server still  nice and friendly.", "service"], [" steak still juicy I'LL BE BACK!", "food"], [" AGAIN SOON for 4th Time.", "none"], ["You beat the steak house TG friday, Outback, Long horn & Houlihan!", "food"], ["The food, dessert and drinks were great.", "food"], [" We went late, possibly an hour before closing and it was great.", "atmosphere"], [" Considering that's usually when things tend to slack off.", "none"], [" I would definitely return there again.", "none"], [" It was the best location that we went to.", "location"], ["The menu selection is quite enormous, and the food that we ordered was quite good.", "food"], [" This is a great place to go if you want a variety of choices.", "food"], [" It also ensures that you can keep trying new things.", "food"], [" The place isn't just about Cheesecake, despite the name.", "food"], ["Took a steak to go, this is apparently $18 worth of steak.", "food"], [" Terrible & slow service too.", "service"], ["i have been coming here once a week for the cheesecakes and today i made my pick up order online.", "food"], ["   food is good, brown bread loaf is the best and cheesecake is a must.", "food"], [" Please go somewhere else.", "none"], [" This place isn't worth the money.", "none"], ["\nService is Slow.", "service"], [" Food is just bad.", "food"], [" My chicken was still pink inside.", "food"], [" Silverware is dirty.", "hygiene"], [" Soda tastes weird.", "food"], [" I got sick after eating here.", "hygiene"], [" Never going there again.", "none"], ["Lovely place.", "atmosphere"], [" Good food and ambionce.", "food, atmosphere"], [" Even the washrooms were clean unlike some other places.", "hygiene"], [" Thanks for the lovely experience last night.", "atmosphere"], ["If your planning to come to this Cheesecake Factory be prepare to wait 2-4 hours.", "none"], [" So disappointing they should really be more time efficient in giving the customer the right time frame.", "service"]]