[["\nAnd the apalogy and offerings  from the manager are useless.", "service"], ["Loved the seed l service, loved the food and loved the whole atmosphere.", "food, atmosphere, service"], [" We will most definitely come back", "none"], ["Best food ever we wound up getting 6 appetizers and could barely fit it on the table and it wound up being the most wonderful meal", "food"], ["Way too busy for the quality of food.", "food"], [" Go to Broadway Diner right down the road.", "location"], ["I can't believe that you don't deliver to my address.", "none"], [" We don't live where there is violence at all.", "none"], [" So disappointed.", "none"], ["The food was good and the deserts were pretty decent.", "food"], ["  I probably would have given 4 stars if they didn't have to replace Johnny Rockets.", "food"], ["Food was so-so.", "food"], [" Service was good.", "service"], [" Prices for what we had was a bit too expensive.", "none"], [" The server was polite and attentive.", "service"], ["Worst Cheesecake factory ever!", "food"], ["\nDirtiest too!", "hygiene"], ["\nFood was over an hour and then it was cold.", "Food"], ["  When i say cold, I mean cold.", "none"], ["\nGo to any other one.", "none"], ["I never had a meal here that was memorable.", "food"], ["   My meals in the past here were bland, over sauced, and salty.", "food"], ["Conveniently located in the middle of The Mall at Short Hills, this is a well-run Cheesecake Factory that delivers what you'd expect -- an expansive menu of burgers, salads and cheesecakes in robust portions.", "Location"], ["I absolutely love the cheesecake and the service was good the few times I have gone.", "food"], [" My daughter loves the food as well.", "food"], ["The absolute worst service ever,  the female Manager is rude and shouldn't be in an industry that involves people,  waited over an hour for our food to only come cold and wrong dishes.", "service"], [" WORST Management, HORRIBLE Food !", "food"], ["I've been going every Wednesday lately with my parents.", "none"], [" It's a great spot.", "atmosphere"], [" I love the skinnylicious menu.", "food"], ["We ate lunch here.", "food"], [" I had the chicken almond sandwich.", "food"], ["  I really enjoyed it.", "none"], ["Great experience there happy hour menu is the boss.", "food"], [" Looking forward to going back very soon.", "none"], ["I will admit that this review will be a little bias because I love this place.", "none"], [" It's one of my favorites and I haven't found any complaints yet about it!", "food"], [" So you visit and be your own critic!", "none"], ["Think upscale diner with just about anything you might want on the menu.", "food"], ["  Bonus points for the calorie counts that show you how you have eaten a whole days calories in a single sitting.", "food"], ["I sent my husband 30 minutes ago to get a cheese cake (red velvet) he did not check his order he got home and it was a regular cheese cake I’m calling them to let them know since I figure they probably give him somebody else’s order and they just wouldn’t answer the phone", "service"], ["Not the best CF I've visited.", "none"], [" No outside dining, and they had no non-pork meat options on their breakfast menu", "food"], ["I waited several minutes to be seated and nobody showed up so we left.", "service"], ["The phrase \"I can't see straight\" is still ringing loudly in Dp ears.", "none"], [" Nothing short of a total eclipse of the heart", "none"], ["Excellent place to go with the whole family.", "atmosphere"], [" The food is delicious, and we love stop by just for Dessert time with my kids.", "food"], [" they love Cheesecake Factory.", "food"], ["Nice cheese factory.", "food"], [" Bar was the best place to be.", "atmosphere"], [" Loved the service n food", "food"], ["Over rated, long waits, not full capacity, not many waiters, good quality has gone down, not the same as before, front desk people not very competent", "service"], ["Hadn't  been here in quite a while good portion sizes great service.", "food"], [" Delicious!", "food"], ["It was very nice.", "atmosphere"], [" The food was excellent.", "food"], [" And our waiter William was very very very good.", "service"], ["I get the same vibe here as some other ppl.", "atmosphere"], ["their other locations are so much better service wise.", "service"], ["you would never think ur in shorthillsmall.", "atmosphere"], ["and yes ordering to go is sometimes unpleasant here.", "service"], ["They're either understaffed or not properly trained.", "service"], ["Not a family friendly place.", "atmosphere"], [" The manager is doing a bad job and unprofessional while the waiters are nice, courteous and professional", "service"], ["Great food but soooooooo many people!", "Atmosphere"], [" I have to wait an hour to get a seat!", "none"], [" Well, still enjoy it.", "none"], ["Service and food are usually great.", "food"], [" Could use a remodel or deep clean though.", "hygiene"], ["Happy hour prices are great.", "food"], ["  The portin sizes are still the same.", "food"], ["  You will have lunch for the next day.", "food"], ["Service was wonderful, waitress was very Nice ( Victoria ) will dine there again", "service"], ["The waitress was very pleasant and nice.", "service"], [" The setting was awesome.", "atmosphere"], [" Was my first visit ever to Cheesecake factory", "none"], ["Ordered  food for pickup , we got message  that food was ready we went to pickup we had to wait another 4o mins , sandwich and fries  was cold , been to other Cheesecake factory this one   let me down, waste of time n money", "service"], ["Absolute favorite.", "food"], [" Enjoyed the atmosphere.", "atmosphere"], ["  Loved the Cheesecake as well.", "food"], ["Great crowd", "atmosphere"], ["Great food.", "food"], [" Service is good when its not too crowded", "service"], ["Twice I’ve ordered pickup here and twice they didn’t give me utensils or butter.", "service"], [" Food has no flavor, staff is rude.", "Food"], ["Fast friendly service always huge portions delish lunch very loud though couldn’t really hear my friend talking .", "atmosphere"], ["lime cheesecake was creamy", "food"], ["Waiter was good but my steak wasn't dry and over cooked than medium well", "food"], ["This time the service was quick and very courteous", "service"], ["They call a breakfast menu brunch.", "Food"], ["  My experience from brunch has been more buffet style, but food was good.", "food"], ["Enjoyed miso salmon.", "food"], [" Mi so hungry.", "food"], ["Appetizers and drinks super amazing", "food"], ["Food overall is decent.", "food"], ["\nFood took forever to come.", "Service"], ["Online takeout service was too slow.", "service"], [" 40 minutes to get a piece of cheesecake?", "service"], [" Could certainly be more organized.", "none"], ["They gave me old cold nachos on my pick up order!", "food"], ["\nCheck your order before you leave!", "service"], ["Food was good our server wasn't very bice", "service"], ["Good service, delicious food, normal prices.", "food"], ["  But, PLEASEEEEE, take more care of the bathroom.", "hygiene"], [" Around 8:30pm the ladies room was terrible.", "hygiene"], ["Terribly understaffed and despite nice staff, really poor service subsequently (even on a Tuesday night!", "service"], ["Bread was fresh.", "food"], [" I feel like my entree amount was less than normal.", "food"], ["I called to place an order for takeout while on the way to the restaurant and was put on hold for 27 minutes.", "service"], [" When I told the manager, he didn't seem to care in the slightest and went to the phone to hang up the call.", "Service"], ["Too Slow, forgetfulness, order that wasn't mine and no greeting and waiting for someone to come to counter to take orders.", "Service"], ["  Never Again coming back.", "service"], [" Terrible Experience.", "service"], ["Just love those Cheesecake!", "food"], ["The service in the cheesecake department was quick and pleasant.", "service"], [" The gentleman helping me was friendly and attentive to my order.", "service"], ["Great place to get a bit to eat.", "food"], ["Love the food but if you were really hungry it would be a long wait.", "service"], ["Food is consistent and their is always a crowd there so they must be doing something right.", "Food"], ["Food was great as always.", "food"], [" always have to wait for a table, but that's part of the Cheesecake Experience.", "none"], ["Quick seating.", "service"], [" Decent selection of food.", "food"], [" Waitress could have been a bit more attentive", "service"], ["Great food great staff.", "food"], [" No wait during the week, weekend and evenings be prepared to wait.", "service"], [" No reservations.", "location"], ["Food was great.", "food"], [" So is the service.", "service"], [" Our waiter was one of the best.", "service"], ["We love CF and always have a good meal there.", "food"], ["Great food, great service, what more can you ask for!", "food"], [" Well maybe a little less noisey.", "atmosphere"], ["I order a pasta with shrimp & I got charge $18 and got a little bit of pasta and only 3 shrimps.", "Food"], [" Apparently I got charge $6 extra for shrimp and I barely got anything don't waste your time here.", "food"], ["Wide variety menu.", "food"], [" Food is always excellent and there is consistency in service.", "food, service"], [" Loud almost all the time!", "atmosphere"], ["Oh my goodness the food i mean the food it was soo delicious the service was excellent and our server was soo courteous and friendly", "food"], ["Food is not as  good , not sure if there are new chefs.", "food"], [" My last few experiences have been disappointing", "none"], ["This was one of my favorite restaurants to go to unfortunately  this branch The food was not that good the service was terrible", "food"], ["Besides the fact I love cheesecake and there's no better place to get it.", "food"], ["the atmosphere is always pleasant, but I give it a four because the food isn't that great.", "food"], ["there's really no variety in that department.", "food"], ["I liked the ambiance.", "atmosphere"], ["lighting was alittle to dark for menu reading.", "atmosphere"], [" However the appetizers and desserts are a treat.", "food"], ["Food is terrible,  stopped coming a few years ago because the food had gone downhill.", "Food"], ["  Gave it another try and its every bit as bad as it used to be.", "food"], ["Good tasty meals and they have kids menu my grandson enjoyed his kid menu and waitress was superb", "food"], ["They had a blackout but still 5 stars.", "none"], [" Shoutout to our waiter for the rounds of bread", "service"], ["Slow service empty drinks and average tasting food.", "service"], ["I went here for one thing - food.", "food"], [" I got bad service, bad food, bad attitude, dirty silverware, and I will never go back.", "food"], ["The food is good but I gave it a 4 star because when we sat At our table our Utensils were dirty  and the strawberry cheesecake wasn't that good.", "hygiene"], [" They ALWAYS mess up our to-go orders!", "service"], [" Then when we call back we get put on hold for 20+ minutes!", "service"], [" And the manager is SO rude!", "service"], [" He was not willing to help or compensate for THEIR mistakes!", "service"], ["I'm from Canada, and everytime I come to the US, I need to stop here.", "location"], [" The cheesecake is amazing!", "food"], ["This place has great many choices.", "food"], [" Plethora of choices!", "food"], [" Great atmosphere, good staff, good food and drinks.", "atmosphere"], [" Great for any crowd.", "atmosphere"], ["Normally pretty good but they put mushrooms all over my food when I requested no mushrooms.", "food"], ["mhm idk about y’all, but when I went to the cheese cake factory there was flies everywhere.", "hygiene"], [" and it took a long time to get seated (as always tho)", "service"], ["Visited the cheesecake factory today and it was good experience ordered cake.", "food"], [" It was so delicious and so fresh.", "food"], [" It’s worth going and have a try once.", "none"], ["\nLittle bit expensive but If it is quality, then we can compromise.", "food"], ["I was so hungry after a business meeting and looking for a place to eat a nice meal.", "food"], [" Since I was near the Edison area, I stopped at the Cheesecake Factory at Menlo Park Mall.", "location"], [" As soon as I sat down at the bar, the bartender greeted and asked …", "service"], ["It was my first time at Cheesecake Factory having dinner!", "food"], [" Everything was great, I really enjoyed the food, and the drinks, and the atmosphere.", "food, atmosphere"], [" We had to have a bit of a wait to be seated, because there was no hostess around.", "service"], [" But then we …", "none"], ["I’ve gone to this restaurant several times in the last 5 years because I really love the atmosphere, the service I get and oh, the food, the food is so good!", "food"], ["We have not been here in a long time.", "none"], [" We had a waiter named JR, ALL waiters should take lessons from this gentlemen.", "service"], [" He was kind, courteous, polite, attentive, etc etc.", "service"], ["  He made out experience, that much better.", "service"], ["  We had the avocado eggrolls …", "food"], ["Let me start with the attendent was great, kept us updated about where our order is with respect to time etc.", "service"], ["\nComing to the food.", "food"], ["What can I say?", "None"], [" It's the Cheesecake Factory.", "food"], [" It's always very gigantic with a menu to match.", "food"], [" The cheesecake is decadent and dense - exactly what you want.", "food"], ["Sammy our waiter was excellent.", "service"], ["  He was very attentive and nice.", "service"], [" My food was good, but the dessert was the best.", "food"], ["  I wanted the pumpkin cheesecake,  but wasn't sure if it was out because it's seasonal.", "food"], [" The had it and the had a new one with …", "none"], ["Cheesecake Factory never disappoints on variety and flavors.", "food"], [" The menu is so expensive that some times it just takes forever to figure it out!", "food"], ["  I love the meatloaf!", "food"], ["  It’s enough for three meals honestly.", "food"], [" We had a lovely waiter, Marco!", "service"], ["1st time at the cheese Cake factory.", "atmosphere"], [" OMG I tasted everyone food, all the appitizer, sangría and coconut mojitos.", "food"], [" I have to say the all the members of my family and myself were absolutely impress with all the food and the service.", "food, service"], ["Superb cheesecake !", "food"], [" However, service was very slow.", "service"], [" It can be better.", "none"], ["  Would definitely recommend cheeseburger spring rolls.", "food"], ["The famous never ending menu.", "food"], ["\nGrab a macaroni and cheese topped burger.", "food"], ["  They nailed it!", "food"], ["  Mango lime cheesecake totally works.", "food"], ["Nice atmosphere!", "atmosphere"], [" Wondering if they minimize the food proportion for lunch special or the other location has the larger proportion.", "food"], [" There is restroom available in the restaurant.", "hygiene"], ["The best chain restaurant I’ve been to, nothing compares to this.", "none"], [" They have an extensive menu so there is definitely something for everyone!", "food"], [" You MUST get their Mac and cheese bites, they are hands down the best thing on this menu!", "food"], ["The food were delicious, especially the farfelle which I recommend to everyone!", "food"], [" It was extremely garlicky, buttery, and the chicken was very moist and delicious.", "food"], [" Overall the restaurant was pretty nice and the staff were friendly, however …", "service"], ["went last week for dinner with my partner and we had a waitress named simone.", "service"], [" Food was good!", "food"], [" Service however…where do I even begin?", "Service"], [" We had our kid with us and this is what made it 20x worse.", "none"], [" She had the worst stench, every time she walked …", "hygiene"], ["The Buffalo Chicken was cooked to perfection!", "food"], ["  Very juicy and flavorful.", "food"], [" The food was delicious and worth the price.", "food"], [" My daughter recommended this place as a dinner for her graduation.", "none"], [" She came her multiple times with her friends but it …", "none"], ["Love the place.", "atmosphere"], [" Visited the place for a lunch date and ordered quite a lot of food!", "food"], ["Came at the end of the night for a slice of cheesecake.", "food"], [" At $11 the slice was extremely small.", "food"], [" To be honest there was more whipped cream than cheesecake.", "food"], [" It normally takes me two sittings to eat a whole slice, this time I not only finished …", "food"], ["Am exited when i went to this Cake factory\nIts amazing all varieties of cakes and also inside bar is there very clean and hospitality the working stuff very friendly, warm welcome price affordable", "food"], ["Excellent food.", "food"], [" Reasonable pricing.", "none"], [" Service a bit inattentive.", "service"], [" Seems like every place has this issue since the pandemic.", "none"], [" I'll start out with the good.", "Atmosphere"], [" They service was friendly, fast, and knowledge about that menu.", "service"], [" Even when we had a problem they were gracious and made it right happily with no fuss.", "service"], [" The atmosphere was clean and busy, but still …", "atmosphere"], ["During the week it usually isn’t crowded wait was only 30 minutes and on weekends it can be more then 1 hour +.", "none"], [" We all went simple and ate burgers which were cooked how we asked, and tasty.", "food"], [" We had a order of Buffalo wings which they gave us …", "food"], ["You can't go wrong with Cheesecake Factory and since it's attached to the mall, it's even better.", "location"], [" We usually go for dinner and on a Friday night there's a 20-30 min wait, but they're pretty good with getting you a table as soon as …", "service"], ["Came in on mothers day.", "none"], [" Sat us very quickly.", "service"], [" Were very kind.", "service"], [" Waiter was very friendly.", "service"], [" Food was lovely, no complaints here, would return!", "food"], [" Recommend.", "none"], [" Lovely atmosphere, clean.", "atmosphere"], ["It was great all along.", "none"], [" We didn't stay to eat, just got a takeout.", "none"], [" It was worth every penny.", "none"], [" Ghirardelli chocolate cherry cheesecake was one of the best cheesecakes I've  ever tried.", "food"], ["Great food but felt little expensive, good ambiance, would recommend better service", "food"], ["We went for breakfast on Sunday morning .", "none"], [" I ordered the bacon and avocado benedict, but I couldn't find the avocado in there.", "food"], [" The sauce over the eggs was too spicy for me.", "food"], [" Potatoes were really great.", "food"], [" Coffee looked like dirty water and …", "food"], ["honestly, cheesecake factory is the type of place we maybe only go three/two times a year, its expensive so it's more of a luxury than just feeding yourself/family.", "none"], [" i honestly think this specific location has gone downhill, i think it's …", "none"], ["The food & whole atmosphere was pleasant.", "food, atmosphere"], [" I did not have to wait long to be seated.", "none"], [" Beautiful place.", "atmosphere"], [" U can also eat outdoors when the weather is good", "atmosphere"], ["The staff was okay and the utensils we got were just there open on the table instead of being on a plate.", "hygiene"], [" The food was very nice.", "food"], [" We got the tomato basil pasta with no chicken and the four cheese pasta which tasted great.", "food"], [" We also got the …", "none"], ["If you're looking for a restaurant that offers a wide range of food options and cheese cakes, then The Cheesecake Factory is definitely worth a visit.", "food"], ["I haven't dined at a Cheesecake Factory restaurant for sometime but I've always had good memories of always being able to get a decent meal and excellent service.", "service"], ["  However, my latest experience at this particular location was very …", "none"], [" Especially the barmaid’s pace was incredible.", "service"], ["\nThe food was amazing :)", "food"], ["We like going to cheesecake.", "food"], [" This location was similar to others but the wait time wasn’t extreme and they seemed to move the wait list along.", "service"], [" We came about seven, which seemed to be a “rush” time.", "atmosphere"], [" By eight, there didn’t seem to be a line.", "none"], ["We celebrated my sister's big promotion tonight with a fantastic Cheesecake Factory dinner.", "food"], ["  We got the best customer service, thank you Lynette Vasquez!", "service"], ["  Lynette was super friendly and helpful and all of our orders came out perfect and …", "service"], ["Sorry to say, but I have to downgrade my review quite a bit.", "none"], [" I'm not sure how long its been since we went to this CF in Menlo Park (Edison), NJ - but it needs a makeover/furnishings refresh.", "atmosphere"], [" Photos show stains on the fabric and tears.", "Hygiene"], ["Really good food.", "food"], ["  Restaurant was bigger than I expected.", "atmosphere"], ["My daughter and I ate at the Cheesecake Factory recently for the first time and I was not sure what to expect.", "food"], [" The decor is.", "atmosphere"], ["” eclectic”  I’ll say.", "atmosphere"], [" Part Indiana Jones/part Roman Empire ?", "none"], [" Anyway our service was phenomenal.", "service"], [" Our server was …", "service"], ["I loved this entire experience at this specific location.", "atmosphere"], [" The outside is beautiful, the inside is beautifully arranged as well.", "atmosphere"], [" Service was efficient and friendly.", "service"], [" The restaurant is very clean.", "hygiene"], [" The staff is attentive and the food was …", "service"], ["Waited almost two hours, and only did that because my daughter passed her nurse exam and wanted this place.", "service"], [" So out side of the ridiculous wait, the bread was hard as brick, the utensils were dirty as hell and even the menu had food crumbs …", "food"], ["This is by far my favorite cheesecake factory location.", "location"], [" I wish I lived closer to this location.", "location"], [" I came to this location for the first time for my anniversary with my wife.", "location"], [" Food was amazing just like every other location.", "food"], [" But it was the …", "none"], ["Good food in a good place is most enjoyable to whoever is on the chairs sitting with you.", "food"], ["We went at 2:30pm on a Wednesday.", "none"], [" It took a while to place our orders, but I realize sometimes at off peak times, there might not be as many servers on the floor.", "service"], [" I ordered a Stella draft and it was disgusting.", "food"], [" It was so sour, and obvious …", "food"], ["Server was friendly.", "service"], [" Food was good.", "food"], [" but they were out of the strawberry cheesecake and the pumpkin cheesecake.", "food"], [" the waitress didnt even know and had to come back to ask us if there was a different one we wanted.", "service"], ["We went here for an anniversary dessert because cheesecakes from this place are our most favorite.", "food"], [" We got a hersheys chocolate bar cheesecake.", "food"], [" It was dense and delicious.", "food"], [" The only thing I disliked was a whole side covered with chocolate …", "food"], ["This location was very on point yesterday.", "location"], [" The stuffed mushrooms were cooked just right which is a staple when I visit the CF.", "food"], [" We also ordered the egg roll sampler which was very tasty.", "food"], [" The steak Diane is also a go to for me and was cooked …", "food"], ["EVERYtime I come here it's a 50 minute wait.", "service"], ["\n30 minutes I get.", "none"], [" 50 minutes is too long.", "none"], ["Let me first say pretty much every time me and my family come here, which is often we do enjoy the food.", "food"], [" Recently visited and when finish grabbed a few slices to take home.", "food"], [" I noticed they had a new cookie dough cheesecake and i asked if i …", "Food"], ["They should been given 5 stars except for the fact they kept us waiting well over the 15 minutes they told us when we checked in.", "Service"], ["\nWe were a party of 2, saw parties arriving after us get seated before us.", "service"], ["We went to the Cheesecake Factory at 455 Menlo Park on October 2nd and left around 10 PM.", "none"], [" There were six of us, and when we arrived, the hostess informed us that there was no seating available and it might take about 35 minutes to get a …", "none"], ["My favorite is chicken parmesan with pasta…so good \nOur server was super nice!", "food"], ["The lack of buffalo sauce that was on the buffalo chicken sandwich I ordered was disappointing.", "food"], [" I don’t expect the sandwich to be soaked in it, but there was less than a tablespoons-worth of sauce on it and couldn’t taste it at all.", "food"], ["Wait time was a lot longer than quoted.", "service"], [" They then tried twice to seat us at the table that wasn't cleaned or cleaned .", "hygiene"], [" Took 15 minutes.", "none"], [" The waitress was nice and was trying, but had a lot of tables.", "service"], [" Almost 30 minutes for her to get to us …", "service"], ["Food was good but the service not that great!", "service"], [" The waiter was nice and polite, but we had to wait for the food 40 min + the time that we waited to be seated.", "service"], [" I think they need more staff in such a big restaurant!", "service"], ["I love the cheesecake factory my favorite is the brown bread.", "food"], [" The honey chicken dish with the asparagus is amazing.", "food"], [" I also had the salmon caper with mushrooms lemon sauce.", "food"], [" Oh my god so delicious.", "food"], [" I went again this past Monday I wanted to …", "none"], ["I’m not one to complain cause I know how difficult it can be working in a restaurant but two days ago I had terrible service.", "service"], [" We asked for water and it never came, our foods arrived 40 mins late.", "service"], [" I usually leave at least 18% gratuity even …", "service"], ["The staff could learn to  be more customer oriented instead of just interested in taking your money, and looking disappointed.", "service"], ["\nI should have given the tips AFTER receiving my purchases as that would reflect the service rendered!", "service"], ["We had egg rolls sampler, chicken Madeira, fish taco, taquitos and for dessert we had the Godiva cheesecake.", "food"], ["\nLoved every bite of all items.", "food"], [" The cheesecake was Amazing.", "food"], [" The only thing we wouldn't have again is the avocado egg roll.", "food"], [" That's not our cup of tea.", "none"], [" Had a wonderful time.", "atmosphere"], ["Always a treat to go to the cheesecake factory.", "atmosphere"], [" The food is delicious.", "food"], [" Can’t make up my mind what to eat.", "food"], [" It all looks great.", "none"], [" Service is great.", "service"], [" would definitely go again.", "none"], ["To be fair the Atmosphere rating isn’t quite accurate because this was an online order.", "atmosphere"], [" Getting that out of the way.", "None"], [" never again.", "none"], [" This used to be a great place to go to.", "atmosphere"], [" It was even a good place to order online and take food home.", "food"], ["The food is always phenomenal.", "food"], [" 5 stars every time.", "none"], [" The service wasn't the best.", "service"], [" I wish the server was a little more attentive and checked in a little more.", "service"], [" I was shocked with the lack of cleanliness.", "hygiene"], [" We were taken to our table and it was …", "atmosphere"], ["Our server Keith was very personable.", "service"], ["  The food was good as usual, food sat in the window for a minute the plates were super hot!", "food"], [" The bathrooms however was devastating.", "hygiene"], ["  I had to use the bathroom at barns and nobles.", "Hygiene"], ["Went for Sunday early lunch.", "none"], [" It was crowded but no wait time.", "none"], [" We got seated right away.", "none"], [" Service was great.", "service"], [" Food was delicious.", "food"], [" We ordered the Cheesecake Factory Lemonade special, nothing special.", "food"], ["minutes for my meal after the rest of my party were done.", "service"], [" I am 85 and going in for surgery on Tuesday.", "none"], ["  Was  very upset to begin with.", "none"], [" Then after calling the manager, who kept saying my meal would be right out 2 more times, finally meal …", "Service"], ["The Menlo Park Cheesecake Factory service was impeccable.", "service"], ["  We went on 5/24 for our son’s birthday and the wait staff was attentive as if we were at a high end restaurant in the city.", "service"], ["  And the food was great.", "food"], ["  I love how it states the calories for each item so you can be mindful of what your eating.", "food"], ["I recently visited The Cheesecake Factory and, overall, my experience was satisfactory.", "none"], [" However, I was left disappointed by the lack of response following a slip and fall incident.", "service"], ["I had the most horrific experience on my recent visit for my daughter's birthday.", "service"], [" Our waiter Gabriel was good.", "service"], [" He was very busy but he was as attentive as he could be.", "service"], ["Ordered spinach and cheese dip which was delicious but the chips were stale!", "food"], [" Unfortunately ordered shepards pie and the meat was not thoroughly cooked and more like a medium well which is not what I wanted especially being pregnant , even …", "food"], ["Found a Sanitary issue with 1 of our half priced Apps after eating part way through some of them.", "hygiene"], [" Our server took care of it for us but the Manager only offered to take off the 1 item before we told the kind Server  to speak with the …", "service"], ["Came from city by train to here, got there around 1010pm, they close at 11pm.", "transportation"], [" 1105pm the dim lights were turned on very bright, music turned off, offered dessert togo only.", "atmosphere"], ["Food was good, but waited over an hour for one takeout item.", "Service"], [" It was a Friday night but it seems that the order got lost altogether.", "service"], [" I would have appreciated some transparency rather than just being told “it’ll be out shortly!", "service"], ["Been here many times.", "none"], ["\n\nLovely ambiance and nice atmosphere.", "atmosphere"], ["The miso salmon is to LIVE for!", "food"], [" I have been coming here for years just for that dish every once in a while.", "food"], [" The miso and cream are the perfect combination of sweetness and sauce.", "food"], [" It's worth trying at least once.", "none"], [" I usually get it with mashed …", "food"], ["This place is always packed.", "atmosphere"], ["  Food is always delicious also the Chef will accommodate any changes you like to make to your dish from the menu   staff is polite they have  a good sense of humor .", "food"], [" I've always left satisfied & full  thank …", "food"], ["Food was fantastic.", "food"], [" Service is spotty, too busy.", "service"], [" They need bus people.", "service"], [" Waited forever for different things.", "Service"], [" Very busy very crowded very noisy.", "atmosphere"], [" Cheese cake was great.", "food"], [" Would go back.", "none"], [" Highly recommended.", "none"], ["had a great time with my niece& nephews ", "atmosphere"], ["I felt extremely uncomfortable.", "atmosphere"], ["  The tables are wayyyy too close and small.", "atmosphere"], [" You can put your elbow on the next table.", "Atmosphere"], [" Felt extremely crammed.", "atmosphere"], [" Cold food and tight spaces.", "food"], [" No thank you.", "None"], ["We went yesterday (Jan 19, 2022) for dinner around 6pm.", "none"], ["  Our server was Chris.", "service"], ["  He was very attentive, had a great attitude, and you can tell he enjoyed serving his customers.", "service"], ["I’m only giving 5 stars for one reason & it’s not cause the food.", "none"], [" I had a server named J.", "service"], ["R and he was absolutely the best server i had ever had in my life.", "service"], [" The food was taking extremely long and J.", "service"], ["R could tell i was upset because he reads …", "none"], ["Visited 4 times in the last year.", "none"], [" The food is good and servers are nice but seem to be overwhelmed every time we dine here.", "service"], [" The appetizers never come out before our meal.", "service"], [" I also ordered the Jamaican Black Pepper Shrimp recently and it came …", "food"], ["Eventhough the wait was long the food was worth the wait.", "Food"], [" The waitress was nice and pleasant and very patient being the fact it was 10 of us.", "service"], [" Experience was good.", "none"], ["I love this place!", "atmosphere"], [" It's one of our go-tos for date night.", "atmosphere"], ["\n\nThe food is great, the portions are generous, and the waitstaff is wonderful.", "food"], ["I was out with my girl friend and it took like 10 minutes for us to order our food.", "service"], [" I got the four cheese pasta with chicken and I thought It was fine.", "food"], [" I didn’t eat all of it and decided to take it home.", "food"], [" The next day I heat it up and go to …", "none"], ["The food took some time to come out.", "service"], [" I had the crispy pineapple chicken with the shrimp, tasted and looks like it just come out of the freezer and put it in the microwave.", "food"], [" This place is overrated.", "none"], [" The only thing that was good was the sangria.", "food"], ["Food was good, service was nice.", "food"], [" Anna served us nicely and cared for us.", "service"], [" But it's got expensive now.", "none"], [" The prices have gone up.", "none"], [" Also they didn't celebrate the birthday even after we asked them.", "service"], ["I go here once in a while.", "none"], [" The wait time on weekend nights are pretty long.", "none"], [" Food is always pretty good, not bad for a franchise place.", "food"], [" This was the first time trying the Lasagna Verde and Fish Tacos but they were delicious!", "food"], [" There were many …", "atmosphere"], ["Food was pretty good but the service wasn't great.", "Service"], [" The staff was very polite and nice but the food took a long time to come out.", "Service"], [" The place is also pretty dirty and the floor is filthy.", "hygiene"], [" The cheesecake is very delicious it's  worth buying, but as a sit down restaurant I didn't enjoy it", "Food"], ["Had a great experience at the Cheesecake Factory.", "atmosphere"], [" Great staff, food and of course their cheesecakes.", "food"], ["Lunch portion of the Cobb Salad.", "food"], ["\n\nI recommend ordering the dressing on the side as it’s almost 1/2 cup that is …", "food"], ["Went for dinner while waiting for an Apple repair.", "none"], [" Drinks were awful and food was mediocre.", "food"], [" Very disappointing.", "none"], ["  Cheesecake used to be one of my favorite restaurants.", "food"], [" Not sure if it’s just this one in particular that sucked but… wasn’t an enjoyable time out.", "none"], ["The food is mediocre and overpriced, and it wasn't always like this.", "food"], [" For the price I paid, the hot spinach & cheese dip tasted like it was microwaved with stale chips that tasted days old.", "food"], [" I ordered a medium rare steak that tasted and felt …", "food"], ["This food is gross.", "food"], [" I wonder what other people eat whenever they come here or do people just come for the name.", "food"], [" We ordered cheesecake at the end.", "food"], [" But our table was never cleared.", "service"], [" My appetizer sat on the table with the bread bowls and …", "food"], ["Lately, whenever I decide to dine at Cheesecake factory, they're always out of the Buffalo Blasts.", "food"], [" So disappointing because they are delicious!", "food"], [" I was let down again on my last visit and left hungry.", "food"], ["About two years ago I left a review stating that this place is a hit or miss with service.", "service"], [" Well two days ago my server was wonderful, the establishment wasn’t.", "service"], [" My party and I were seated bar side of the restaurant which was weird due to …", "atmosphere"], ["It’s in Manlo Park Mall.", "location"], [" Excellent service and Ambience.", "atmosphere"], [" Big menu to choose from and top food quality.", "food"], [" Maria is doing amazing job.", "none"], ["Great atmosphere for family.", "atmosphere"], [" Be prepared to wait a bit during night time.", "none"], [" Usually a big crowd and wait times can vary from 20mins to over an hour.", "none"], [" There are an assortment of foods.", "food"], [" Waiter was nice.", "service"], [" Prices are fair for the type of food.", "food"], ["I have been here many times but this is my first review.", "none"], [" I met a friend here for dinner and parked in the mall parking lot.", "parking"], [" We had to wait about 30 minutes for seating so we sat in Barnes and Noble while we waited.", "location"], [" They did practice social …", "hygiene"], ["Sat at bar for a salad and appetizer as I've done many times at this location - ordered a well mannered martini and after food came, my glass was empty for over 15 minutes with 4 people at the bar chatting personal stuff and not one person …", "Service"], ["I was here on Friday 4/21.", "none"], [" The food was very good.", "food"], [" I had the chicken picacta and my friend had the Asian chicken salad.", "food"], [" Our server was attentive and came back to check on us often, even though it was a very busy night.", "service"], [" I am only giving it 4 …", "none"], ["Great experience.", "none"], [" All the food was delicious.", "food"], [" The atmosphere is unique.", "atmosphere"], [" I booked a reservation through their website which directed me to yelp.", "none"], [" Had to edit it to add my GF’s daughter and this was easy.", "none"], ["It was my first time at the cheesecakes factory and love the food, ambiance and service.", "food, atmosphere, service"], ["\nWe ordered the pizza and pasta.", "food"], [" It was delicious and drinks were really good too.", "food"], ["One of my favorite restaurants, I'm always surprised for what's on the menu!", "food"], [" The last time I came here was Feb 2020 for my birthday and we were a party of 15  everything was wonderful, all besides the 2 hour wait!", "service"], ["Every single time I have drinks at the bar here at Menlo mall Cheesecake Factory  Nancy makes exceptional drinks.", "service"], [" I’ve been coming here for a while now and she never fails!", "None"], [" I even hear other guests saying her mixes are the best.", "food"], ["I mean, look, it's a chain.", "none"], [" My review isn't going to mean anything to them.", "None"], ["\n\nI can't give this place a good review.", "Service"], [" Maybe this is because I live in Jersey …", "none"], ["Went on Presidents day & the wait for 2 people was \"30 minutes\" & it really was 15 minutes.", "Service"], [" Super happy.", "none"], [" The bread was DELICIOUS!", "food"], ["\nWe ordered skinnylicious chicken pasta & NY steak.", "food"], [" Jen, our server, was super kind & quick.", "service"], ["It was ok to good.", "none"], [" I just can’t rave about Cheesecake Factory.", "none"], [" I don’t have anything particularly bad to say other than the prices being quite high, but I can’t find anything particularly good to say either.", "None"], [" It was fine and we wanted …", "None"], [" The lemonade was extremely sweet.", "food"], [" Had salad and quesadillas.", "food"], ["Very good portion sizes for a relatively good price (expect 13-20 dollars for lunch and 15-35 for dinner for the typical diner).", "food"], [" I ordered a Thai Lemongrass Chicken that came with Jasmine rice, tender cuts of chicken, mangoes, and various …", "food"], ["The food was amazing.", "food"], [" I was a little surprised by how the menu was on the pricey side when compared to certain other chains of the same category but I agree with the prices for the very large quantity of food served.", "food"], [" they have a good …", "food"], ["A beautiful Cheesecake Factory in an upscale mall.", "atmosphere"], [" I love visiting here for a quick bite before going around the mall shopping, or vice versa.", "location"], ["Always a favorite for date nights or any celebrations or just random dinners.", "atmosphere"], [" The portions are big enough and a lot of options in the menu.", "food"], [" American, Italian, Mexican cuisines.", "food"], [" They even have a less carbs menu for people who want.", "food"], ["Had a very tasty lunch.", "food"], [" Waitress was friendly and helpful.", "service"], [" Price was excellent.", "none"], ["  Forget the fast food.", "food"], [" You can have a nice lunch here instead for the same cost.", "food"], ["Everything was awesome here!", "none"], [" The Cheesecake Factory > everything.", "food"], [" Wait times a bit much.", "service"], [" Just come in advance and get your reservation early.", "none"], [" Other than that.", "none"], [" Service was amazing, food was awesome.", "food"], [" I would definitely come back here.", "None"], [" Of course cheesecake hit the spot!", "food"], ["Always great food and consistency  thanks for a wonderful  evening …", "food"], ["The food was OK priced for what we got.", "food"], [" Ordered a mexican chicken salad ($18) and it came with very little chicken although the actual portion was massive.", "food"], [" The staff took a while to come over to our table and take our orders, we were sat …", "service"], ["Great place to eat with lots of tasty dishes, awesome drinks and delicious desserts.", "food"], [" Just be prepared to wait for a table.", "service"], [" Usually a 30 minute wait before you're seated.", "service"], ["The food was AMAZING, my lasagna (first pick) was too die for, and I got the raspberry lemon cheesecake, wanted to try something different, and was so happy with my choice.", "food"], ["Delicious food as usual.", "food"], [" Quick dinner.", "none"], [" NY strip sirloin steak and mashed potatoes.", "food"], [" And a coffee.", "food"], [" Perfect steak.", "food"], [" Lovely service.", "service"], ["After spending almost $80 tonight I get home after picking up my order and after not having 2 other items available on the menu instead of just telling me they don’t have anymore Evelyn’s Pasta they give me this!", "food"], [" What is this?", "none"], ["Delicious food and friendly staff.", "food, service"], [" We stopped by on New Year's Day this year to pick up some lunch and cheesecake slices.", "food"], [" We were in and out within a matter of a few minutes.", "none"], [" The parking at Menlo Park Mall isn't always the best, but The …", "parking"], ["Food was good, service is good, wait was alright.", "food"], [" The wait was to be expected with how many people were there.", "none"], [" Not as amazing as people say but good enough.", "food"], [" Do recommend it.", "none"], ["The portion sizes definitely live up to the name.", "food"], [" It was pretty packed during a Sunday afternoon when we went, but the 20 minute wait was well worth it.", "atmosphere"], [" The food itself is delicious which the Louisiana chicken pasta and buffalo blasts hit …", "food"], ["Let me tell you this story.", "none"], [" Put our name down for a party of four and waited the 50 minutes, ot the issue considering it was a Friday night and we're finally able to be out in public without masks.", "service"], [" But after getting the txt saying our …", "none"], ["Have not been to Cheesecake Factory in a while, food was very good, big portions.", "food"], [" Desert is awesome!", "food"], ["First off the hostesses, Keanna & Will were very rude and they need to be either re-trained or fired.", "service"], [" Please note: this is a very crucial time for restaurants, so any one who owns or works at a restaurant needs to be very humble and …", "service"], ["Ringing in my 34th …\nAwsum spread and cheese cake factory doesn’t need any intro.", "food"], [" Been dying to go to this place since I watched BBT .", "none"], ["Mervyn was our server, he was both engaging, courteous and displayed excellent customer service skills.", "service"], ["   Thank you for making our dining experience enjoyable.", "service"], ["Food was good .", "food"], ["  Service was decent,  had better experience last year …", "Service"], ["Food was the best.", "food"], ["   Our server was polite, and had a terrific attitude.", "service"], ["   Will definitely go back again.", "None"], ["Good food and drink variety.", "food"], ["  Family enjoyed the food and we had top notch service from our server.", "food, service"], [" Javeria was efficient, friendly and anticipated our every need.", "service"], [" Made the meal much more enjoyable.", "food"], ["Amazing place to go but food is not that spicy.", "food"], ["I requested for spice even then it was mild .", "food"], ["\nBut overall a really delicious and mouth watering delight", "food"], ["Reservation recommended; we were seated in less than 5 minutes.", "none"], [" Waiter was courteous and prompt.", "service"], [" A very good meal for us and cheesecake to go.", "food"], ["Food was great.", "food"], [" Very busy wait time which was expected.", "none"], [" Had a passion fruit mojito and bang bang chicken and shrimp which was excellent.", "food"], [" Calamari and egg roll were a great appetizer", "food"], ["Went to eat lunch today, ordered the tacos and it was so terrible it got me sick.", "food"], [" Tacos were not even served warm and the rice side wasn’t even fully cooked.", "food"], [" Will not be coming again.", "none"], ["The wait time is just crazy here on weekends!", "service"], ["\nIt will be helpful if they numbered or had a mechanism to call out the names of each cheesecake especially when they are placed one behind the other in the …", "Food"], ["Food was very good.", "food"], [" I wish the steak was bigger.", "food"], [" The lightning in the restaurant is to low had a hard time reading the menu.", "atmosphere"], [" Plan cheesecake was great.", "food"], ["Love this place.", "atmosphere"], [" It has such a large menu that I try different things each time.", "food"], [" Food is always on point.", "food"], ["Always busy with great food.", "food"], ["\nSome of the best burgers I ever tasted!", "food"], [" Moderate prices.", "none"], ["\nHighly recommended, enjoy!", "none"], ["Had a horrible experience yesterday at that place.", "service"], [" We went in at 9pm to celebrate my mom’s birthday and we were told they are not sitting anymore customers because they are fully booked though I could see plenty of empty tables.", "service"], [" The hostess …", "service"], ["I ordered shrimp,chicken, andouille gumbo.", "food"], [" I asked them to omit the shrimp since I'm allergic and just give me extra andouille sausage in place of the shrimp and was charged 4 dollars extra.", "food"], [" Isn't shrimp more expensive than sausage?", "none"], ["Very good food , delicious cakes great service, friendly staff thank you", "food"], ["The food is always satisfying, but it's never anything to write home about.", "food"], [" The breakfast Monte Cristo is not a Monte Cristo, it's just a breakfast sandwich.", "food"], [" The Chicken and Waffles was lacking.", "food"], ["It was a busy Saturday night so I expected to wait a bit for the table, but the food took FOREVER to come out.", "service"], [" My burger was not cooked medium like I had asked and was much closer to rare.", "food"], [" Ended up getting a stomach ache from the food.", "food"], [" Good bread though, so I guess that's a plus.", "food"], ["Good food, large menu with many choices.", "food"], [" Great wait staff but forgot to refill drinks a few times.", "service"], ["Amazing food, service and the cheesecake is unbeatable!", "food"], ["   Always have a good time here.", "atmosphere"], ["We waited 2hrs for a table, that being said the food was pretty good, the portions were a nice size.", "service"], [" The staff was very nice.", "service"], [" I do feel like half the restaurant was empty and more people could've been seated, maybe it's a COVID thing", "location"], ["This is one food chain i loved in every town of my US visit.", "food"], [" Ambience, service, Food everything Par excellence", "food"], ["Really good people and excellent service food was delicious .", "food"], ["but one on the think i like more was the service and the excellent crust they're have.", "food"], ["thank you guys.", "none"], ["Tremendous amount of choices on the menu.", "food"], [" Food is tasty and service is friendly and accommodating.", "food"], [" Never disappoints.", "none"], ["Meaghan at Menlo Park nj Cheesecake Factory was amazing today 6-23-23\nBest service I’ve ever had .", "service"], [" I hope corporate can see this or upper management she is an extraordinary asset", "none"], ["Very upset.", "none"], [" spent a lot of money on jamaican shrimp and its so heavily breaded and soggy.", "food"], [" 3 years ago when i used to religiously order this, it was lightly seasoned and great.", "food"], [" to the top right is the MOUND OF seasoning i hand peeled off of only 4 shrimp.", "food"], [" so disappointed.", "none"], ["Who doesn't love the Cheese Cake Factor?", "food"], [" Can't get enough of their food.", "food"], [" With so many different options it's hard to pick what you wanted.", "none"], ["I need to invest STOCK in The Cheesecake Factory and I am not referring to.", "none"], [" Chicken Stock!", "food"], [" Love, Love, Love this place.", "atmosphere"], [" We were treated out for a meal and everyone at our table was quite pleased at our choices.", "food"], [" Love, love, love this place!", "atmosphere"], ["I said that already!", "None"], ["Stopped in for a late drink and something sweet.", "food"], [" unfortunately they were out of cold brew for Espresso Martinis but our bartender recommended Irish coffee to accompany our Chocolate Mousse Cheesecake", "food"], ["Just lovveee this place !", "atmosphere"], ["\nTheir vegetarian options have increased every year.", "food"], [" just order a great dish and say MINUS MEAT MINUS FISH …", "food"], ["Food was very slow to be served.", "Service"], [" When it finally did come out it wasn't any good.", "food"], [" Waiter would be gone forever.", "service"], [" Manager did her best to take care of us but at the end of the day I left disappointed and hungry  …", "Service"], ["We had a large party that they welcomed and accommodated.", "service"], [" Service was excellent.", "service"], ["Placed an order for chicken parm and was served burnt food.", "food"], [" You would think it would not make it out of the kitchen but no.", "food"], [" When I told the waiter of this he took it back.", "service"], [" Not get the manager.", "service"], [" Oh wait I asked for one and he could not care at all.", "service"], ["Great food with awesome ambience", "food, atmosphere"], ["This is my absolutely favorite place ever!", "atmosphere"], [" I had great time with my friend.", "atmosphere"], [" It was so amazing.", "none"], ["let me show you!", "Sure, please provide me with a comment and I will give it a label."], ["Although busy on a Friday mid-afternoon, I was seated immediately.", "service"], [" The menu is large, but it also includes a weekend brunch selection.", "food"], [" I ordered the herb crusted Salmon (lunch portion).", "food"], [" It includes mashed potatoes and asparagus.", "food"], [" It was good …", "food"], ["Great service!", "service"], [" The food was fantastic.", "food"], [" The atmosphere was unique.", "atmosphere"], ["Probably the absolute worst place to eat.", "food"], [" Dishes are not clean.", "hygiene"], [" Drinks are way to strong over poured.", "service"], [" Had 1 sip of my drink and i told my server I can't drink this and I still had to pay for it.", "service"], [" Service was horrible waited 20 minutes for …", "service"], [" stick to cheesecake.", "food"], [" this is my “fresh” $15 tortilla salad.", "food"], ["  But cheesecake to go if you’re craving and it’s crowded!", "food"], ["  Best time to go is early on Sunday, right when they open.", "none"], ["We had a great experience at Cheesecake Factory recently, specifically the customer service was great.", "service"], [" “Angel” was our server and he took really great care of us.", "service"], [" He was quick to bring the bread and drinks as we settled down.", "service"], [" He was prompt …", "service"], ["Always a great time at Cheesecake.", "atmosphere"], [" Two of our faves are Korean cauliflower and Asian lettuce wraps with a side of bloody Mary and mojitos.", "food"], [" Perfection!", "none"], ["Nice place.", "atmosphere"], [" No wait time today.", "none"], [" The server was very courteous and service was quick.", "service"], [" Food was yummy and good value for $$.", "food"], [" Recommended.", "none"], ["Fantastic experience.", "none"], [" Even though it was a packed Friday night and they were on a wait, our food came out on time and was delicious.", "food"], [" Our server Dan in the bar was very knowledgeable of the menu and was there anytime we needed him.", "service"], ["The chicken wings were delicious, but the other part of the meal was just ok", "food"], ["Food has gone downhill the past couple of years.", "food"], [" The cheesecake is good.", "food"], ["Had the Shrimp platter.", "food"], [" The shrimp was over-cooked, the fries were barely cooked.", "food"], ["95 and I was never offered a refill.", "Service"], ["  Never got the is everything OK visit from the waiter.", "service"], [" Didn't see him til the desert push.", "none"], ["I ordered the cobb salad dinner size portion and it was extremely generous and very good.", "food"], [" I recommend that if you're into salads.", "food"], [" Plenty of protein to satisfy you, eggs, blue cheese, avocado, and bacon.", "food"], [" It was very good.", "food"], [" The alcohol prices are very high and you don't get much of a drink,  I don't order alcohol there anymore.", "food"], ["This has to be one of the best Cheesecake Factory locations I’ve visited, service was excellent, and our server Adam I believe was his name , was super attentive and drinks and food followed in a timely manner.", "service"], [" Food was delicious and will definitely revisit", "food"], ["It felt crowded.", "atmosphere"], [" Not enough space between tables.", "atmosphere"], [" Food wasn't as tasty as other locations.", "food"], ["I've been coming to this location for many years but my recent visit was extremely disappointing.", "service"], [" We were a group of 5 with 3 children under 3.", "none"], [" We ordered many things but among them were a margarita pizza for the kids which we realized was …", "food"], ["Carlos our waiter was excellent attentive for being so crowded on a Saturday night the service was wonderful the food was good I got the avocado egg rolls which are usually good but they were not that great tonight but I think just because …", "food"], ["I love the food  Very good and reasonably priced!", "food"], [" The staff are very kind too  …", "service"], ["Came here last weekend with my boyfriend.", "none"], [" The waitress came to our table after about 10 minutes with room temperature water (no ice).", "service"], [" After that we noticed there was garbage under the table, open sugar packets on the table, and the plates …", "hygiene"], ["I've been here for celebrating my friends' birthday.", "atmosphere"], [" Generally, the food is delicious and the vegetable & chicken salad is so yummy", "food"], ["So tasty food/souce", "food"], ["If you come here at dinnertime, be prepared to wait, wait and then you wait some more.", "service"], [" The atmosphere is pretty dark which made it hard to read the menu.", "atmosphere"], [" My wife and I both arrived and places our name around 5:50 told it was a 40 minute …", "none"], ["Great food and cheesecake as usual.", "food"], ["  I live in this area for 6 years and almost go there once a week.", "none"], ["\nTry to avoid going there on Friday or Saturday night.", "Atmosphere"], ["  Long waiting time for …", "service"], ["I must say I was blown away by this place.", "atmosphere"], [" I've eaten at the one in Baltimore, and it was kind of sad .", "atmosphere"], ["This place is elaborate ,top notch.", "atmosphere"], [" It was packed when we got there and only waited 15 min to get seated.", "none"], [" I got the jambalaya which was …", "food"], ["The desserts.", "food"], [" You'll have to experiment on your own because there are no actual words.", "none"], [" It is situated in a practical and busy neighborhood.", "location"], [" Children and wheelchairs are welcome at the restaurant's entryway.", "none"], [" One of the best dining encounters I've ever had.", "food"], ["This place is always packed but it's nice to go for date night!", "atmosphere"], ["  Searing time was shorter than they told us, and we were sat at a booth away from all the craziness up front.", "Atmosphere"], ["  The food came out super quick!", "Service"], ["  The bread one piece was warm and toasty the other was luke warm and hard/chewy.", "food"], ["  Cheesecake always on point!", "food"], ["Really disappointing.", "None"], [" My pasta was too al dente and not very flavorful.", "food"], [" The service was very good though.", "service"], [" The cheesecake was rich and decadent.", "food"], [" It was the best part of the meal.", "food"], ["Food was great.", "food"], [" However be warned!", "none"], [" This place can get very busy always try and get a reservation or else you will wait an hour!", "none"], ["\nWill note the drinks here are meh mine felt a little watery I got a non …", "food"], ["Cheese factory was very good experience, their food and service were great.", "food"], [" Specially cheese cake with coconut was very delicious.", "food"], ["My first time going n it was by far the best experience I ever had.", "atmosphere"], [" Great food cheesecake to die for everything was awesome even the waiter we had was awesome.", "food"], ["Just now I call the place an order for a cheese cake and someone hung up on me 3 times.", "service"], [" Incredible", "none"], ["Happy hour menu has lots of good selections.", "food"], [" Large restaurant with lots of choices for seating.", "atmosphere"], [" Mac n cheese balls were delicious.", "food"], [" Cinnabon cheesecake was very sweet but soooo good!", "food"], [" They also have a decent wine selection (Riesling was delicious and not too sweet).", "food"], [" Justin, the bartender, was efficient and very professional.", "service"], ["Service was amazing.", "service"], [" Julius took wonderful care of us, but the place looks older than other cheesecakes!", "atmosphere"], ["I used to order food for pick up and usually I don't have an issue , but today I was shoked .", "Service"], [" As usual, I ordered stake taco and I chose no onion all other stuff I want as should be which include tomatoes, avocado cilantro etc.", "food"], ["Atmosphere could be better.", "atmosphere"], ["  The sponge painted walls and faux elegance everywhere is a bit dated.", "atmosphere"], ["  Service was great, they were slammed super busy, but still attentive and very friendly.", "service"], [" Food was decent.", "food"], [" Loved most things.", "none"], ["  Careful about …", "hygiene"], ["Cheesecake factory has a very extensive menu, including a low calorie one.", "food"], ["\n\nThis particular location is not very clean or well managed.", "hygiene"], ["Had the lo-cal fried chicken sandwich @ lunch.", "food"], [" Good flavor,great crunch.", "food"], [" No bite to siracha mayo spread", "food"], ["It was busy, but that was expected since it was a Sunday.", "none"], [" But that did not effect our food or the terrific service.", "food"], ["Please note that… the service we received from our waiter rates 5 STARS!", "service"], ["  I bet with your skills you’d make top dollar at a “non chain” restaurant but then we’d be sad to not have you as our waiter!", "service"], ["The jambalaya pasta was an absolute culinary masterpiece, exceeding all expectations in this food review.", "food"], ["I have eaten at this location many times and there are always very nice servers.", "service"], [" The fries tasted off.", "food"], [" I found a piece of friend chicken in my fries.", "food"], [" Perhaps the fries were cooked or fried  with chicken.", "food"], [" That is probably why they tasted …", "food"], ["This is usually my favorite place to meet my friends for lunch and hang out for hours and who doesn’t like cheesecake?", "atmosphere"], ["Was closed for a short while during peak COVID, but good to see they have reopened.", "none"], [" Absolutely love the (Sunday) egg omelettes, Belgian waffles and French toast!", "food"], [" Coffee is served immediately upon seating, along with warm breads and butter.", "food"], ["Fantastic service in both the bar area and then at our table for lunch today!", "service"], ["All meals from Chhesecake Facory aee ver tasty and portions are adequate.", "food"], ["\n\nHowever, I've had 4 issues with online order in past three months.", "none"], ["I’m going to give this place 5 stars as I always do because the food is ALWAYS great.", "food"], [" Our server was exceptional.", "service"], [" We found out it was only her second day which we couldn’t believe because she was so good.", "service"], [" Friendly, thorough and just overall …", "service"], ["They have excellent salad options BUT I just ordered the Wellness Salad with added grilled asparagus, I got it To Go (idk if they try to pull a fast one because they know you won't come all the way back) but my salad is missing broccoli and …", "food"], ["The order was served about after 30mins of wait although everything like 4 dishes were served at once after the long wait.", "service"], [" The nachos served here are huge and might wan to be considered as a meal in itself and not a appetizer.", "food"], [" Awesome louisana chicken pasta , spicy chipotle pasta (asian thingy:)) that u'll pack 1 for later, n nice refreshing mojito.", "food"], ["\n12th visit: You guys  for consistency in ur drinks (Nancy makes it the best) …", "service"], ["Had the shrimp and steak found it to be delicious, service was outstanding.", "food"], [" The flavors were amazing.", "food"], [" Now let's talk about my strawberry shortcake outstanding very yummy .", "food"], [" Stay hungry my friends.", "food"], ["i get that being understaff is a thing, but when your staff is constantly passing us by and ignore us.", "service"], [" and we wait ten minutes and our drink orders are not even being taken.", "service"], [" that's just makes me wonder why?", "none"], [" i just left.", "none"], [" and that's Not on the staff.", "Service"], [" that's on whoever is in charge.", "none"], ["Great place with delicious food.", "food"], ["luv the grilled pork chop.", "food"], ["also another favorite  was the steak diana.", "food"], ["the staff was friendly and fast.", "service"], ["they seemed to work well together and wanted everyone to be happy with their food.", "service"], ["Can't remember the waitresses name but she was very pleasant.", "service"], [" She wasn't sure about the items on the menu but she did her job and was very nice.", "Service"], [" My mom got the Korean fried chicken over white rice I got the eggroll sampler.", "food"], [" Everything was …", "none"], ["Always have a pleasant experience at the cheesecake factory staff friendly and professional and, most importantly attentive.", "service"], ["First time I've been to a Cheesecake Factory in about a decade, and I'll be going back far sooner than that.", "food"], ["\nThe food was good and for how busy they were on a Saturday night, I had no …", "food"], ["No wait today,  got here early.", "none"], [" Like always good food and service.", "food, service"], [" Though Penny was not working today  …", "none"], ["Had a gift card and decided to give this place a shot again.", "none"], [" It’s been YEARS since I’ve been to a Cheesecake Factory.", "none"], [" It’s still good.", "food"], [" Joanna was a delight to have waiting on us.", "service"], [" She was very welcoming, kind and sweet.", "service"], [" The 5-star is entirely for her!", "service"], ["The food was great, but I have to say I was disappointed with the service.", "service"], ["  Our server, Kristina, came to take our order and everything was fine.", "service"], ["  But, then after everything was ordered it took forever to take our menus even after the food …", "service"], ["We didn't Eat-In because of the long wait time (50 min).", "none"], [" so we decided to to take some cheesecake to go and move dinner to else where.", "food"], [" We focused on exotic/ tare flavors.", "food"], [" (Mango keylime -excellent choice,  salted caramel- yummy, and red velvet)", "food"], ["This was my first time at Cheesecake Factory and my family and I we loved it we are planning to go back the service was amazing the food was so delicious.", "food"], [" We were celebrating my daughter’s 18th birthday so it was just AMAZING", "atmosphere"], ["This CF is super dirty.", "hygiene"], [" Tables are sticky and then they put your silverware on it.", "hygiene"], [" We found hair in our bread and pasta.", "Hygiene"], ["I love there Louisiana pasta with chicken it’s one of my favorites .", "food"], [" The wait was pretty long and the staff are nice .", "Service"], [" It’s a place you go to for a once in a while .", "atmosphere"], [" I wouldn’t go there often because it gets so packed and sometimes the waiters take long to check on you when you need them .", "service"], ["Our waitress, Meaghan, was the best ever!", "service"], ["\nShe exhibited a great attitude and was very professional", "service"], ["Very pleasant customer service food and drinks were delicious.", "food"], [" You can get a table faster by making reservations on online.", "service"], ["Don't let the busy hostess area put you off.", "service"], [" Very efficient table management keeps wait times reasonable.", "service"], ["  Had the Club sandwich with fries.", "food"], [" Turkey was delicious.", "food"], [" Bacon crisp and flavourful.", "food"], ["  Tomato and lettuce fresh.", "food"], [" Coleslaw I  the sandwich made it.", "food"], ["Delectable food, quality and quantity ample, best cheese cake on this planet!", "food"], ["Excellent service and well presented food.", "food"], [" The place is beautifully planned, it was actually fun to eat in booths, you get your privacy to eat.", "atmosphere"], [" The service was extraordinary with special care taken towards the baby with us.", "service"], [" Keep up the good work.", "none"], [" I shall visit again.", "none"], ["Waitress was great but had so many tables she couldn’t tend to us as much as she wanted.", "service"], [" Food was underwhelming and overpriced.", "food"], [" Food used to be good.", "food"], [" Our cheesecake was still frozen in the middle.", "food"], [" Nothing came out good that night.", "none"], [" Standards have been lowered here.", "none"], ["Order the calamari had to take a pic … no calamari to be found it was all tentacles!", "food"], [" All I couldn’t believe it so disappointing!", "none"], [" It’s not a cheap appetizer so I was shocked to see this kind of presentation", "food"], ["Fantastic food.", "food"], [" very nice service and friendly people.", "service"], [" had family dinner here.", "atmosphere"], [",asked to make my dish (Jamaican Black pepper sauce chicken) spicy and it was really really good.", "food"], ["What a terrible experience.", "service"], [" We waited 40 minutes to be seated which is fine, but then we sat at our table for 20 minutes before a server even asked us if we wanted water.", "service"], [" Then after ordering our food it too one hour and five minutes before …", "service"], ["Always a good place to eat lot of food to choose from", "food"], ["Extremely disappointed.", "Service"], [" Order 4 cheese cake slices for the family and the price $9 and something.", "food"], [" Paid $42 and something with taxes.", "none"], [" The cheese cake is not good.", "food"], [" They changed the recipe.", "food"], ["  It’s horrible.", "None"], [" Not like how I and my family remember …", "none"], ["I've visited about 4 Cheesecake factories in the past and this one has much worse food than the rest.", "food"], ["\nI had to take a picture of the burger because I knew words wouldn't be able to describe this abomination.", "food"], ["Garlic Aioli sauce with calamari is great.", "food"], [" Also, very good drinks.", "food"], [" Grilled salmon with the California Avocado salad is awesome.", "food"], ["The worst experience I ever had!", "service"], [" Waited more than an hour with the device that never rang.", "service"], [" I seen new people coming in and being seated so I went up the to ask when was my turn and they said that they texted me.", "service"], [" So I was furious because I …", "none"], ["Appetizer was plain disgusting.", "food"], [" Manager didn't want to hear anything about it.", "service"], [" Looks like the bathrooms were last cleaned in 2016.", "hygiene"], [" Go to any other cheesecake factory.", "food"], ["Way overpriced the server was nice but was extremely overpriced", "food"], ["Food was really good.", "food"], [" Great service too.", "service"], ["Awsome food and drinks.", "food"], [" To get some thing you have to lose some thing so there was a bit longer Wait but worth it.", "service"], [" They give you a buzzer so you know when its your turn to sit.", "service"], [" Meal was nice and end as always cheesecakes.", "food"], [" Many great flavors to choose from.", "food"], [" Over all YUM YUMM.", "food"], [" wonderfull theme.", "atmosphere"], ["The customer service could have been better.", "service"], [" I ordered steak tacos with no avocado because I’m very allergic to it.", "food"], [" I did let my waiter know I was allergic and he wrote down no avocado.", "food"], [" When I was just about to taste my food, I noticed …", "food"], ["Busy and loud.", "atmosphere"], ["  You are practically seated with strangers.", "atmosphere"], ["  Food was very good and server did well considering the number of tables.", "service"], ["Service was slow, food was terrible.", "food"], [" Cheese sticks were undercooked, chicken was dry, just wanted to eat as fast as I could to leave.", "food"], [" Please go anywhere else but here", "none"], ["Waited a while to get in.", "service"], ["\nWhen we were seated I noticed the floor was messy.", "hygiene"], [" Pieces of bread, crumbs, utensil.", "food"], ["Service was nice.", "service"], [" Food was great with big portions.", "food"], [" But the wait time was too much.", "service"], ["Skinnylicious menu please.", "food"], ["\nFeels like a mini vacation when you walk into the Cheesecake Factory.", "atmosphere"], ["\nStaff was pleasant, received a greeting with a smile and for a packed …", "service"], ["If there was a zero stars, I would use it.", "service"], [" We sat down and waited TWO HOURS.", "service"], [" The terrible waiters try to be nice to fool you, but don't be tricked.", "service"], [" They have countless waiters, but they don't do anything and sit around like pigs.", "service"], [" Please, for your own sake, don't come to this horrific place.", "none"], ["Could not cut the chicken!", "food"], [" Next piece just as bad!", "food"], ["00 they should have comped entire meal!", "service"], [" 1 hr wait to re do!", "service"], ["Our server, Evelyn D.", "service"], [" was extremely helpful and outstanding!", "service"], [" Gave us really good recommendations!", "service"], [" She also went above and beyond normal service to ensure everything came out perfect.", "service"], ["The food here was good and the customer service here was good as well.", "food"], ["Food is always good.", "food"], [" I get the veggie burger and the beats and goat cheese appetizer.", "food"], [" The drinks aren't strong, but then again I don't need strong drinks.", "none"], [" I love the music played at TCF.", "atmosphere"], [" I have to put forth effort not to sing along and …", "none"], ["What's up with lighting in a restaurant where you can't even see the face of your loved ones and definitely not what is in the plate?", "atmosphere"], ["\nThe menu is miles long where most dishes are a futile attempt of mixing strange …", "food"], ["While the service was excellent and our server did everything in her power to correct things, I have a comment about the food.", "food"], ["  I had the Garlic Lemon grilled shrimp from the skinnylicious menu.", "food"], ["  The shrimp was cooked well however the pasta …", "food"], ["I really like going to the cheesecake.", "food"], ["\nHowever recieved an unpleasant surprise upon entering the restrooms.", "hygiene"], ["Paper towel mess everywhere on the floor, on the sink, trash receptacles over flowing.", "hygiene"], ["The menu keeps getting smaller and smaller.", "food"], ["  The found is average at best now compared to when they first open.", "food"], ["  I waited between 10 to 15 minutes before the waitress came to take my order.", "service"], ["  The service provided is not very attentive.", "service"], ["Decent enough place.", "atmosphere"], [" Some food is more expensive than it should be, but overall it's OK.", "food"], ["\nPork chop was very good.", "food"], ["I came in for an ap and glass of wine.", "Food"], [" The service was very poor.", "service"], [" I totally understand that the guy Steve behind the bar was the only guy running drinks for  bar area and entire restaurant.", "service"], [" I was sitting for a good 10 MINUTES before waited …", "service"], ["Food was good.", "food"], [" Service could be better.", "service"], [" Food presentation was excellent though.", "food"], ["Terrible bad service food was cold i wouldve rather ate at McDonald’s ordered med well got raw pink….", "service"], [" Fries were soggy full of oil like the bottom of the batch mashed potatoes were cold with a cold slice of cheese terrible all around….", "food"], ["My server was the best.", "service"], ["I don't remember her name but I know who station I want to be seated.", "Location"], ["I remember what she looks like", "none"], [" I used to love this place, however, it totally went down hill for me.", "none"], [" Service was not great.", "service"], [" We waited a good while before anyone came over.", "service"], [" The bread was cold.", "food"], [" My Mushrooms had a hair in it.", "hygiene"], [" Then when the manager cokes over, she says …", "service"], ["Came in at 5pm and it wasn’t too busy so that was great.", "atmosphere"], [" The bread took a good 20 minutes to come out.", "service"], [" We ordered the beef sliders as an app and wasn’t too impressed with it the taste was okay but they were very sloppy looking.", "food"], ["Bit pricey but the food was good.", "food"], ["Quality has Not Changed!", "food"], ["\nI'm so impressed with the chefs here!", "food"], ["\nService is still top notch.", "service"], ["Food was not good.", "food"], [" I had the mushroom burger the bread was burnt I had about 4 mushrooms on my burger.", "food"], [" My sweet potato fries was burnt to.", "food"], [" The service was good.", "service"], [" I will never eat there again.", "None"], ["Delicious food and one of the few places to get low-carb cheesecake (they actually tasted good).", "food"], ["The food and cheesecake are always amazing.", "food"], [" One star off because the wait is nuts!", "service"], [" Other than that no complaints.", "none"], ["Visiting family in NJ from Oregon and this was one of the best cheesecake factories I’ve been to!", "food"], [" Very speedy service and delicious food:) I missed Jersey and Cheesecake Factory!", "Food"], ["Exceptional take out service.", "service"], [" Very prompt and easy if you order online.", "service"], [" The text messages are on time if your order is ready.", "service"], ["The Staff is wonderful and attentive.", "service"], [" I dropped my drink while have a few weeks ago and broke the glass.", "none"], [" Immediately another waiter came to tend to me ( my assigned waiter was assisting another table) the manager came and checked on me.", "service"], [" I felt cared for as a customer.", "service"], [" Very rare these days.", "none"], ["This place is one of my sons' favorite places to eat (and he's picky), and I like it also.", "food"], [" The food is great, and the service is awesome, they have a huge parking lot.", "Food"], ["Great food and services only bad part is the wait .", "Service"], ["Check your table and utensils!", "hygiene"], [" 2nd visit for brunch in which the table, plates, and utensils were all dirty.", "hygiene"], [" Crumbs on the table, dried food still on the plates and utensils to greet you for brunch.", "hygiene"], [" All neatly placed mind you.", "none"], [" No one is checking the night crew at closing, or the tables prior to opening.", "hygiene"], ["It was great.", "none"], [" Service and food was great.", "food"], [" Cheese cakes are always good just a lil too sweet in my opinion lol.", "food"], [" I went there for my birthday.", "atmosphere"], ["  It's just sad that they don't do the birthday singing anymore because as per management it …", "service"], ["Fun family place to be.", "atmosphere"], ["\nHad great 3 course meal.", "food"], ["every bite was mouth watering.", "food"], ["\nShall visit again.", "none"], ["recommended!", "none"], ["This place is ALWAYS packed.", "Atmosphere"], [" My mom walked in and found two seats at the bar right away and granted they were swamped.", "location"], [" We got our drinks and then placed our food order.", "food"], [" I asked for no croutons and there were croutons on my salmon Caesar.", "food"], ["Love their desserts and variety of food.", "food"], [" But the big downside is the staff.", "service"], [" They constantly make mistakes that could've been easily prevented.", "service"], [" Other than that food and dessert is amazing.", "food"], ["I'd give it 5 stars for Dylan's service!", "service"], [" He suggested an awesome cocktail and was very polite, courteous, and perfect with customizing the orders.", "service"], [" Made my day!", "none"], ["Food is consistently good and the cheesecake is the best.", "food"], ["Absolutely amazing food and service.", "food, service"], ["  Also the decor was breathtaking.", "atmosphere"], ["Found that this branch has better quality food taste than the Bridgewater one.", "food"], [" Shrimp gumbo and miso salmon is yum!", "food"], ["This particular one is so dark!", "atmosphere"], [" I wear glasses and could not see the menu.", "none"], [" The food was dry and had no flavor.", "food"], [" Only thing good were the avocado rolls!", "food"], [" Spent nearly $200 on disappointing food.", "food"], [" Save your money.", "none"], ["Food was so bad, tasteless,  and shrimp looked like they were cooked two days ago.", "food"], [" Steak was well done while we ordered medium rare.", "food"], ["  It’s sad to see such a place going down hill!", "none"], ["  I would not give this food to my dogs!", "food"], ["I love this place !", "atmosphere"], [" The Miso salmon stole my heart from the filet mignon  but worth it.", "food"], ["The wait times could get annoying i must say.", "service"], [" The food is as any other cheesecake factory restaurant.", "food"], [" The drinks are okay.", "food"], [" The floor is always slippery, never fails.", "hygiene"], ["Wait time for a table was 50-90 minutes.", "none"], [" So I  ordered out.", "none"], [" Requested that the burgers be cooked medium well got most of my order at the requested time but had to wait 15 minutes for my drinks.", "service"], [" Upon reaching home, the burgers were cooked to well done (though they were good) not the way I asked.", "food"], ["Been my local favorite since it opened somewhere in 2007 .", "none"], ["of course it's on the pricey side.", "none"], [" You get what you pay for.", "none"], [" Service, quality and ambience.", "atmosphere"], [" Helps that its within Menlo Park mall Edison Nj.", "location"], [" Increased the curbside parking …", "parking"], ["Staff was quick.", "service"], [" Some dude appeared outta nowhere.", "none"], [" Took our order as disappeared.", "service"], [" Our server appeared and she was quick.", "service"], [" Food was fresh.", "food"], ["Terrible experience here.", "service"], [" I would not recommend coming to this location.", "location"], [" We sat outside on the patio.", "atmosphere"], [" It took over an hour for our food to come after ordering and they brought the wrong order, so I had to wait even longer for my food.", "service"], ["Worse takeout experience!", "service"], [" We went to this location to pick up our food during the time said when we placed an order, so that we can get our order when it’s still fresh and warm.", "location"], [" The hostess or for the 3 girls standing in the front said the …", "service"], ["This is the third time I have a bad experience here.", "service"], [" My husband and I came here.", "none"], [" He hates coming here because of the service but he does it for me because I love the food.", "service"], [" We waited 15 mins to get a table which is normal.", "none"], [" We got seated and …", "atmosphere"], ["The Cheesecake Factory used to be a go-to place when it came to default dining for me and my friends.", "atmosphere"], [" Unfortunately, over the past couple of years, it's been on a downhill slope when it comes to the food quality and service (especially at …", "service"], ["Went to dinner for my sons birthday and it was a really bad experience.", "service"], [" We have eaten there many of times and it was always consistently good.", "food"], ["  Sadly, NOT this time-  every time we tried to order something from the menu the waiter said …", "service"], ["Best service I've ever received in the 16 years I've been coming.", "service"], ["Ask for Meaghan!", "Service"], ["Server Saul was excellent, kind and friendly.", "service"], [" Bacon-Bacon cheeseburger was supposed to be med-rare, it was well done.", "food"], ["  Topped with a chunk of fat, and no cheese.", "Food"], ["  Spoke with the manager, she offered another burger, but no refund.", "service"], ["I was little concerned because the hostess was rude.", "service"], ["  she looked at me and said Scan this for the menu.", "service"], [" before we even sat down.", "service"], [" I asked if there was one on the table and she said no scan this.", "none"], [" I notice there were regular menus and ask can …", "food"], ["45 minutes wait for food and the steak is a wrong temperature", "food"], ["Rarely go to the cheese cake factory because there is just to much food.", "food"], ["\n\nWent with the family and they wanted appetizers, we had Mac and cheese bites …", "food"], ["Keep you waiting for too long service for no reason was very poor, very incompetent", "service"], ["Amazing food, utterly extraordinary.", "food"], [" The only thing I found weird was the wait time.", "service"], [" Sometimes they say the wait time is 45 minutes.", "none"], [" That's already a lot.", "none"], [" If you tell them that you would like to enlist in the queue, they will message you …", "service"], ["My wife and I love going for an early lunch.", "none"], [" when it is not so crowded.", "atmosphere"], [" But the past couple of visits has bee just for dessert.", "food"], [" Our two top picks are pineapple or the raspberry cheesecake .", "food"], ["The 1 star is for the excellent service from our server.", "service"], [" Overcooked  tough steak and cheesecake with very little cheesecake in it.", "food"], [" More cake than anything.", "food"], [" For $10 a slice you should get 100% cheesecake.", "food"], [" I won't go back.", "None"], [" Overpriced and underwhelming.", "none"], ["Sunday Brunch was good.", "food"], [" always a great time.", "atmosphere"], [" I have to get a booth cause seats are close together in some sections.", "atmosphere"], ["This is one of my favorite restaurants in Raleigh NC so when I saw this one while visiting NJ I had to go!", "location"], [" Also my younger cousin had never been so we chose this over Benihana.", "none"], [" Regret that now.", "none"], [" First my daughter order cheese sticks, which …", "food"], ["Not a bad wait time considering for a Friday night, but the calamari was mostly legs and really greasy.", "food"], [" The server was really friendly and we tipped her well despite not happy with our appetizers.", "service"], [" My husband ordered the strip steak that was heavily seasoned.", "food"], [" Not a bad place to eat but def worth getting their cheesecake!", "food"], ["Excellent food, quick curbside service.", "food"], ["  This is not a complaint, but a warning for anyone using curbside at this location.", "parking"], ["  Mall patrons park their cars in the spaces designated for curbside, leaving no spaces for those picking up food.", "parking"], ["   Too bad the empty cars can't be towed away.", "parking"], ["Very good food and service.", "food, service"], [" The front desk person was really nice and accommodated our requests even at the rush time of hour.", "service"], [" Lot if variety yo choose from, even good number of vegetarian options which all were delicious  …", "food"], ["Good food ,beautiful atmosphere, great service.", "food"], ["The wait is always too long especially when they have open tables", "Service"], ["Went to Cheesecake Factory in Menlo Park Mall with a large party around 2 pm.", "none"], [" The only downside was the close to 2hr wait but our wonderful waitress Jennifer W.", "service"], [" surely made up for it.", "none"], [" She was not only incredibly friendly, timely with our …", "service"], ["Well it's been a while since I've been able to get out so I'm just really glad about that.", "None"], [" Now onto the review.", "none"], [" Cheesecake factory is following protocol when keeping the place clean.", "hygiene"], [" Our server was very nice.", "service"], [" The appetizers were pretty …", "food"], ["Always amazing food and experience.", "food"], ["  I had the french toast.", "food"], [" Unique, great taste.", "food"], ["  At this location, Javier was our great server.", "service"], [" Ask for him for incredible service!", "service"], ["Can someone let me know the name of the cook that was working the opening shift today?", "none"], [" So that I can NEVER go there again when they are working.", "none"], [" I've been going to or getting food from CF for years and this is the worst food I've ever had …", "food"], ["We had a quick stop for a cheesecake after our apple store shopping  but end up having crab wantons too.", "food"], [" I love the food and our server was quite well spoken and served us warm bread and butter which was quite filling in itself.", "food, service"], ["I am regular here.", "none"], [" Overall experience is great but not easy to get tables n the weekend.", "location"], [" Quality and customer service are generally per expectations.", "service"], [" Plenty of choices on the menu.", "food"], [" \"Skinnilicious\" menu with low carbs is available.", "food"], ["Great food.", "food"], [" Waiter was very nice.", "service"], [" Love this place!", "atmosphere"], [" It was an hr wait for dinner.", "none"], [" But it also was Sunday and very busy, I expect that coming to dinner on a weekend.", "none"], [" Other than that, this was my first time and I will definately be coming back.", "none"], ["Always a great experience at The Cheesecake Factory but for my first Brunch there they decided to blow my mind with these Cinnamon Swirl Pancakes.", "food"], [" PHENOMENAL!", "None"], ["I ordered 4 slices of cheese cake which came up to $40+taxes for the cost of 1 slice i would expect the cake to be fresh, my Oreo slice was not, in fact the cookie taste old and the cookie under the cheese cake was old also, the chocolate …", "food"], ["I ordered food today for take.", "food"], [" I ordered the dynamite shrimp and side order of shrimp scampi.", "food"], [" The dynamite shrimp were dry and tasteless.", "food"], [" The scampi shrimp were a fried mess.", "Food"], [" The mashed potatoes weren’t even mashed but lumped red …", "food"], ["Definitely got food poisoning from here.", "hygiene"], [" Be careful.", "None"], ["Came in this evening and everything was fantastic, from the food to the service.", "food, service"], [" Had the flatbread pizza as an app which was tasty, my burger was cooked perfectly, and my girlfriend absolutely loved the Louisiana chicken pasta.", "food"], [" Had a slice …", "food"], ["Food and waitress were great.", "food"], [" Place could use a good cleaning though.", "hygiene"], [" All the menu's were sticky and 2 of the 4 plates at the table had leftover food on them.", "hygiene"], ["Went here for brunch.", "none"], [" I ordered the chicken and waffles and a orange juice.", "food"], [" A little heavy handed on the powdered sugar on the chicken and waffles, but still tasty.", "food"], [" Beware of the orange juice if you don't like pulp.", "food"], [" Overall a good experience.", "none"], ["1) I ordered two strawberry short cakes for dessert for takeout.", "food"], ["\nA) The 3 sugar doughnut they gave us for each order was terrible, they were hard and didn't seem fresh.", "food"], [" The plastic fork they gave us for the ordered wouldn't …", "hygiene"], ["We were so glad we made reservations because on a Saturday night this place was popular.", "atmosphere"], [" They are so organized and with a reservation we were in within 5 minutes.", "service"], ["Everything is good and delicious", "food"], ["This place is awesome.", "none"], ["Wide variety of cheesecakes and yummy.", "food"], [" Must visit if you are in Menlo park mall", "location"], ["I love coming here!", "atmosphere"], [" Especially for my Birthday!", "atmosphere"], [" The portions are huge & the Cheesecake is delish!", "food"], ["Shrimp and chicken gumbo was so good.", "food"], ["I was about to lick the plate.", "food"], ["true story", "none"], ["Lots of choices on the menu.", "food"], [" Good service.", "service"], [" Delicious cheesecake.", "food"], [" Didn't wait that long for a table.", "none"], ["My time at the Edison location was awesome!", "atmosphere"], [" The appetizer and entree arrived SUPER fast which was very impressive on a Friday night (it was packed).", "service"], [" The waiter was incredible and very sweet (his name is Stephen I believe) nothing was wrong …", "Service"], ["We went to celebrate my husband, stepdaughter and granddaughters birthdays.", "none"], [" The food was good as usual but a disappointment was that they don't sing happy Birthday at the table.", "atmosphere"], [" Other than that, it was great.", "none"], ["Wonderful resturant at a great location.", "location"], [" Shop then relax with a great meal.", "food"], [" Great free parking available.", "parking"], [" Pick up a book at the nearby bookstore to enjoy with your meal.", "none"], [" Close to major routes.", "location"], ["First time at Cheesecake Factory was great.", "atmosphere"], [" The Location at Menlo Park Mall NJ was big.", "Location"], [" We were early for our  reservation and they sat us immediately.", "service"], [" The service was excellent.", "service"], [" Our waiter Chris was very helpful and attentive.", "service"], [" Our app and entree choices were very good.", "food"], [" Cocktails too.", "food"], ["Why people don't go to a family owned diner over this corporately owned overpriced establishment is beyond me.", "none"], ["food quality is pathetic, worst than a chinees take out place.", "food"], [" for fried items its very obvious that oil is re-using for days.", "hygiene"], ["  Also  complimentary bread is only for selective people.", "food"], [" not sure about the criteria.", "none"], ["Five dollars 4 one coffee, and you have to pay 5 for another coffee", "food"], ["The restaurant needs a bit more care like wiping the back of the booths , pretty dusty  and walls need some cleaning!", "hygiene"], ["  Same with windows .", "none"], ["\nFood is always good but not the same quality as when they first open the restaurant , I know times change but you have to keep the place nice and clean all the time!", "Food"], ["Came in yesterday evening and my entire party of eight, including myself loved our food!", "food"], [" Our waiter, Javier was the best server I’ve ever had!", "service"], [" So ATTENTIVE, polite and is such a positive person.", "service"], [" Made our dining experience super pleasant.", "service"], ["The food isn't worth writting about.", "food"], [" Half the stuff on the menu is just greasy stuff.", "food"], [" Only the cheesecake is worth getting.", "food"], ["\nWhen me and my friends finished eating, we were CHASED by our waiter demanding …", "service"], ["The food was good but not great.", "food"], [" I expected more.", "none"], [" The breaded shrimp tasted like it was frozen and then fried.", "food"], ["\nThe bread was great but it would have been better with real butter and not …", "food"], ["At this point I only really come here for the cheesecake.", "food"], [" Their food is hit or miss( I assume it's do to whomever is working the line that day).", "food"], [" Some of their cheesecakes have a more custard texture than I'd like; but still paletable.", "food"], ["This is by far one if my favorite restaurant chains.", "none"], [" I love the impossible burger- it’s a vegans delight!", "food"], [" Also the salmon is a favorite of my oldest daughter.", "food"], [" The problem always with this place is time management.", "service"], [" The wait staff is very friendly but come on they need more workers.", "service"], [" Still I will be back for sure!", "none"], ["While I love this place and have been coming here for more than a decade, the little things matter when dining out.", "service"], [" They are quick to attempt to fix any problems right away, but I am still waiting for a refund from July 16th.", "service"], ["My friend got a gift card for the Cheesecake Factory.", "none"], ["  Around 4:10 pm on New Years Eve I called them to place an order for dinner.", "service"], ["  I was told they \"are no longer taking take out orders for New Years Eve\".", "none"], ["  Never heard of a restaurant …", "none"], ["My food was burnt, and they gave me a new meal one hour later, my party was leaving so I was not able to eat my food.", "Service"], ["  The manager told me he was giving me a discount but turned out to just be full price.", "service"], ["  I would not recommend this place at all.", "none"], ["My son’s kids meal, missing mashed potatoes.", "food"], [" And the rest of the chicken.", "food"], ["\n\nUpdate Was asked to contact via website no reply from Cheesecake Factory.", "service"], ["Always have a great service at this location w no issues", "service"], ["I love it nice employees good food  …", "food"], ["We were there to celebrate my son's birthday.", "none"], [" We arrived around 8:15 p.", "none"], [" on a Monday night and it was very comfortably crowded.", "atmosphere"], ["  I say comfortably crowded because most of the customers were sitting at the tables and not in the wait area.", "atmosphere"], ["It's a cheesecake factory, so you basically know what you're in for already.", "food"], [" Had lunch here and got the margherita flatbread.", "food"], [" Good service.", "service"], ["The food was very delicious.", "food"], [" My only problem was I ordered curbside and had to walk in and pick up my order because they were overly busy.", "service"], [" They did not alert me that it was ready and I called and was hung up on several times.", "service"], [" I feel like …", "none"], ["We ordered two cheesecakes at 847p and they said they would be ready by 7:17p.", "service"], [" I called at 720p for check on my order and the girl said she would look for it and text me.", "Service"], [" 10 min later so I got out of my car and went inside.", "parking"], [" And behold.", "none"], ["Had such amazing service from Joanne.", "service"], [" She was so nice and accommodating.", "service"], ["\n\nThe food was amazing as well.", "food"], ["Had a good time on daddy daughter putting", "none"], ["The food is good although a bit on the expensive side but usually filling, I have yet to try the desserts.", "food"], [" If your going in the afternoon depending on the time and day be prepared to kill some time as there's usually a wait as well the …", "Atmosphere"], ["Pretty terrible to rip off people by charging $4.", "none"], ["95 fir an ice tea!", "food"], [" I will NEVER return and will tell everyone I know not to go to this restaurant .", "service"], [" Pretty sad !", "none"], ["I go to The Cheesecake Factory because my whole family loves the dishes, environment, services and food, however this Thursday (05/05) we had the idea to have dinner there and even though the experience was great I had the worst food …", "Food"], ["The menu is extensive and all at a good price.", "food"], [" They do not get reservations and there may be a few mins of wait on busy times.", "none"], [" The only cons I know is their lemonades are extremely sweet to the point that its undrinkable.", "food"], ["At the time that I visited, the festaurant seemed very under staffed.", "service"], ["  Consequently, the waitress was unable to bring things to the table in a timely manner.", "service"], ["the food is good, the server very bad.", "food"], ["  I didn't want to give a tip.", "service"], ["and the waiter with a bad attitude told me when I paid: hey, the tip is not included here (I think he shouldn't ask for the tip.", "service"], ["unprofessionalism), so I told him no He …", "Service"], ["I really am starting to appreciate this place.", "atmosphere"], [" The staff is always accommodating( I have allergies).", "service"], [" The food is still  very tasty even when they adjust the recipe.", "food"], [" Their ceaser dressing is delicious!", "food"], [" It's the little things they pay attention to that make a big difference!", "Service"], ["Excellent food and excellent service.", "food, service"], ["\nPlace is huge and always crowded.", "atmosphere"], ["\nWas very impressed to come there at first time.", "atmosphere"], ["\nRecommend to everyone to visit and try it", "none"], ["I've been to Cheesecake Factory a total 4 times.", "none"], [" The first 3 times I could not find anything on the expansive menu that caught my attention enough to want it, so I left without ordering anything.", "food"], [" Fourth times a charm right?", "none"], [" Not exactly!", "none"], ["My family and I go to for a great meal.", "food"], [" Food is always great, drink are good.", "food"], [" Friendly wait staff.", "service"], [" The only downside is the wait, n any given day after 6 you wait at least an hour.", "service"], [" Weekend night 2 hour wait.", "none"], [" Sooo we just plan to go early.", "none"], ["Had a great birthday party.", "atmosphere"], [" Food was good.", "food"], ["Delicious food, great waiter and lovely ambiance.", "food"], [" The cheesecake was the best though and can you say deliciously delicious yummy yummiest cake ever.", "food"], ["came here earlier today and had a good experience.", "service"], [" our server was attentive and understanding of us having one person arriving a little late to the group.", "service"], [" she was very on top of it and also had no problem taking our picture.", "service"], ["Kiana was our server and she was an absolute joy and pleasure .", "service"], [" We had an issue with our food coming out to soon ( main course with our appetizer ) and Kiana handled it with the upmost professionalism and courtesy .", "service"], [" She was extremely …", "none"], ["This man violated me and my family today.", "none"], [" He snatched a drink out my mouth; hitting my daughter 9 month daughter with his arm in the process and spilled it on me and my baby.", "none"], [" This has been yet the worst experience I’ve ever had out to eat.", "service"], ["By far the worst cheesecake factory I have ever been to the customer service takes forever they put so much ice you drink that you barely get any drink the food is not satisfactory And the waiter never comes back to check if you need more I …", "service"], ["What can I say it’s cheesecake factory we love their food", "food"], ["Bad service and even worse management.", "service"], ["\nWent to\nDinner with 3 friends, i ordered the korean fried chicken and the server …", "food"], ["FOOD WAS GREAT,IT WAS A BUT OF WAIT.", "food"], ["BUT EVERYTHING WAS DELICIOUS  …", "food"], ["Placed an order yesterday for pickup the only reason I gave two stars was the young lady that was in charge of pick ups was a nice young lady.", "service"], ["  I called to place a pick up order I was told to hold finally when I looked at my phone and 22 …", "service"], ["Horrible service.", "service"], [" He waited for one and a half for getting a table.", "none"], [" When we finally sit, we order the food and they didn’t have what we want (pizza).", "food"], [" We changed the order, they also didn’t have what we wanted.", "food"], [" We make the order.", "food"], ["I was disappointed in the service today.", "service"], [" After our food arrived, I waited almost ten minutes for a drink refill.", "service"], [" If they were swamped, I would understand, but they have limited seating since there aren't enough staff & no one is rushing …", "service"], ["NOT RECOMMENDED.", "none"], [" Walked in at 850p.", "none"], [" Was told we can only be seated at the bar/high tops, meanwhile others are still seated in the other dining area.", "service"], [" The area was full and the greeter could care less to help.", "Service"], [" If you’re open til 10p why do …", "none"], ["The one in Melnopark Mall is really good.", "Location"], [" Service is good despite the crowd.", "service"], [" Food is awesome.", "food"], ["Fantastic food fantastic Place little pricey but worth it", "food"], ["I come here all the time to eat with my husband .", "food"], [" I understand the busy business and I always have to wait for food or even a server to come by .", "service"], [" I never complain believe me I understand .", "none"], ["Was a nice restaurant but they were out of a few food options and the wait was fairly long.", "food"], [" If staffing was an issue that made sense however, our server was amazing which was the only saving grace to our service that evening", "service"], ["I will start off by saying that I didn't like the food at the Cheesecake Factory.", "food"], [" I didn't think the food was anything special.", "food"], [" It might have even been bland.", "food"], [" The cheesecakes were fine though.", "food"], [" The service was fine.", "service"], [" I didn't interact with …", "None"], ["Me & the wife love going to this place.", "none"], [" 80% of the time we order the Crusted Chicken Romano with  Fettuccine in Alfredo sauce.", "food"], [" But this time we were very disappointed.", "none"], [" They gave us stale bread, where the waitress had said it was fresh.", "food"], [" The pasta was wayyyyy over cooked.", "food"], [" Service was still golden but very disappointed about the food.", "food"], ["Food was average.", "food"], [" Dining experience was extremely long!", "service"], [" 15min for drinks to come, 20min for appetizers and by the time the food came we just wanted to wrap it up and go already.", "service"], ["Don’t look at the calories, just enjoy the food", "food"], ["Great food and great service.", "food"], [" I would recommend it.", "none"], ["We ordered for\nAppetizers: Nachos, Tex Mex Eggroll and Dynamite Shrimp …", "food"], ["The food was good, not exceptional, but the main issue is the wait times.", "service"], [" You are unable to make any reservation and for just a table of 2 on multiple occasions our wait times were 50 mins, 75min, and a couple of times they said 90 plus …", "service"], ["Used to lov it but portions r smaller prices higher closed earlier and didn't want to help handicapped  pp.", "Service"], ["i had to get a manager to help seat us.", "service"], [" Need better prices more daily specials  and a happy hour.", "none"], [" Or birthday cake free piece for birthdays.", "food"], ["  Better Italian food .", "food"], [" More low calorie foods for heart healthy diets.", "food"], ["We went for dinner, forks were dirty, we order 2 blue moon (tap) and bartender was using a blender!", "hygiene"], ["\nBeer was pretty bad, also order calamari was ok, but after seen the table and forks dirty and that nasty beer, we paid and left, totally disappointed.", "Hygiene"], ["We have been to this restaurant many times always good until today.", "food"], [" We went to an early Friday dinner about 4pm.", "none"], [" Wasn’t crowded yet so we were seated quick, the hostess was not friendly and pretty abrupt.", "service"], [" We were seated for a while and no …", "Service"], ["Costumer service is awful!", "service"], [" I order only one piece of cake and waited on it 10 min.", "service"], [" Stuff talking and laughing as there is nothing to do.", "atmosphere"], [" Plus, there was not a lot of people so I don't understand why it took so long .", "service"], [" After I asked how long …", "none"], ["No matter what dish the food has always been delicious.", "food"], ["All four of us enjoyed our meals.", "food"], [" The favorite was steak with shrimp scampi.", "food"], [" My bacon-bacon cheeseburger was good.", "food"], [" Dessert was good and generous portions.", "food"], ["  Service was very good even though restaurant was very busy.", "service"], ["Service and food is always great.", "food"], [" Just takes long sometimes to get your food.", "service"], ["The food is always amazing and customer service is top-notch", "food, service"], ["I would certainly give this establishment 0 stars but the lowest I’m allowed to select is 1.", "service"], [" We walked in to this place at 12:30 and were promptly seated by a manager.", "service"], [" We thought “wow great no waiting”.", "none"], [" Guess again!", "food"], [" We then waited and …", "service"], ["Say Cheese :D\n\nCheesecake factory has always been an easy choice for me.", "food"], [" I have tried several …", "food"], ["Very rude service.", "service"], [" Didn’t get greeted at all.", "service"], [" Was looked at and ignored.", "service"], [" Was told “the whole restaurant was sat” meanwhile there was a whole section empty.", "food"], [" Was told that having a stroller out in the middle was a fire hazard meanwhile there …", "none"], ["The Cheesecake is a great Restaurant and the staff is good.", "food"], [" They would be better if they could get the food to the table better.", "service"], [" It was good but not hot to warm.", "food"], [" They also should \"touch\" the table right after the food is presented.", "service"], ["Came here with my son for dinner a few wks ago and had my old favorite sweet corn tamales.", "food"], [" And let me tell you this dish is so simple but hits all the taste buds in your mouth.", "food"], [" It was sweet but hint of salt the pico de gallo was awesome all …", "food"], ["As always I got great service and great food.", "service"], ["Great restaurant, delicious food, waiters are warm and friendly and the cheesecakes are to die for.", "food"], [" The only problem is the wait time.", "service"], [" Last time I was there with my family we had to wait 1 hour and 45 minutes to be seated.", "service"], [" Thankfully there's the mall and Barnes and Nobles next door to pass the time.", "none"], ["We went first thing in the morning at 10:00 a.", "none"], [" no wait for seating.", "none"], [" Pleasant server, delicious fresh food beautiful atmosphere.", "food"], ["The food taste delicious but it is so busy and the employees do not have enough time to take an order so they speak very fast, and rush to take your order.", "service"], [" I appreciate a Steve who told me about the special and took the time take care of my family in the busy weekend.", "service"], ["Food was very good.", "food"], [" The first time I ate at cheesecake factory", "food"], ["Thai wraps were very good.", "food"], [" Calamari was so so, the portion was small, and you could tell they were fried in older oil, ie they should be a light brown color.", "food"], [" Service was good considering shortage within the industry.", "service"], ["My son and I went here for the first time yesterday.", "none"], [" We had never been to any of their places before.", "none"], [" When you walk in it looks impressive.", "atmosphere"], [" When I saw the menu I thought we were in for a nice meal.", "food"], [" I ordered the Teriyaki Chicken with rice.", "food"], ["Believe it or not the experience was pretty good especially for a Friday it was like 40 minutes for a table which wasn’t bad because we walked around the mall and then they text you when your table is ready our server was great very nice place on the inside good vibes good food", "none"], ["The food is always great here.", "food"], [" However, it just annoys me to always wait for so long to get a table.", "service"], [" Even during week days!", "none"], ["\nAlso, the whole lighting is kinda too dim .", "atmosphere"], [" I understand the low light dining style concept, but it is too dim there.", "atmosphere"], [" I like to see the food I'm eating, u know what I mean?", "atmosphere"], ["Cheesecake factory was good.", "food"], ["  Pork chop was small portion and not too tasty, kinda bland.", "food"], [" Mashed potatoes nothing special, same as any other restaurants.", "food"], ["  My girlfriend's tuna salad was nice but also a small portion.", "food"], [" Wait was not bad, fifteen minutes for 2 people during prime dinner time.", "none"], [" Would go again but try something different.", "none"], ["I went for my bday, asked for a table or set of to accommodate my family.", "none"], [" There were 10 (2 of which were children) was told we would have to be split up after 5 people and the tables could not be near each other.", "service"], [" I saw people sitting 5-7 @ table.", "none"], [" Not sure what the managers problem was, but I'll skip this place from now on.", "service"], ["My husband and I enjoy eating here.", "food"], [" Everything tastes delicious, from the appetizers to main dish and of course can't leave out desert.", "food"], [" Govida cheesecake .", "food"], ["  We can't leave behind the service and server.", "service"], [" Very nice and attentive.", "service"], ["Went for dinner on a Sunday evening.", "none"], [" Ordered Avocado egg rolls for appetizer which was good however the main course ruined everything.", "food"], [" We ordered Fettuccine Alfredo pasta and it was uncooked.", "food"], [" And yes, I can tell the difference between Al …", "None"], ["Always enjoy the service the food and good company.", "food"], ["The restaurant was very large and fancy.", "atmosphere"], [" The cheesecakes were very good!", "food"], [" But the restaurant was not so hygienic and the waiter was mixing the orders.", "hygiene"], [" Needs some more improvements.", "none"], ["Rude manager at Take out/dessert area.", "service"], ["  The left me standing there for 5 minutes and he did not even acknowledge me.", "service"], ["  What kind of trash people are they forced to hire!", "None"], ["  I will not be back.", "None"], ["  Piece of trash place ruined my night.", "none"], ["The first person that we came in contact with at the front desk was The Worst.", "service"], [" She has a horrible attitude, she rushed us and when I asked for a different seat she huffed, when we got to the new seat she threw the menu on the table and …", "service"], ["Nothing like sitting down with your party of four and seeing that the bread basket is half empty and you all look at eachother awkwardly and say I think this is a half eaten basket from another table.", "food"], [" Then later come to find out they are …", "none"], ["07/30/2021 - (3 stars) I always appreciate when a business responds to their customer's complaints, shows that they care so I am increasing the rating because of this.", "service"], [" I'll definitely come back to give it another go.", "none"], ["Hugh shout out to Manager Sarah and Bartender/ waiter Jason!", "service"], ["\nCheesecake factory food speaks for itself and does not disappoint, ever!", "food"], ["\nBut the icing on the cake was the ‘personal touch’ from bartender/ server …", "service"], ["This was the first time I was ever at a Cheesecake Factory.", "food"], [" Let me tell you it was great!", "none"], [" Our waitress Nancy was wonderful.", "service"], [" We had the buffalo blasts appetizer and they were good.", "food"], [" The chicken madeira was so yummy.", "food"], [" And for dessert you can't …", "food"], ["a middle aged blonde white woman was very rude when i came to visit with my friend.", "service"], [" we were waiting to be seated and she gestured to care of other guests when we were standing right in front of her, she could’ve just said excuse me.", "service"], ["Pretty pricey, but the atmosphere is excellent and the staff were very nice!", "atmosphere"], [" The food was absolutely, positively delicious.", "food"], [" If you like Italian, this is definitely a solid choice.", "food"], ["  Furthermore, a place called \"the Cheesecake factory,\" …", "food"], [" Horrible service by young kids who just don’t care.", "service"], [" Food quality has decreased throughout the years.", "food"], [" I would go somewhere else for the price you pay which is not cheap.", "none"], [" I would recommend save the time and find a new place to get …", "none"], ["The wait time at 1pm was 35 minutes.", "none"], [" Half of the restaurant was empty.", "atmosphere"], [" Our waiter was very good.", "service"], [" My Steak was cooked a little over but still o.", "food"], ["Beautiful place the waiter was very friendly as well.", "atmosphere"], [" and if you are ever in dubai check them out as well at the dubai mall", "location"], ["I love bringing my family to the Edison/Menlo Park location.", "location"], [" The food is delicious with large portions, making it perfect for dinner and perhaps lunch the following day.", "food"], [" The staff is extremely on point with service and knowledge of the …", "service"], ["This is my all time favorite place to go, the wait times to dine in is longer on the weekends but it's well worth the wait.", "atmosphere"], [" Our last waiter was very friendly & efficient, we had our food almost immediately & you can never go wrong with their cheesecakes  I've never had a bad meal from there, it's well worth the money.", "food"], ["My family and I were seated for 20+ minutes and not one waiter or waitress came to greet us .", "service"], [" I’ve would of been fine if someone came to our table saying they were short staff it may be a while.", "service"], [" Worst customer service ever!", "service"], [" We ended up …", "none"], ["The wait was beyond extensive.", "service"], [" A 40 min wait went over an hour and the kitchen was backed up resulting in two bread placements at our table.", "service"], [" That said, the food was great and our service was outstanding.", "food"], [" Maybe avoid a Saturday night during the Christmas/NYE week but otherwise this Factory is great.", "none"], ["Worst experience going to eat here on valentines Day weekend.", "service"], [" This was my first time ever visiting this place and will be my last.", "none"], [" I waited over an hour for a table only to be told that I was called Over an hour ago.", "service"], [" I wasn’t because the …", "none"], ["Having worst dinner ever.", "food"], [" Bad evening started with the worst looks from the receptionist.", "service"], [" She told 30 minutes wait time and we had to wait for an hour.", "service"], ["  We ordered drinks and host had a look as if we ordered water.", "service"], [" Everyone has worst attitude!", "service"], [" Messed my order and we had to wait another 30 minutes!", "service"], [" Never visiting again!", "service"], ["Food was great, hosts are friendly.", "food"], [" Servers seem a bit overwhelmed and some steps of service were missed, like a proper greet, utensils, straws, was presented a check without a checkbook.", "service"], [" The food and the patio seating saved the rating.", "food"], ["We've been frequent customers over the years, but during our most recent visit things went downhill from the moment we sat down.", "Service"], ["  After ordering a 7 & 7, I was told they had no Seagram's.", "food"], [" Then 10 minutes after ordering the fried mac & …", "food"], ["It's variaty taste in food", "food"], ["Everything that I have tried there, (food, drinks, desserts) were delicious!", "food"], ["As always great food and awesome drinks.", "food"], [" Our server Rob was the best.", "service"], ["Well, it's the Cheesecake Factory, so you pretty much  already know what to expect.", "food"], [" The food was really good, but the service was a little iffy.", "food"], [" Waitress wasn't as attentive to us as we'd hoped.", "service"], [" We still left a  decent tip, and still had a …", "service"], ["Best Restaurant I've been to in a long time.", "none"], [" Mu husband took me here for Valentine's day and the wait wasn't horribly long.", "service"], [" Staff was friendly.", "service"], [" They have lots of  different dishes on the  menus to try.", "food"], [" I liked the atmosphere and ambiance.", "atmosphere"], [" Recommended", "none"], ["Saw online that they had lunch specials and wanted to check it out - I have been to this location numerous times before, but this review will solely be based on my time today!", "none"], ["Love the food and what made it feel super good was the waiter!", "food, service"], [" Even when the chicken of the dish I ordered was missing, that was some Super Customer Service Experience.", "service"], [" Yeah, the food and drinks super good!", "food"], ["The only delicious thing in that restaurant is their cheesecakes (some not all).", "food"], [" I ordered a burger sandwich, meat was dry and the sandwich was very small for the price ( almost 15 dollars).", "food"], [" The lights were dim, one  couldn't see if the meat was well done or medium rare , maybe it was done on purpose  …", "atmosphere"], ["I've always had friendly waiters and waitresses at this location.", "service"], [" The last time I had lunch with my family they took longer to get one of our entrees out.", "service"], [" The manager came to our table and made sure to let us know they were working on …", "service"], ["I only took 1 point away because my dates food was not that great.", "food"], [" My food was awesome.", "food"], [" The cheesecake was delicious!", "food"], ["*My review is not based on the location* Had my first Cheesecake Factory meal ever.", "food"], [" nothing much to say except it was regular American food.", "food"], [" I'm assuming this is generally what the food tastes like at any Cheesecake Factory location.", "food"], ["Standard fare, large portions, reasonable prices.", "food"], [" If you like cheesecake, your choices are many.", "food"], [" I prefer carrot cake, which is excellent.", "food"], ["  Restaurant is noisy and the wait is sometimes unreasonable (1.", "atmosphere"], ["  Overall, if you have the …", "none"], ["The cheesecake factory is one of the few restaurants I visit regularly.", "food"], [" The wait can be unbearable at times, but the food and service are always worth it.", "service"], ["Busy place.", "atmosphere"], [" The food was great.", "food"], [" The staff was nice.", "service"], [" A little noisy for me.", "atmosphere"], ["Needless to say, one of the best cheesecake places on earth!", "food"], [" If you have not eaten there, you're missing a lot!", "food"], [" A huge collection of no less than superbe cheesecakes is offered.", "food"], [" Whether you're a chocolate person, an original cheesecake fan, …", "food"], ["We love the food but I will never take out from there again.", "food"], [" I called in a takeout order on Sunday at 3pm to be picked up at 4:30 because I knew how busy they get.", "none"], [" I was told it would be ready when I got there which I did promptly at 4:30.", "service"], ["After them dropping one of our main course dishes.", "service"], ["the one dish got cold as my partner waited for my meal was being made again.", "food"], ["and we still paid full price for the whole meal.", "none"], ["  I think we should have been offered a discount for the 20 minute inconvenience after they dropped our first dinner.", "service"], ["My only complaint about Cheesecake Factory is that the menu is too big!", "none"], [" Besides that I've always enjoyed my meal.", "food"], [" Always enjoyed the service.", "service"], [" Absolutely love love love the complimentary wheat bread, it's super dark and has a sweetish taste.", "food"], ["I usually refrain from writing negative reviews, but my last visit to this restaurant was more than unpleasant.", "none"], [" While taking a bite of their bread, I felt something hard crack as I chewed.", "food"], [" At first, I thought it was the nuts/grains on the …", "food"], ["We have a good time.", "atmosphere"], [" Nice  service.", "service"], [" Very friendly people.", "service"], [" Good food, also I like the inside decoration, We have to wait some time for a table, because was very busy, too many people like this restaurant, another good  thing that it is a few steps  to the mall,  …", "Food"], ["The cheesecake and the decor is the highlight of this restaurant and the staff were friendly and quick.", "food, atmosphere, service"], [" The selection of food is huge, but quality is okay.", "food"], [" I had a medium-rare burger with sweet potato fries.", "food"], [" The burger was overcooked and …", "food"], ["Reasonable in everything but not outstanding.", "none"], [" It is a clean place.", "hygiene"], [" Services are relatively subpar.", "service"], ["\nRevisited today for lunch at 11:30.", "none"], ["  When we walked in there was no one waiting …", "service"], ["Good food good drinks  too crowded", "Atmosphere"], ["Had to give it 1 star because the waiter was so bad.", "service"], [" Will definitely not be coming back.", "none"], [" This was the second time having a poor experience here.", "service"], [" I believe the waiter was Chris, and he was not attentive.", "service"], [" In fact, when we say down he asked if …", "none"], ["I would've given 3 stars, but I didn't because I have something to say to the wait staff, \"why so freaking tense?", "service"], [" Please take the proverbial stick out and lighten up.", "none"], ["when you go to the back, is your manager flogging you?", "none"], ["Great food, service could have been better.", "food"], [" Server had a bit of an attitude and was barely around to assist us and take our order.", "service"], [" One of our to-go orders for cake was messed up as well (I’m not sure if this was the server’s fault or someone in the kitchen’s fault, though).", "service"], [" Food was awesome, as always.", "food"], ["My twin sister and I had a day out together.", "none"], ["  Our first stop as always was to go eat at the cheesecake factory.", "food"], [" We had a great waiter named Juan.", "service"], [" Very attended to us, kept checking in to seen if we needed anything.", "service"], ["   He was very friendly …", "service"], ["Great food a variety of all kinds designed really beautifull", "food"], ["Just ordered a slice of cheesecake.", "food"], ["  Enjoyed it.", "none"], ["First time trying Cheesecake Factory with some friends & we got a server named mike.", "service"], [" Ordered appetizers which came out a decent time.", "food"], [" My friend ordered a cocktail & she couldn’t taste any alcohol after telling our server about it his …", "service"], ["We came at 4:45 and were told it would be a 5 minute wait.", "service"], ["  Half the restaurant was empty but we waited.", "none"], ["  10 minutes later I asked if it was going to be much longer and was told they were short staffed and didn’t have enough busboys.", "service"], ["The service was good, however, the food did not meet Cheese cake Factory standard.", "food"], [" The prices is to high to not give the quality of taste and presentation.", "food"], ["Food was very good.", "food"], [" The lunch potion of the Chinese chicken salad was huge.", "food"], [" Mike our server was awesome.", "service"], [" Super friendly and attentive.", "service"], ["I ordered a meatloaf dish, and it tasted very good.", "Food"], [" The wait staff was very attentive, but when I got my coffee the glass felt and looked dirty.", "hygiene"], [" When I got home I ended up vomiting, not sure I'll be going back.", "hygiene"], ["Good food, but overpriced.", "food"], ["\nBut I keep going back.", "none"], ["Steaks were horrible.", "food"], ["grizzle all over ribeye with pieces torn off and burnt  mashed potatoes were cold.", "food"], ["  Filet mignon was way over cooked dry and burnt around edges.", "food"], ["  The fettucine alfredo with grilled chicken was good but the grilled …", "food"], ["Its a Cheesecake Factory.", "food"], [" What can I say haha.", "none"], [" Huge menu, great atmosphere, incredible desserts, and awesome drinks.", "food"], ["  Ive celebrated Birthdays, Anniversaries, business meetings and more.", "none"], ["  They really have the management of turning tables …", "None"], ["Would give zero stars if I could.", "service"], [" Food was absolutely tasteless.", "food"], [" We used to go to this restaurant all the time.", "none"], [" We loved it.", "none"], [" Now, the food is just terrible.", "food"], [" I got the cajun chicken littles.", "food"], [" Littles is right because they were so tiny and …", "food"], ["Food was great.", "food"], ["Very crowded but that's to be expected on a weekend, The cheesecake is fantastic I always have trouble deciding which one to get", "food"], ["Really enjoyed the chicken taco lettuce wrap.", "food"], [" appreciated the server who was attentive and generous with her time since she allowed my seldom seen lifelong friend to sit, chat, and catch up.", "service"], ["Great service, drinks and dessert but the food was a bit off today except for apps and burger.", "food"], [" Twice my son's steak dish was burnt.", "food"], [" It was taken off the bill.", "none"], [" Lasagna Verde was mushy layers of sheet pasta with cheese that was like paste.", "food"], [" Did not care for this dish or the sauce.", "food"], ["The food has always been delicious when my family and I have come here.", "food"], [" The one thing that got us today and ruined the experience was when they told us we had to wait for 3 hours to be seated for a group of 7.", "service"], [" It's disappointing that a …", "None"], ["Very poor service today.", "service"], [" Went for a pick up order and it was 30 minutes late.", "service"], [" Asked the workers to speak to manager on duty and she completely blew me off.", "service"], [" Made me extremely late for a work appointment and will never do this again for large orders at work.", "Transportation"], ["I use to LOVE this place, like really LOVE this place, but tonight changed that.", "service"], [" The wait was a hour and half long, which was expected so I was okay with that.", "none"], [" Once we got to our table, it was freezing in that section!", "atmosphere"], [" The waitress looked …", "service"], ["Just left the cheesecal factory.", "food"], [" Server was nice.", "service"], [" Food was ok and very over priced.", "food"], [" Very hot and uncomfortable.", "atmosphere"], [" We waited very long for everything, drinks, apps, main course and desert.", "service"], [" Will never go back to that location again.", "Location"], ["Birthday dinner, not my choice of venue.", "none"], [" One experience before was pretty good, however.", "none"], [" Tonight not so much.", "none"], [" Lighting so dim some folks used cell phone flashlights to see menus.", "atmosphere"], [" 40 minute wait for food that was not particularly involved to …", "food"], ["A1 service and food.", "food, service"], [" Will be coming back again", "none"], ["Someone should call the health inspector.", "hygiene"], [" This place is becoming so disgusting.", "hygiene"], [" The service is slow and i understand that but then even the food they serve is disgusting.", "food"], [" I took my mom their for the first time to treat her and we ordered …", "food"], ["I'm a devout fan of this place.", "none"], [" The food is great (portions are very large, always need a to-go plate), the drinks are very good, and depending on the time of day, the service can range from excellent to fair.", "food"], [" Weekends during the evening …", "atmosphere"], [" Seriously, the best food, pricey, BUT SO WORTH IT.", "food"], [" Also, the cheesecakes are amazing.", "food"], [" I can never get enough of this place.", "none"], [" The staff is always so nice, the overall ambiance of the restaurant is just calming and relaxing, very family friendly.", "atmosphere"], [" Place is clean and well organized.", "hygiene"], [" Highly recommend this place!", "none"], ["Very bad experience\nMenlo location …", "none"], ["Love this spot.", "atmosphere"], [" It is easy to get to.", "transportation"], [" Sunday afternoon parking was hard to find during the December holiday shopping season.", "parking"], [" The service at this particular cheesecake factory was great.", "service"], [" Quick and friendly.", "service"], [" I enjoyed my time there.", "atmosphere"], ["My daughter was there last Wednesday fir her birthday, she ordered Thai chicken pasta.", "food"], [" She brought home almost all of it.", "none"], [" That was the most tasteless dish I’ve ever had it was hard and dry no taste at all, it’s still in the fridge have to throw out no wants to eat it.", "food"], [" You guys need to work on that dish.", "food"], [" SERIOUSLY!", "None"], ["Food was great long wait however and the drinks we ordered came out with different “strengths “ every time (either too much alcohol or not enough)", "Service"], ["My wife, myself and my wife’s three brothers were meeting at the Cheesecake Factory for dinner.", "none"], [" Due to traffic we did not all arrive at the same time.", "transportation"], [" My brother in law got there first and the manager was so kind to hold a circular booth …", "service"], ["Definitely delicious !", "food"], ["Waited about 1hr but worth it.", "none"], [" Food excellent  had the hibachi steak with wasbi mash potatos.", "food"], [" The potatos have a kick so make sure you have water.", "food"], [" No rush spent 2 hrs between appetizer, meal and desert.", "food"], [" Felt safe spread out between tables and booths.", "atmosphere"], [" It's worth the trip and wait.", "none"], ["Great food selection.", "food"], [" Awesome drinks.", "food"], [" Good servers.", "service"], [" Reasonable prices.", "none"], [" I just don’t like waiting 30-45 mins to dine-in.", "none"], [" This restaurant gets overcrowded and chattery can become overwhelming, which ruins the dining experience.", "atmosphere"], [" Some tables are small and right next to other other people dining so privacy for conversation is limited.", "atmosphere"], ["I give two stars because the food is great.", "food"], [" Service is HORRIBLE!", "service"], [" Took my family 40min.", "transportation"], [" to be called; an additional 35 minutes for our table to actually be ready.", "service"], [" 20 minutes to order our drinks and get bread.", "service"], [" Almost an hour to get our …", "service"], ["I always order from this place for delivery and I always order a dish with a protein.", "food"], [" I've been ordering from this place frequently for about 3 years and their consistency is very inconsistent.", "none"], [" Sometimes the chicken is chewy, sometimes it's …", "food"], ["Not bad food, lots of variety, especially with cheesecakes, hosts are a lil oblivious & service took a lil longer then usual, over all good family spot", "food"], ["Fair warning: This is usually a very busy restaurant!", "atmosphere"], ["\nHowever, their food is great.", "food"], [" I would recommend the Chicken Farfalle if you would like to stop by.", "food"], [" The Soup of the Day is often great as well, and there are …", "food"], ["Had such a good time with a party of five tonight.", "atmosphere"], [" Food was out quickly and our service was spot on!", "service"], [" Thank you to our waiter Carlos for making our night so fun and special, he took great care of us!", "service"], ["Great customer service, great food and a lot of sugar", "food"], ["Unfortunately we had to get moved due to a family with an offensive odor.", "hygiene"], [" (Not cheesecake factory fault).", "none"], [" Kindly requested to be moved because the smell was too much.", "hygiene"], [" The food was ordered well in advance.", "food"], [" We sat another 20 minutes after …", "service"], [" For me the atmosphere is not that great.", "atmosphere"], [" I feel like I'm in a train station or some transient spot.", "atmosphere"], [" I don't feel it's a spot to bring the family or to really watch a game, or to have some drinks.", "atmosphere"], [" The menu is just too large and …", "food"], ["The cheesecake was excellent, Korean cauliflower normally do great but this time a little soggy not crisp and hot, felt rushed when paying, and atmosphere was great  …", "food"], ["Beautiful place.", "atmosphere"], [" Didn't eat here because it was a 70 to 90 minute wait but we did purchase some good red velvet cheesecake.", "food"], ["Food was superb.", "food"], [" They catered to my grandchild and quite frankly to all of us.", "service"], ["  Drinks were delish,  mail tai and mojitos.", "food"], ["   Didn't rush us.", "Service"], ["  Thank you for taking great care of us!", "service"], ["Social distancing protocols were taken and we felt very comfortable.", "hygiene"], [" Food and drinks were great, as usual.", "food"], [" Restaurant was not taking reservations, but wait time to be seated was better than pre-Covid.", "none"], [" Staff was very accommodating.", "service"], ["This is definitely recommended if you like to try different type of foods and their famous  cheesecake definitely going there for dinner and brunch.", "food"], ["The worst experience ever!", "Service"], [" We came from SC and decided to eat in one of the best restaurant we knew so far, We had eaten in different Cheesecakes among the country and so far this was the worst ever.", "food"], [" We had to wait for 20 min until we …", "service"], ["Really good service and food.", "food"], ["Best food ever!", "food"], [" Everything is fresh.", "food"], [" And these corn tamales were BOMB!", "food"], ["Was told after 30 minutes waiting,  that we would have to wait even longer if we wanted a high chair , because we couldn't have one at a booth!", "service"], [" The food took an hour to come and my sisters food was undecooked , she had asked for well done …", "food"], ["I ordered 2 slices of cheesecake for pickup.", "food"], [" I was asked to wait for a text to come pick up my order.", "none"], [" Didn't get a text for over an hour.", "none"], [" You mean to tell me I can't get 2 slices of cheesecake for over an hour.", "food"], ["I love this place!", "atmosphere"], [" Every time I come I’m happy.", "atmosphere"], [" The food is amazing (Jamaican black pepper shrimp and raspberry lemonade with the chocolate bread) and service is always top notch.", "food"], [" The wait on weekend nights really sucks, sometimes over an hour so be prepared and don’t come too hungry.", "food"], [" But still very good.", "none"], ["Food and server was good, but the other wait staff needs improvement.", "Service"], [" I sat in a booth at the end of the aisle and they had a silverware container behind my head when I turned it almost hit me in the eye.", "hygiene"], [" The other staff also congregated around this area and used foul language and talked about plans to party after work.", "Atmosphere"], ["Great food selection, big portions.", "food"], [" Service lacking, they need more help.", "service"], [" We waited longer than normal for food, but overall I would go back.", "Service"], ["I will never step foot in this place again.", "none"], [" The men's room was disgusting.", "hygiene"], [" Every garbage can was over flowing on to the floor.", "hygiene"], [" Apps came out 20 mins before our drinks.", "service"], [" Our meal came out after an hour wait.", "service"], [" Only to be incorrect and incomplete.", "none"], [" Its one thing to be busy, its a whole other to be incompetent.", "service"], ["To God Be All The Glory.", "none"], ["  I asked about a promo when purchasing a cheese cake.", "food"], [" I asked to speak to a manager to help me.", "service"], ["  The manager stated we are not talking reservations for Mothers day.", "service"], ["  I was leaving a customer asked me if they could …", "service"], ["Food is good but service always sucks.", "service"], [" i come in the restaurant and all the hostess are giving the back to the door just talking amongst them, had to ask 2 different people to be seated.", "service"], ["  When my food order arrived i ordered two more drinks finish eating and drinks never arrived and my server was nowhere to be found.", "service"], ["Ah, Cheesecake Factory - one of the most overrated, disappointing places I've been to or ordered from.", "food"], [" It's got a great menu.", "food"], [" I've been to other ones, and loved the food.", "food"], [" Well, the food was disappointing, to say the least.", "food"], ["The food is great, but don't bother trying to order to-go.", "food"], ["  They let the phone ring dozens and dozens of times.", "service"], ["  I'm actually sitting here on speaker phone for now 6.", "none"], ["5 minutes while I wait to be answered (not even on hold, the phone is just …", "service"], ["It is a great place to go if you're REALLY hungry.", "food"], [" All plates are humungous and very very tasty.", "food"], [" The variety of cheesecakes is to dream of, and yes, the pieces they'll serve will NOT leave you wanting more.", "food"], ["  Prices are ok, considering the …", "none"], ["Four stars only because I didn’t see a low sodium option.", "food"], [" Friday night 7:PM and seated immediately by very friendly staff - nice.", "service"], [" My family claims they had a good time and a good meal.", "food"], [" I chose to leave since I couldn’t find a low salt …", "food"], ["ERIC WAS AMAZING.", "service"], [" It was my very first hour in NJ but he made me feel right at home.", "Atmosphere"], [" The food was great and Eric's attentiveness to our table was everything.", "food"], ["Waiter was friendly but not attentive at all.", "service"], [" I went today for lunch with my husband and kids.", "none"], [" Wasn't very busy and my husbands food came 20 minutes after everyone else's he ordered a burger.", "service"], [" we also waited 40 minutes for him to bring the check.", "service"], [" The food was pretty good but the experience wasn't very pleasant", "atmosphere"], ["I hadn't been here in a while, but the food is consistently great.", "food"], [" We had the lynch portions of the chicken Romano and the chicken piccata.", "food"], [" Both were excellent !", "food"], [" We had the salted caramel cheesecake, which was delicious !", "food"], [" Sort of a cross …", "none"], ["Team I know we on a rush and a pandemic matter also please close attention detail detail.", "hygiene"], [" Detail order placed white rice chicken bang bang instead for home and ate brown rice chicken bang bang not to also mention shrimps the poop membrane …", "food"], ["Just want to share menu options are so many.", "food"], ["a lot to choose just take a look before arrive to place.", "location"], ["The food was really good but the service was really slow waited about 45 minutes for our food and we had the manager to check on it.", "service"], [" Also had to ask the waiter to bring me another because he never asked if I wanted a refill.", "service"], [" Don't think I will be back.", "none"], ["Had a horrible experience yesterday at that place\nI came with my family to enjoy the food my son ordered shrimp tacos and he got fish tacos my son didn’t recognize the fish and I recognised after he ate two …", "food"], ["Disappointed went on a Monday evening.", "none"], ["  We ordered the lemon crusted roasted chicken with mash potatoes.", "food"], ["  The chicken was rubbery.", "food"], ["  The sauce did not taste like lemon.", "food"], ["  My husband & were so upset.", "none"], ["  My husband refused to complain.", "none"], ["  We boxed it & left.", "none"], ["  Not to mention we were out of $75.", "none"], ["  Not worth it.", "none"], ["  Never again.", "none"], [" The service was ok.", "service"], ["The waiter was very friendly.", "service"], ["The food came to our table pretty quickly and it was hot.", "food"], ["Portions were very generous and it was delicious.", "food"], ["Definitely worth a visit.", "none"], ["I absolutely adore this place.", "atmosphere"], [" The food is always spectacular!", "food"], ["\nNo wait on most weekdays like a Tuesday in the afternoon.", "none"], ["Unfortunately despite the hype I was highly disappointed by the food here.", "food"], ["  Although the selection is wonderful, much like buffets when you are offering hundreds of dishes your never really great at any of them.", "food"], ["  The Alfredo was watery and …", "food"], ["Overrated at this point.", "none"], [" Half hour wait to be seated.", "service"], [" Half hour at least to get my food once ordered.", "service"], [" Waiter disappeared for a while.", "service"], [" Food was just not as good as it used to be and it's kind of expensive.", "food"], ["  Not a bad place, but just no longer one of my favorites.", "none"], ["Using long island branches as a base of comparison, this branch is spacious and good service.", "atmosphere"], [" Nearby Barnes and nobles makes for a great waiting area.", "location"], ["This place is always so clean, friendly and inviting.", "hygiene"], [" Sometimes the wait can be crazy but if you get there at a good time its worth it.", "service"], [" The food was good and the cheesecakes were even better!", "food"], [" They give you huge portions so go when youre really hungry.", "food"], ["For how much money you spend on a typical meal here for pick up, they could at least remember to give you a fork/knife etc.", "service"], [" Also they choose not to pick up the phone for pickup even if they are just standing around and doing nothing, I've …", "service"], ["Cheesecake Factory at Menlo Park, Edison NJ.", "Location"], [" This is our 'go to place' for family birthday dinners, especially when with tweens.", "atmosphere"], [" We ordered a variety of appetizers, soup and salads.", "Food"], [" All but one of us had salmon dinner, though prepared …", "food"], ["I am a longtime lover of the Cheesecake Factory, but the establishment.", "food"], [" In Edison fall far below what I have come to expect.", "none"], [" My family and I went to this restaurant for a family dinner and the food was cold, over cooked and frankly not …", "food"], ["Listen up: Extremely dissatisfied not only by wait time for pick up that was ready, but by LACK of social distancing.", "hygiene"], [" I tried waiting at a distance for my own safety and people kept cutting in front of me.", "none"], [" I waited for about 15 min for my …", "service"], ["Lightning fast service!", "service"], ["  The bread and drinks came out only a few minutes after we sat down, and lunch was served within 10 minutes.", "service"], ["  Absolutely loved the raspberry lemonade, very tart and refreshing.", "food"], ["  The sliders were cooked just right …", "food"], [" Our server was great but the hostess desk was extremely rude, both times I approached.", "service"], [" The kitchen was so far behind, that our appetizer showed up AFTER our main course.", "Service"], [" It took, literally, 15 minutes for our ONE  piece of cake to …", "food"], ["\nI am regular customer there but now Cheesecake Factory has lost me as a customer because a roach crawled out to me at the bar counter.", "hygiene"], [" I was in the middle of …", "none"], [" Long waiting list.", "service"], ["  Really slow customer service.", "service"], ["  Two pieces of bread.", "food"], [" Cold gross food.", "food"], [" Entrees come out before apps.", "None"], [" Cheesecake is not worth all that.", "food"], ["This place is always packed, especially on the weekends!", "atmosphere"], [" I usually come here for breakfast or Sun brunch, but my dinner experience was really good.", "food"], [" I had the Teriyaki chicken and it was gooood!", "food"], [" The mango salsa they put on the side gave it …", "food"], ["I had to go here on a business trip and the waiter took forever for everything.", "service"], [" When we got the food the plates were hot meaning it was under the heating lamp for too long.", "Hygiene"], [" When I tell you it took long, appetizer was 14 minutes and lunch …", "service"], ["Was a total waste of time and money.", "none"], [" Went on a Friday evening and had food with wife and son.", "food"], [" My wife pasta was half done and waiter took her food and said he would bring fresh batch but it came back out tasting exactly like the previous …", "food"], ["I always get chicken Romano and today it was not up to par.", "food"], [" It was dry with not enough sauce.", "food"], [" I would have asked for more sauce, however the server did a disappearing act .", "Service"], ["Jamaican jerked shrimp and the meatloaf dinner are on the money!", "food"], ["The waitress, Danielle, was very attentive to my co-worker and I, we came on our hour lunch break and we were in and out before the hour was up.", "Service"], [" The bread was nice and hot and the food hit the spot.", "food"], [" I would come here more often if I had great service like Danielle.", "service"], [" She is the real mvp in my eyes!", "none"], ["The service was fantastic.", "service"], [" We waited only ten minutes to get a table.", "none"], [" I had the chicken terayki and white rice with a amazing salsa with bean sprouts sliced onions and edame .", "food"], [" It melted in your mouth the flavors where magnificent.", "Food"], ["If one is seeking culinary variety, then the deep menu selection at the Cheesecake Factory reminds one of a diner menu, but more mainstream.", "food"], [" The desserts are wonderful and service always seems friendly.", "food, service"], [" If an item is not prepared to your …", "food"], ["The food and drinks are good for the most part.", "food"], [" Most disappointing is the service and lack of friendly hostesses.", "service"], [" Bartender was great.", "service"], ["Very popular dining spot at the mall, but the hosts are well-trained and efficient so waiting times are reasonable, about 5 minutes at 1 p.", "service"], [" on Saturday to seat that party of 2.", "none"], [" A long menu offers lots of creative and appealing dishes, but …", "food"], ["Food was good.", "food"], [" Got something from the breakfast menu.", "food"], [" Was pretty busy around 11:30am on a Saturday, however by the time I left there was a long line of people coming in.", "atmosphere"], ["A little pricy, but the menu is huge.", "food"], [" If you can't find something you enjoy it might not exist.", "food"], [" The drink list is solid too.", "food"], [" The mojito I had was delicious.", "food"], ["Food is good (try the shepherd's pie), but they are overpriced.", "food"], [" The atmosphere is abysmal, being there feels like you're in a big mall or a busy airport rather than a pleasant dinner night out.", "atmosphere"], [" Service was punctual, efficient, friendly, and …", "service"], ["I'd give about three and a half stars were it an option.", "none"], [" There's a reason these started popping up all over the place.", "none"], [" The food is tasty and the list of cheesecakes is insanely long.", "food"], [" I'm pretty picky about chain restaurants, but The …", "food"], ["Seriously, how many items can you squeeze into a single menu?", "food"], [" Way too many menu items.", "food"], [" Even my 14 year old son was shocked with the menu.", "food"], [" Food was under par.", "food"], [" Service was not there.", "service"], [" The new normal during post pandemic rush.", "none"], ["Inexpensive with big portions, but it's usually busy with wait times from 30 minutes to 2 hours.", "service"], [" I've had my meal served cold twice, which was off putting.", "food"], ["Went on a busy Saturday so I can understand waiting a few extra mutes for food.", "food"], [" Waited 20 extra minutes and while the employees were nice, it took 5 extra minutes to find my slice of cheescake.", "service"], [" Customers literally against your back hovering …", "atmosphere"], ["Wonderful experience!", "none"], [" Usually it's very crowded but it was delightful today!", "atmosphere"], [" The food was also excellent and great service!", "food"], [" Would definitely recommend coming around 2!", "none"], ["Unfortunately the service today was a big let down.", "service"], [" We were seated at the bar area (which I did not request but didn’t mind much) After being seated we waited 30 minutes and  NO ONE came to the table to even get our drinks.", "service"], [" My husband …", "none"], ["Great food, great service!", "food, service"], [" The only thing unfortunately spoiled the experience was the women bathroom was atrocious No toilet paper in any of the stalls.", "hygiene"], [" The middle stall was over flowing with toilet paper , urine on floor on toilet seat!", "hygiene"], ["This is one of my favorite restaurant at Menlo Mall.", "location"], [" I like the cheesecakes and all the variety of dishes and drinks offered there.", "food"], [" My favorite Mai Tai and Grilled Salmon with veggies.", "food"], [" This place is always crowded, you may have to wait a …", "Atmosphere"], ["Post COVID, Cheescake Factory is just not the same.", "atmosphere"], [" Not sure if this affects all locations or just here - place seems understaffed.", "service"], [" Food was bland.", "food"], [" Drinks had very little alcohol.", "food"], [" Waitress did what she could to keep us happy and I appreciate that -- but I feel like management needs to step it up a little.", "service"], ["Sat down and ordered drinks, appetizers and main course.", "food"], [" Appetizers came out after 10 minutes.", "service"], ["no sign of drinks or napkins.", "none"], [" Table next to us sat down after us and was served their drinks and bread.", "service"], [" No sign of our drinks.", "service"], [" Do not order the …", "food"], ["Posting this as a part 2 of my original review.", "none"], [" Today I went for brunch and was welcomed by an incredibly pleasant, customer centric employee by the name of Dayquan.", "service"], [" He is the definition of what customer service and client experience should …", "service"], ["Always on point great restaurant.", "Atmosphere"], ["CURBSIDE TO GO IS THE WORST.", "service"], [" I waited an\nHour to get my food.", "service"], [" When I was told a time that it would be ready.", "none"], [" Don’t choose curbside …", "parking"], ["Excellent service.", "service"], [" Prompt seated ordered my face, crispy chicken with pineapple no shrimp.", "food"], ["Went for brunch.", "food"], [" The food was good but service was so slow!", "service"], [" Half the restaurant was empty so I don't see why it took 45 for our food to come out.", "service"], [" Also some of the plates were dirty - had visible crumbs on them.", "hygiene"], [" Thinking they left the same bread plates on the table from the people before us.", "hygiene"], ["First time visit for both my daughter and myself.", "none"], [" Went on a Monday afternoon abd were seated quickly.", "service"], [" Our server was phenomenal and the food was delicious.", "food"], [" I enjoyed the chicken with truffle honey and my daughter loved her cheddar stuffed …", "food"], ["Let me start by saying I do not write negative reviews and I am a huge fan of the Cheesecake Factory for more than a decade but this location needs to be completely overhauled.", "atmosphere"], [" I have been here on numerous occasions and have run the gamut …", "none"], ["Came last night at 9pm.", "none"], [" Seated pretty quickly.", "none"], [" I went to use the bathroom before getting settled and not one stall had any toilet paper.", "hygiene"], [" People started using paper towels and clogging the toilets.", "none"], [" Thankful that I had tissues in my purse.", "none"], ["The food was great, the staff was professional & jovial.", "food"], [" However, the wait for our dinner was tad long.", "service"], [" It was a busy evening.", "atmosphere"], ["\nWe enjoyed our evening out nonetheless.", "atmosphere"], ["Great food with great company makes for an awesome time.", "food"], [" Ordered Nachos as a shareable plate for two and it was enough for meal plus dessert.", "food"], [" Cheesecake is super rich; like eating heaven on a fork.", "food"], [" Definitely recommended for date or lunch with a friend.", "atmosphere"], ["Delicious foods and great waiters!", "food, service"], [" It's a great place to go to after you explore and shop at the Menlo Park mall.", "location"], [" They provide a bunch of different foods for everyone, even from the kids menu!", "food"], [" When you go to this place you will find great …", "food"], ["I love love love CheeseCake Factory!", "food"], [" The service is great.", "service"], [" Gotta wait a bit because they are so popular.", "none"], [" But let me tell you it’s well worth the wait.", "none"], [" And the cheese cakes are off the hook.", "food"], ["  I love that they had Mac and cheese for my son …", "food"], ["I LOVE Cheesecake Factory.", "food"], [" The only reason I didn’t give it 5 stars is because they removed one of my favorite dishes from the menu - stuffed chicken tortillas.", "food"], [" However, I still love the lemon herb roasted chicken and sweet corn cakes!", "food"], [" Always consistent and great service!", "service"], ["The service was horrible!", "service"], [" I ordered a gingerale and received it when they finally brought me my check.", "service"], [" Waited over 30 mins for appetizers and another for dinner.", "service"], [" It was our waiter more so than restaurant.", "service"], ["Food was served at different times.", "Service"], ["  I sat there while everyone at the table had food.", "food"], ["  Appetizers came out after the meals,  and the food quality was poor.", "food"], ["Went tonight with my best friend for our annual holiday Cheesecake Factory date.", "atmosphere"], [" Abby was the sweetest waitress ever!", "service"], [" Great red velvet cake!", "food"], ["I’ve been to Cheesecake Factory million of times, but this location has been the best one for delivery.", "location"], [" The cheesecake and food was perfect compared to other locations where it was sloppy without utensils or complimentary bread.", "food"], ["I visit here regularly and everytime have an awesome experience.", "Service"], [" Staff is very courteous and professional, food is absolutely delicious and desserts too, goes without saying.", "food"], [" You might have to face some very long wait times during peak …", "service"], ["Staff was friendly, food was good, appetizers were great!", "food"], [" Drinks were perfect!", "Food"], ["WARNING: Don't eat here!", "none"], [" I got food poisoning from this location twice.", "hygiene"], [" Some years back I purchased a slice of cheesecake, which I ate some of it in the car, only to discover when I got home that it had molded and I later became sick.", "hygiene"], ["I wasn't really impressed with the taste of their food.", "food"], [" I went there once before and walked away with the same feeling.", "None"], [" Didn't go back because of that but I decided to give them another shot, and walked away with the same feeling.", "Service"], ["My check number is 0773, server, Thomas V at 2151, on 10/05/12.", "none"], [" I have visited this restaurant since it opened after experiencing the food on Florida.", "food"], [" I have celebrated just about every family gathering here, birthdays, anniversaries, etc.", "atmosphere"], ["Great selection of food!", "food"], ["  Well-prepared food.", "food"], ["  The Alfredo pasta dish I had was flavorful.", "food"], [" Sometimes it seems too dark in the place to read the menu.", "atmosphere"], [" May just be my eyesight, but I wonder if it is the lighting in the place.", "atmosphere"], ["Totally pissed.", "None"], [" I frequent this restaurant location quite often and never experienced service like today.", "service"], [" I waited for 40 minutes for two pieces of cheesecake & left empty handed!", "service"], [" Cash register was out of tape so cashier was able to take …", "none"], ["Overall, cheesecake factory is a great spot.", "none"], [" A little pricey but good experience with some solid food.", "food"], [" Other day had brunch, chicken and waffles.", "food"], [" Turned out solid.", "food"], [" Quality waffle, chicken was ok.", "food"], [" Made a good dish.", "food"], [" Just a solid spot good atmosphere, never come out disappointed.", "atmosphere"], ["Sunday Brunch:  To-Go service is terrible.", "service"], ["  To-Go orders never have the same freshness, quality, and attention to detail, as Dine-In orders.", "food"], ["  The To-Go reserved parking procedures are never followed.", "parking"], ["  You have to go in and pick your order …", "service"], ["We walked in at 4:30pm on a Monday, and the woman at the desk says 30 minutes wait outside and 40 minutes inside.", "service"], [" There were plenty of empty tables outside (only 3 tables outside were busy) and inside.", "atmosphere"], [" This place is not what it used to be.", "none"], ["I called and spoke to and employee about outdoor seating.", "atmosphere"], [" Drove and hour away and when I got to the location I was told by a manager that I they could not allow me to sit outside.", "Location"], [" When I told the manager that and employee told me in advance …", "service"], ["I've been to this location several times, as I live within walking distance.", "location"], [" I have some dietary restrictions and The Cheesecake Factory goes above and beyond to accommodate them.", "food"], [" For example, I eat low carb,  and they accommodated by …", "food"], ["It was my first time going there and I don't plan on going back any time soon.", "none"], [" Visted on Sunday April 3rd and the place was like a fish market.", "atmosphere"], [" Way to much people and way to much noise.", "atmosphere"], [" After waiting for 30 min following the host to be …", "service"], ["I've always enjoyed the menu at the Cheesecake Factory.", "food"], ["  What I'm really happy about now is the fact that you can make reservations online.", "none"], ["  No mor waiting an hour for a table.", "none"], ["  Service is hit or miss, but it doesn't stop me fro going.", "Service"], ["Great food and drinks.", "food"], [" There is usually a wait but worth it.", "none"], [" They give you a buzzer so you know when its your turn to sit.", "service"], [" Its a nice meal and always finished off with an assortment of cheesecakes.", "food"], [" Many great flavors to choose from.", "food"], [" There are also other desserts.", "food"], ["Waited over 90 minutes when I was told 60 minutes.", "service"], [" Food was not good.", "food"], [" My sandwich was missing chipotle sauce and onion.", "food"], [" It didn't feel like I spend $200.", "none"], ["The food is excellent as usual!", "food"], [" Can't go wrong with that MISO SALMON my wife and I's most favorite dish from here!", "food"], [" My kids( who seem to primarily order chicken fingers and fries whenever we eat out SMH) decided to listen to their parents …", "food"], ["I don't have enough good things to say about The Cheesecake Factory.", "food"], [" This is THE #1 place my friends and I never complain about when it comes to our places we like to eat at for dinner.", "food"], [" You can never go wrong with the Louisiana Pasta, and …", "food"], ["Had an issue with my order in the morning.", "service"], [" Potatoes came to the table completely burnt( fork couldnt pierce them) waiter looked puzzled when I mentioned the issue and made me look like I was crazy saying that is how they normally come out …", "Food"], ["The wait is always insane, so keep that in mind.", "service"], [" But my bigger issue is if I'm going to wait a while, my food better be amazing.", "food"], [" We got apps to share as our meal and they werent very good.", "food"], [" One of the apps we got was the pretzel bites.", "food"], ["Fantastic", "none"], ["Me and my daughter went there for brunch and waited 15 minutes before somebody could even get us drinks.", "Service"], [" They wasn't even sure who our waiter was and then, when a manager came over because I asked to speak to him, he was very apologetic but …", "service"], ["Food was amazing service was slow felt as though I was forgotten about several times .", "Food, service"], ["however I was sitting outdoors .", "atmosphere"], ["would definitely go again", "none"], ["My burger had no taste .", "food"], [" It was a clump of tasteless meat with tasteless onions.", "food"], [" Soggy Red and horrible burger.", "food"], [" How can you mess a burger up.", "food"], [" My fries was the best part of my meal.", "food"], [" The Service was good.", "service"], ["We had the brunch menu!", "food"], ["\nThe service  and food were excellent!", "food"], ["The food was good as standard for all Cheesecake Factory restaurants but the restaurants was very dirty.", "food, hygiene"], [" The floor was sticky, and this is not the first restaurants that we notice this.", "hygiene"], [" Looks like a sad “standard”.", "atmosphere"], ["I had a bacon-bacon burger that was very decadent and very tasty.", "food"], [" Cooked as requested.", "food"], ["\nMy whisky smash was tasty as well.", "food"], ["Was our first time here at the Edison location and arrived at about 830 pm.", "location"], [" The hostess wasnt very pleasant and we waited just a few mins to be seated.", "service"], [" We had our 2 young grandaughters with us yet we had to inquire about a kids menu .", "service"], ["We were there last Sunday night 05/20/2018 at the bar , we had this bold bartender who was eating wings and holding a left over bone in front of us he n his hands and try to clean his fingers with the old napkin he might be using for last …", "Hygiene"], ["I’m really confused why it’s stated that you offer curbside…yet ask people to come in to pick up their food?", "service"], [" Try taking a child on any car ride, especially when you’re wheelchair bound, AND THEN ASKING A PERSON TO DO ALL THIS WORK TO COME …", "None"], ["Burnt tasting pretzel bites, beer that tastes like the line needs to be cleaned.", "Food"], ["  Floor underneath my table filthy.", "hygiene"], ["  Sorely underdressed Santa Fe salad with virtually no chicken.", "food"], ["  Wife's salad was a huge pile of lettuce, but her flatbread …", "food"], ["  But super crowded on Dec 29th.", "atmosphere"], ["  I love the skinnylicious menu.", "food"], ["  My friend's  chicken costellano was excellent.", "food"], ["   I had chopped chicken salad and it was good.", "food"], ["  Didn't  get to the cheesecake.", "food"], ["  And the waiter was fun.", "service"], ["Friendly, pleasant, professional servers and hosts.", "service"], [" Delicious food, especially the Avocado Eggrolls.", "food"], [" The cheesecakes are awesome, too.", "food"], [" Recommend this restaurant highly.", "none"], ["Service was horrible.", "service"], [" Our food was cold and the shrimp and chicken that l ordered was hard.", "food"], [" Ambiance looked beautiful so if you want beautiful and not good tasting food and no customer service then you can go there.", "atmosphere"], ["  The only thing that was good was the cheesecake.", "food"], ["My daughter and I had dinner here in Menlo Park!", "location"], [" Enjoyed every bite of my crabcakes and sweet potatoes fries.", "food"], [" The bread and butter was warm and delicious too.", "food"], [" Little upset they didnt have my mac and cheese balls sold out(they are to die for).", "food"], ["Really liked the decor and plethora of food options.", "atmosphere"], [" The mango keylime cheesecake was too good and so was the avacado roll for appetizer.", "food"], [" Went there on a long weekend night and so was relatively full and noisy.", "atmosphere"], ["Considering the waiter had more then one table and the wait for the entrees were wort it.", "service"], ["Our chicken dishes were served hot and nothing left on the plate.", "food"], ["The hostess was busy and pleasant under the pressure .", "service"], ["I rarely comment about prices, but $3.", "none"], ["50 for soda is ridiculous!", "food"], [" We used to go there all the time, but haven’t been there in about 1-2 years, and in general the food is good, the service is very good, but the prices on everything have gone …", "food"], ["I like the cheese cake factory and their delish avocado egg roles.", "food"], [" But I will never go back to the one in menlow park mall.", "location"], ["\nService was horrible and the food was as well.", "food"], ["Always love the food here, but there's always a wait of at least 45 mins at any time.", "service"], [" Even when you have your buzzer, check with the counter often.", "service"], [" They can tell you 20 more mins, but when it's time, they can tell you they have no record of your seating request.", "service"], [" Just check with them often.", "service"], [" Waitress was nice enough, but should address elder gentlemen as sir, not \"you.", "service"], ["\" Food excellent.", "food"], [" The wait for it was a pinch long.", "service"], [" And it wasn't very busy, got there around 2pm on a weekday.", "none"], ["Food was great although took a while to receive it is to be expected as the place is extremely busy at certain times", "Service"], ["Weren't even able to get a table, person in front of us was told a little less than an hour wait we were told over 2 hours for us.", "service"], [" I understand the wait on a Saturday but wow.", "service"], [" Otherwise I love the food", "food"], ["1st time at Cheesecake Factory, and I enjoyed it a lot  …", "food"], ["Great food, great service, great price!", "food"], ["My experience here has always been great!", "none"], [" The wait staff is very good at what it does and the food has always tasted great.", "service"], [" I've eaten at other locations for the chain but this one is the best one I've been to.", "food"], ["So delicious.", "food"], [" I will be getting this to go .", "food"], ["The cheesecake factory has become my favorite restaurant during this pandemic.", "food"], [" Delicious fresh food, my orders are Always right and food is ready to pick up on time.", "food"], ["That’s the kind of service that keeps customers coming back over and over again.", "service"], [" And I sure will continue to order from here.", "none"], [" I love The Cheesecake Factory!", "food"], ["Came with a party of 8, orders came out staggered and missing sides.", "Service"], [" Didn't have chicken.", "Food"], [" Said I would get a dinner sized replacement and got the skinny portion.", "food"], [" Disappointed.", "none"], [" I understand you might be understaffed but wait until the whole order is ready, you don't need an army to get that done.", "service"], ["Place is usually crowded so come prepared to wait!", "none"], [" The service is great and so is the food.", "food"], [" The menu selection is vast so you will find something you will love.", "food"], [" Don't forget the cocktails.", "food"], [" A great place to come with friends.", "atmosphere"], ["The food was great.", "food"], [" That said, the service below average, and worst part.", "service"], [" The utensils were dirty, and not just water stains, actually dirty!", "hygiene"], [" they had food still on them.", "hygiene"], [" My coffee cup had fingerprints on it.", "hygiene"], [" Definitely, not up to Cheesecake Factory standards.", "food"], ["Ordered some steak and was on point and a burger was really good\nDessert was fire as well just go won’t regret it !", "food"], ["Excellent service from our waiter Frederico.", "service"], [" We had a party of ten they told us it would be one hour and forty five minutes, we were seated in less than an hour.", "service"], [" Excellent food ad always", "food"], ["Overpriced small portions of cold food, staff was rude.", "food"], [" Been there 2x, 1st time was nice 2nd time made me not want to go back", "none"], ["Food and drinks were delicious.", "food"], [" Our server Maria was very friendly, courteous and on point.", "service"], ["  Great atmosphere and restaurant.", "atmosphere"], ["the best cheesecake!", "food"], ["Very slow service.", "service"], [" Waited 15 minutes for one slice of cheese cake.", "food"], [" Went there for brunch; the staff was rude and unwelcoming.", "service"], [" Had to deal with water like maple syrup, undercooked bacon and the worse of all burnt potatoes.", "food"], ["Ordered take out here a bunch of times but today was my first time dining in.", "none"], [" The food was much better and the portions def seemed bigger.", "food"], [" I had the Romano Crusted Chicken with pasta and man it was very good!", "food"], [" The chicken was nice and tender …", "food"], ["I recently had the pleasure of dining at The Cheesecake Factory in Wayne, NJ, and I must say, it was an unforgettable experience from start to finish.", "atmosphere"], [" The moment we stepped in, we were warmly greeted by the staff, setting the tone for what …", "service"], ["Very large menu with many choices.", "Food"], [" Service was good.", "service"], [" The atmosphere is very unique to Cheesecake factory.", "atmosphere"], [" Dark tables and dim lighting with a tropical or Egyptian feel.", "atmosphere"], [" Large portions which we took home.", "food"], [" Took cheesecake to go which was excellent.", "food"], [" Prices were moderate to high.", "none"], ["im not sure how this place is still in business.", "none"], [" my friends and I went for dinner and dessert and none of us finished our plates because it was all so bad.", "food"], [" I had a similar experience about a year ago but thought maybe there was a new cook …", "food"], ["I went today with my fiancee to this location to have a nice lunch like we did the first time we went there that our waiter was EXELENT.", "service"], [" Today we had a different server that decided to ID us which made us very feel unconfortable and my …", "service"], ["Had dinner with my family, As it was a weekday so we got the table immediately.", "none"], [" Staff waa very friendly and polite.", "service"], [" Liked their service.", "service"], ["I love comming to this specific location.", "location"], [" The food is always delicious.", "food"], [" I dont know if they change cooks but the food is tastier.", "food"], [" We always come back for the food and the serivce is friendly.", "food, service"], [" My family enjoys many of the plates they offer.", "food"], ["You cannot go wrong with any of their cheese cakes.", "food"], [" My personal favorite is mango lime pie.", "food"], [" And dish wise “bang bang chicken and shrimp”", "food"], ["I was on my 1hour break choose to go and eat there and as a worker myself I understand and sympathize with the fact it was a busy day I sit in the bar waited 15 minutes nobody come to ask me anything just for a white couple to walk in sit …", "Service"], ["Always have a lovely time here.", "atmosphere"], [" Food is always delicious!", "food"], ["Got long Island iced tea, steak and salmon all from the skinnylicious menu.", "food"], [" The food was ok and standard quality, and the iced tea exceeded our expectation.", "food"], [" Great brown bread as well - soft and sweet.", "food"], ["It was great spending some time together with my son.", "none"], [" The ambient was good and the food was fresh like if I make it at home.", "food"], [" We could talk without screaming, etc.", "none"], [" Overall we both had fun.", "none"], [" Look at some of the pictures and see where these come from in the cheesecake factory.", "none"], ["We had been to the Cheesecake Factory for years and never had any issues.", "None"], [" This past weekend my husband children and myself got really sick from the food.", "food"], ["  Let me tell you how we were handled.", "service"], [" We were handled as liars, and didn’t know that …", "service"], ["Flavor of food went down compare to before.", "food"], ["I received a gift card to the Cheesecake Factory from my job months ago.", "none"], ["  I had never dined or eaten from this business so of course I was excited to see what's up.", "none"], ["  The front young man was amazing.", "service"], ["  He was kind and courteous,  made sure my …", "service"], ["This is not to say we haven't had good meals here.", "food"], [" We certainly have.", "none"], [" But to spend nearly $250 for a family of 5 it wasn't worth it.", "none"], [" We went early on a Sunday evening to beat the crowd  and were seated right away which was definitely nice …", "atmosphere"], ["My Mom chose to celebrate her birthday here.", "atmosphere"], [" The 5 stars goes to Sey and the chefs who prepared our food.", "food"], [" Sey was absolutely amazing from start to finish.", "service"], [" Her customer service was top tier.", "service"], [" She was attentive to each person in our party of …", "service"], [" Hostess with short black hair on Oct 14 @ 6:15pm is the absolute worst!", "service"], [" Said our seat was ready then stranded us in the middle of the aisle without seats.", "service"], [" I was given an attitude when I asked where should we go.", "service"], [" A nice hostess …", "service"], ["Food was good.", "food"], ["  Waiter was nice  .", "service"], ["  Only he forgot couple of the request that they made", "service"], ["I went back to the Cheesecake Factory after almost 10 years away and I have to say.", "Food"], ["I was disappointed.", "none"], [" Not nearly as good as I remember it (food wise).", "food"], [" I had a burger that had a strange taste to it.", "food"], [" My kids had sliders and corn dogs to …", "food"], ["We went for breakfast.", "food"], ["  Big portions, excellent service and patience from our server.", "service"], ["  Quiet atmosphere to chat with a friend!", "atmosphere"], ["Amazing place you must go and check it out for yourself and you will understand …", "atmosphere"], ["I love the ambiance of this restaurant.", "atmosphere"], [" The service was excellent.", "service"], [" The server was kind, courteous, and patient.", "service"], ["  Everyone was happy with their food choice and taste.", "food"], [" I had the herb crusted salmon, which was tasty.", "food"], ["A pretty decent restaurant with a wide variety of food.", "food"], [" Ambience is nice and there's a lot of space, but it still gets really crowded so expect a long wait time during peak hours.", "atmosphere"], [" Food is generally delicious, and portion sizes have gotten …", "food"], ["Our waiter Lois did introduce himself and  greeted us.", "service"], [" But not once through our whole dining did  he come and ask how everything was or if we needed or wanted anything.", "service"], [" This is not good service.", "service"], ["\nFood was delicious.", "food"], ["I was there on 10-5-23 0025 table 317\nservice was great - Brian wanted to make sure we had everything we need!", "service"], ["\nbut food, wow, disgusting, worst food I ever had, we ordered chicken salad …", "food"], ["This chain has an expansive, almost overwhelming, American menu with lots of delicious appetizers, salads, sandwiches and dinner dishes.", "food"], [" Their signature Cheesecake, of course,  as well as other tempting desserts.", "food"], [" Generous portions.", "food"], ["Food is of course good for dine in .", "food"], [" Placing a takeout order was almost impossible.", "service"], [" I was trying to place a takeout order.", "none"], [" I was put on hold for 10 minutes.", "service"], [" Called back from a different line was put on hold on that line for 8 minutes.", "Service"], ["Had an excellent time last weekend at this location.", "atmosphere"], [" I would like to specifically highlight how wonderful Ferris W was.", "service"], [" He was a very professional and attentive server although he admitted new.", "service"], [" I would not have guessed it.", "none"], [" Truly made the experience!", "atmosphere"], ["I've always liked Cheesecake Factory for the longest between the food and ambience.", "food, atmosphere"], [" However, the music was sad and depressing.", "atmosphere"], [" It didn't feel relaxed or a bit upbeat.", "atmosphere"], ["First time at a Cheesecake Factory and if all of them are like this, I doubt we will return.", "food"], [" Music was horrendously loud, food was decent but pricey and service was not up to level of the food prices.", "atmosphere"], [" Service was slow, food brought out by …", "Service"], ["I'm a fan of the food and the cakes.", "food"], [" Unfortunately, we haven't a Cheesecake-Factory in Germany.", "none"], [" The light is not bright enough to read the menu and beer is too expensive in comparison to German prices.", "atmosphere"], [" This time the waiter was too quick to …", "service"], ["They get a zero for atmosphere.", "atmosphere"], [" The waiter was very nice but the food was not up to par, half the apps arrived with the entrees (waiter said he would take off the bill but didnt) and the restaurant was freezing (we can only assume that the …", "service"], ["I Went to this location to have lunch and enjoy my day with my family, but we received a different treatment, the food was excellent, but the service (waitress) was unprofessional and inappropriate, management should train their staff …", "Service"], ["The place is very nice and well kept.", "atmosphere"], [" The waiter was excellent.", "service"], [" The food is good, solid but nothing exciting or exceptional.", "food"], [" Overall still a very good experience", "none"], ["On Sundays, this CCF is good for Bergen county residents, since we get to shop in the mall afterwards.", "location"], [" This restaurant has been able to maintain the standard CCF experience that you get in other locations.", "food"], ["Not sure about all their food but I LOVE their cheesecakes.", "food"], [" I have a slice or two twice a month.", "food"], [" But this time my fresh strawberry cheesecake had the smallest berries so that made me sad but otherwise it’s always great.", "food"], [" I always ask for extra whip and they always provide!", "Food"], ["Service is alright, but the food quality needs to be better here.", "food"], [" The wait was very miniscule compared to other Cheesecake Factories, which is a plus.", "service"], [" When we were seated, our table was still dirty and greasy from the table that must've sat …", "hygiene"], ["Got the snickers and Oreo cheesecake.", "food"], [" OMG they were so delicious!", "food"], ["Went there for Singh and surprisingly they have a great brunch menu until 2pm.", "food"], [" Coffee was great and chicken and waffles as well.", "food"], ["I went here a few months ago, I believe I had the classic cheese burger.", "food"], ["  It was delicious,  it tasted just like a burger you'd get at neighbor's barbecue.", "food"], [" I'd have to say it's the best burger I've had in a long time.", "food"], [" I guess they use a …", "none"], ["I ordered the rib eye steak medium it came well done!", "food"], [" The portion was small, hardly 10 Oz.", "food"], [" My wife had the fish.", "food"], [" She said it was ok.", "none"], ["\nThe dynamite shrimp was just that: Dynamite!", "food"], [" It was fresh, crisp & a bit spicy.", "food"], [" It was delicious!", "food"], [" The avocado rolls were hot, crisp & tasty!", "food"], ["Generally a lovely meal, and it would have been five stars straight up and down but.", "food"], ["overcooked shrimp?", "food"], [" That's an amateur mistake.", "none"], [" The dumplings and stuffed mushrooms were awesome.", "food"], [" Roll those dice!", "none"], ["Our Class 67 Diva's did our October luncheon at The CheeseCake factory.", "food"], [" Our  experience didn't disappoint.", "none"], [" The food, service and pricing was fantastic.", "food, service"], ["We enjoyed our food and time there.", "food"], [" I d suggest they would add/increase Halal and Kosher meals.", "food"], [" We can't always have \"pasta without chicken\"  …", "food"], ["Updated review from my last visit on October 9th.", "none"], [" Not only was the booth dirty and floor had trash that had been sitting there I found a roach crawling on my table.", "hygiene"], [" I let the manager and waitress …", "service"], ["I went today, third time at this location and nothing has changed.", "location"], ["  If you see the images, a chair was taken from me because although we had a table of four, I had a party of three.", "atmosphere"], [" The chair was given to another table to be in …", "atmosphere"], ["Host is extremely incompetent.", "service"], [" Made multiple mistakes in one night and manager had to step and still couldn’t clean her mess.", "service"], ["Always a great place to eat.", "food"], ["  Huge menu, accommodating, and friendly staff.", "service"], ["  Gets busy on weekends and at dinner.", "Atmosphere"], ["  I would always recommend this place.", "none"], ["Fish tacos were the best.", "Food"], [" Salads there are also good.", "food"], [" Chicken Madeira isn’t worth the hype, or the whole restaurant really.", "food"], [" I’ll be sticking with mom and pop shops for now", "none"], ["Obviously overwhelmed by clientele.", "service"], [" Food arrived cold (cold french fries are a turn-off) and pasta was just warm.", "food"], [" They corrected right away but it wasn't much better.", "service"], [" Need more help.", "none"], [" Waiters are flying table to table", "service"], ["POSITIVE & NEGATIVE Review - First (1) POSITIVE: Great Location inside Willowbrook Mall w/Entrance directly from the Parking lot; While it was busy due to being Saturday night, the wait time was only half of what the Hostess estimated; …", "location"], ["We had the meatloaf mashed potatoes and corn.", "food"], [" my husband had the steak.", "food"], [" the meatloaf was too salty to eat but everything else was good and our waitress was the sweetest", "food"], ["Ordered to go the Oreo cheesecake is to die for and the buffalo fried chicken is so amazing way better than I imagined.", "food"], ["  This place never fails when I dine in but now I know they don’t fail for take out either!", "food"], [" Thank you so much for the …", "service"], ["Go here once a year, forget your diet for the night, and understand why America is fat.", "food"], [" The food is amazing, but finding any item under a thousand calories is like finding Waldo.", "food"], [" It's doable, but it's gonna take you some time.", "none"], ["We love to go to The Cheesecake Factory all the time because usually no matter what you order it is always good; this wasn’t the case with the Wayne/Willow-brook location.", "food"], [" Our food was cold and plain, our server was new, he made an effort but the service wasn’t great.", "food"], ["food wasn't great but the customer service was good.", "food"], ["Had a great lunch today, the food was great!", "food"], [" The server was very friendly and knowledgeable and once we sat down he brought out the fresh bread which was nice and warm, which I think is totally awesome!", "Service"], ["If you know the Cheesecake Factory then you know what to expect.", "none"], [" It’s a cookie cutter formula.", "none"], [" What makes each of them different are the worker and my experience was great.", "Service"], ["I ordered the Caesar salad which was decent but I didn't have a lot of stuff in it besides the lettuce.", "food"], ["  I guess I could have asked for anchovies but I didn't.", "food"], ["Im so upset I had to change my review.", "none"], [" Last night we came for dinner with my sister and brother in law.", "none"], [" They came to Jersey from GA for my Birthday weekend .", "none"], [" We Love  this restaurant so after the drive back from AC I said let's go.", "location"], ["Love this location and order take out once a month or so!", "location"], ["\n\nThe food is always fresh and tastes great!", "food"], ["Don’t waste your money.", "none"], [" The cheesecake factory is not a low budget  restaurant, however lately they’ve been serving low budget food!", "food"], [" $74 is not a little cost for Horrible service and dinner!", "service"], ["Over crowded and bland tastes for most menu items.", "Food"], [" This applies to all cheesecake factory locations.", "none"], ["The decor and atmosphere is warm and inviting.", "atmosphere"], [" The staff are pretty equal in terms of inviting or repulsive.", "service"], [" Some are really good while others are the worst.", "none"], [" My server was really good, but then he came back with an order different than what I asked for.", "service"], [" The food was blah!", "food"], [" Simply blah.", "none"], ["Great quality food, upscale atmosphere,  friendly staff, and cheesecake to die for.", "food"], ["We had a great lunch", "food"], ["Service, atmosphere, food all exceptional.", "none"], [" I really really love this place.", "atmosphere"], [" This is how you make a good restaurant Great!", "atmosphere"], [" Keep up the good work.", "none"], ["You have the perfect food menu and customer service experience.", "food"], ["Good is great, although pricey.", "food"], [" It's always crowded when I go.", "atmosphere"], [" Service is good.", "service"], [" My goto plate is the miso salmon, every time!", "food"], ["Spent $150 last night on their garbage food and was literally so disappointed in this place.", "food"], ["    Chicken romano pasta was dry as hell and so was the chicken.", "food"], ["  Had 4 madireas and the same disgusting food and dry as hell.", "food"], ["     This was the last …", "none"], ["French dip cheeseburger was a little overcooked, and the dip was too watery.", "food"], [" I tried this burger in different restaurants, and I prefer the one at Hackensack.", "food"], [" The server was on point, though, very acknowledegeable.", "service"], ["Ordered dinner and a banana cheesecake.", "food"], [" I was given a rotten banana, its smelled terrible when i opened the container.", "food"], [" Can't believe anyone wouldn't notice at the restaurant as someone would've had to cut it up and add it to the container.", "food"], ["I was bothered by a conversation I overheard between 2 staff members.", "none"], [" the host asked the waitress if she wanted a table of 9 and she said yes then she said wait what are they?", "service"], ["  the host replied a group of white people and then waitress said with a sigh of relief ok.", "service"], ["  totally uncalled for!", "none"], ["  but that's the world we live in now", "none"], ["Food was good and the servicee was great.", "food"], [" Ots best to go between 12pm to 3pm, there's not much crowd and your not rushed or waiting.", "none"], ["Jessie B our waiter was absolutely amazing.", "service"], [" He deserves to be a manager.", "none"], [" Nicest waiter I have ever had.", "service"], [" Food was great to.", "food"], [" We will be coming back.", "none"], [" Please give Jessie a raise.", "none"], ["Today I waited 20 minutes for service after being seat.", "service"], [" I was the only person seated in that  row of tables.", "None"], [" I was greated by wait staff passing by and even complimented on my hat but not served.", "service"], [" No bread, no water not one thing.", "food"], ["Appetizers and cheesecake were really good.", "food"], [" I got the fried chicken sandwich which was not really good it had no flavor unfortunately.", "food"], ["Good place to eat with your family.", "atmosphere"], [" My kids loved this place.", "atmosphere"], [" Their pastas have a variety of selection and are incredibly delicious.", "food"], [" Friendly service too.", "service"], ["Great experience, staff was very kind and the food was spot on.", "food"], [" Always can rely on cheesecake to provide you with a very high standard of quality, thank you!", "food"], ["Came in around 12.", "none"], ["00 pm there was a 10 min wait, but a bunch of tables available.", "none"], ["    When it 7 min for a server to initiate service, then  took 1 hr to get food after ordering.", "Service"], ["Servers are on point , they frequently  check back to make sure everything is going well .", "service"], ["\nI ordered a factory  burrito   had to take it home .", "food"], [" Still had a great taste even then !", "food"], ["Amazing food creation, reasonable prices, and excellent service.", "food"], ["Friends catching up with each other and having fun, fantastic brunch, very amicable waitress, excellent service.", "atmosphere"], ["a franchise like this with such horrible food serving customers anyway without the affection and standard that is the proposal and better to close yesterday mother's day was the day of nervous in this place I changed the plate twice and …", "food"], ["I ordered take out almost 6 months ago.", "none"], [" The order was very wrong.", "food"], [" Couldn’t eat the food.", "food"], [" Spoke with a manager who said I would receive a gift card via email or mail.", "none"], [" I have not received the gift card yet.", "none"], [" If they promise you a gift card for …", "none"], ["I went in at an odd time, 4pm.", "none"], [" Of course, it was not packed and I was seated immediately.", "none"], ["  Waiter was very nice and my Neal was good.", "food"], [" I had the California Chopped Salad.", "food"], [" Plenty to eat and the bread, as always,  was very lovely ( too lovely TBH ).", "food"], ["I went here with my daughters on a Thursday evening and had such an unenjoyable experience.", "none"], ["  This Cheesecake Factory in Willowbrook Mall has really become gross.", "hygiene"], ["We went there last week for dinner.", "none"], [" We are vegetarian and specifically told them no meat and no fish.", "food"], [" It took them forever to serve and our dinner and came with chicken and bacon.", "Service"], [" We accidentally took bites before realizing the weird test.", "food"], ["I got the sprite.", "none"], [" Southwest chicken club with fries and avocado spring rolls.", "food"], [" The avocado rolls were the best thing i got.", "food"], [" I was part of a party of five.", "none"], [" My friends got the godiva cheesecake.", "food"], [" Total bill $130 not including tip.", "none"], [" The waiter …", "service"], ["Good food, good service.", "food, service"], [" In the expensive side, but I guess you get what you pay for, right?", "none"], ["Food is very good had salmon.", "food"], [" Took pumpkin cheese cake home for dessert.", "food"], ["It's always a pleasyre to eat at the Cheesecake Factory.", "food"], [" I live in France and there is no CCF :( Every year when I come in Wayne for vacations we come with my family to have perfect lunch and dinner.", "food"], [" We love the avocadoes egg rolls", "food"], ["Very attentive waiter.", "service"], ["was delicious.", "food"], ["  Generous portions.", "food"], ["\n6/20/22 they do not have the pork chop anymore.", "food"], [" I tried the steak quesadilla.", "food"], ["Menu is attractive to all nationalities.", "food"], [" Always a wonderful experience dining there.", "atmosphere"], [" Excellent food and the best cheesecakes.", "food"], [" Nice wine, beer, cocktails, drink selection.", "food"], [" So much to choose from.", "food"], [" You won't be disappointed going here.", "none"], ["Oh Cheesecake factory.", "food"], [" Where do I begin?", "none"], [" The free bread they give you at the beginning is awesome (especially the dark one!", "food"], ["), The menu is extensive, overwhelmingly so, yet, the waiters know it like the back of their hand, impressive.", "service"], ["Still one of my favorite places to eat.", "food"], [" The service is awesome and the food is great especially the burgers", "food"], ["Honestly this place is not good anymore they already feel confident with the name and how big is it but they stop caring about the food quality or treating the customer I am not coming here again!", "service"], [" took my mother-in-law here for her birthday and she loved it", "atmosphere"], ["We went with friends we haven't seen in 4 years.", "none"], [" Great time.", "atmosphere"], [" Service and food was excellent and of course Cheesecake!", "food"], ["I rate this place more than five stars.", "none"], [" Waiters are very pleasant and professional.", "service"], [" I ordered mango key lime cake, low Licious cheesecake, caramel macchiato, cappuccino and caffè latte.", "food"], [" The Mango key lime was a mind blowing, it was tremendous.", "food"], ["Insider tip, cheesecake factory has a great happy hour from 4-6 every weekday.", "food"], [" Certian drinks and appetizers are currently priced at $6.", "none"], [" The portions are huge, so two people with two appetizers will usually take some home.", "food"], ["Excellent service, delicious food and a menu for all kind of people.", "food"], [" I went for my 19 birthday  and they give me a warm welcome amd them they sing me happy birthday.", "atmosphere"], [" To sum up the experience was wonderful.", "atmosphere"], ["I have always loved the food at other locations.", "food"], [" But this time some of our orders were unedible.", "food"], [" Whoever was in the kitchen must like salt and a lot of it.", "food"], [" The chicken marsala had burned mushrooms on the pasta and the sauce was so salty you …", "food"], ["Food is always excellent at the   factory.", "food"], [" The server was attentive.", "service"], ["THE FOOD ,SERVICE AND  ATMOSPHERE WAS AMAZING ,I LOVE THE CHEESECAKE FACTORY  …", "food, service, atmosphere"], ["This location never disappoints.", "location"], [" What made it stand out to me, though, was our server Jesse’s attention and care to our table.", "service"], [" We went in for brunch and right off the bat he was very welcoming and attentive.", "service"], [" I got the fried chicken and …", "food"], ["The lasagna verde was exceptional!", "food"], [" Overall great service and friendly staff.", "service"], ["Taking food out to go is a major disappointment .", "food"], ["  The amount of food is like a lunch portion and the presentation was horrible.", "food"], ["   Not happy all.", "none"], ["  This is the grilled steak medallion for about $20.", "food"], ["  Mind you I didn't even eat it.", "none"], ["Food took a while and came out burnt.", "Food"], [" Paid $70 for a burnt food in Cheesecake factory ‍.", "food"], [" I had to cut the outsides to eat.", "Food"], ["Went out with friends who have two kids- a toddler and newborn.", "None"], ["  Very patient and accommodating.", "service"], ["  Food, of course, was delicious too!", "food"], ["Good food, reservations systems kinda unorganized", "food"], ["My favorite brown bread here  and I like food, but my shrimp was spicy for me this time.", "food"], [" but I didn't find anything spicy in the ingredients when I read it.", "food"], ["Food was good and service was quick and friendly.", "food"], [" Our server's name was Steph and overall it was a great relaxing experience", "service"], ["Just know what you want.", "none"], [" otherwise, your food will taste salty  …", "food"], ["Food there is on point.", "food"], [" Portion size is just right.", "food"], [" And omg you need to try there cheesecake slices and cake slices.", "food"], [" It's a little expensive for a slice but trust me it's worth every penny.", "food"], ["  This place is part of willowbrook mall with …", "location"], ["Usually better, today not so much.", "food"], [" Lunch staff seem lazy, waited 30 minutes for my lunch to come out, taste was bland, and any barely shrimp on the plate.", "service"], [" I ordered the dinner meal but feels likes I spent too much for todays meal.", "none"], [" Disappointed in every way.", "none"], ["They Ran Out Of Meatballs….", "food"], [" I’m so upset!", "none"], ["\nHOWEVER, and after another 30mins to adjust my tastebuds and make another less appetizing selection than the sketti and meatballs I came for- I settled for the …", "food"], ["This restaurant is a 5 star all around!", "none"], ["  No matter what you order, it's always  good.", "food"], ["Awesome food , friendly service and so much variety !", "food"], ["It hurt to give it 2 stars , food quality was above average but since 2020 quality all around has gone down.", "food"], [" Service is mediocre which I accept but food came out cool and drinks were nonexistent.", "Food"], [" Then after the movie went back to get …", "none"], ["Food was delicious, I don't remember the exact name of the dish I got but I think it was the spicy chicken chipotle pasta off the lunch menu.", "food"], [" It was really flavorful but not enough spicy as it was more of an after taste of spicy.", "food"], ["Clean place with fast service for take out dine in usually 1 hour wait.", "service"], [" The veggie burger is really good.", "food"], ["Such a great stuff.", "none"], [" They know exactly the orders that you order from them and they get it right all the time.", "service"], [" Great atmosphere and especially awesome food.", "food"], [" How do you recommend this place?", "none"], ["Went w my husband for date night.", "atmosphere"], [" Made reservations but don't think I needed it.", "none"], [" Staff was very friendly.", "service"], [" Food was yummy!", "food"], [" Everything was brought out in a timely manner.", "service"], [" Very lovely  …", "atmosphere"], ["Great tasting cheesecakes, but very expensive.", "food"], [" Good only for the rich people.", "none"], [" Minus 2 stars.", "none"], ["1st time at this Wayne NJ location.", "location"], [" The Cheesecake was great, the server Nicole was excellent!", "food"], [" The bread was delicious also.", "food"], ["I have been coming here for years and have always ordered an iced tea.", "food"], ["  Sometimes I switch to a Diet Coke thinking its free refills.", "none"], ["  I was charged for two drinks.", "none"], ["  Josh the manager was rude and was not accommodating.", "service"], ["  It's not that I care about a $3 drink it's the fact that they did not care.", "service"], ["Was there for my daughters bday.", "none"], [" We ordered buffalo wings and they weren't done.", "food"], [" I told my kids not to eat it but they did anyway.", "Food"], ["  There was a big crawling on the booth, I'm pretty sure it was a roach.", "hygiene"], ["The food was okay, the rice I had was really dry.", "food"], ["  The steak we ordered was supposed to be medium well and they cooked it medium rare then when sent back, it was burnt.", "food"], ["  We were there during lunch and the place was really dark, I'm not old yet and I needed to use the flash on my phone.", "atmosphere"], ["  Our waitress was excellent.", "service"], ["I go to this location atleast a couple times a month, sometimes the food and service can be good but most times I leave there disappointed.", "Service"], [" I would say about 90 % of the time your food comes out cold, Looks like it sits there for awhile …", "food"], ["Hostess was friendly and efficient.", "service"], [" There were quite of few people ahead of us, but we were seated within promised time of 5 minutes.", "service"], ["\nWait staff has some to be desired.", "service"], ["I ordered the soft tacos on the Skinnylicious menu.", "food"], [" Mine was prepared gluten free because I have celiac.", "food"], [" It comes with escabeche veggies on the side, and I also got a small side of guacamole.", "food"], ["Food was ok , I had the fish and chips .", "food"], ["Served could have been more attentive seeing the place was not packed", "service"], ["Food was fresh and delicious.", "food"], [" Dining space was loud and busy, and they didn't have a booth available outside the bar area.", "atmosphere"], [" But our waiter, Charlie, was fabulous.", "service"], [" Patient and attentive.", "service"], ["Food was excellent but the server was not good.", "service"], ["  It took us 15 minutes to get the dessert menu,he never came back for our order.", "service"], ["  Finally ,After taking our order knowing he forgot about us it still was 20 minutes to get our dessert.", "Service"], ["CHANGE YOUR FRYING OIL.", "hygiene"], [" Last night, the food we ordered was barely edible; we ordered appetizer nachos that were fried in that old, rancid over-used oil…the avocado rolls, the fries, the chicken sandwich…awful, also fried in that oil.", "food"], ["Our server was very friendly and professional.", "service"], ["  His recommendations were on point.", "service"], [" Food was hot ,fresh,and tasty.", "food"], [" I had the nacho, big enough for 2.", "food"], [" Reasonably priced.", "none"], [" Will be back.", "none"], [" The manager Cole was very friendly and helpful as well as all the other staff.", "service"], ["Always consistently delicious with a huge menu of choices.", "food"], [" And yummy cheesecake too  …", "food"], ["WASN'T QUITE IMPRESSED AT ALL.", "none"], ["Unfortunately, this was not a good visit.", "none"], [" Service was excellent, but the food was awful.", "food"], [" I barely could eat it.", "food"], [" The chicken was chewy and soggy barely had sauce on it.", "food"], [" Mashed potatoes were extremely hard.", "food"], ["Always a nice experience, our server was very attentive and courteous!", "service"], ["How could you ever go wrong with The Cheesecake Factory?", "food"], ["   Food always good.", "food"], [" And the cheesecake to die for.", "food"], ["My server was Definitely new to his job hence why I didn't tell him anything and was rather kind to him.", "service"], [" Carbonara Pasta was terrible and cold they served alfredo sauce w a few peas and call it Carbonara.", "food"], [" Over priced 27$ he took forever to …", "service"], ["We took desserts only.", "food"], [" The cakes were good, but very small portions for a very high price.", "food"], ["I presented an issue to the manager Abby about my meal and she was so rude, had such a nasty attitude about it and didn't care to hear how I felt or attempt to resolve the issue.", "service"], [" I just wanna know how she's even a manager to this day.", "none"], ["Kids love this place.", "atmosphere"], [" Limited choices for vegetarians but the taste, preparation & serving size is awesome.", "food"], [" Some Desserts here are yummylicious.", "food"], [" Drinks, appetizers, food, salad, drinks.", "food"], ["they have it all.", "none"], ["Food is usually good but today it needed a little salt.", "food"], [" But it was still good", "none"], ["The mango and coconut keylime cheesecake was outstanding!", "food"], ["\n\nThe kids were very happy with the chocolate fudge cake.", "food"], [" Very generous size they shared!", "food"], ["The service was friendly and fast.", "service"], ["\nI ordered the lunch portion of the meatloaf, mashed potatoes and corn.", "food"], [" The food was very good and the portion was generous.", "food"], ["The dish was very soupy.", "food"], [" I had this many times at different cheesecake factory and it didn't look like this.", "food"], [" It tasted OK still.", "food"], [" Server was nice but was very busy.", "service"], ["Wide array of food to choose from.", "food"], [" The food is delicious and the portions are generous.", "food"], [" Service is always on point.", "service"], ["Great portions of food, surprisingly not crowded for a Friday Night", "food"], ["The only problem I have is the wait time.", "service"], [" This place is amazing otherwise.", "none"], ["A little pricey.", "none"], [" But we'll worth it.", "none"], [" Delicious food.", "food"], [" And cheesecake the best all around", "food"], ["Didn't have turkey for its sandwich.", "food"], [" Took the manager 20 minutes to tell us.", "service"], [" Received the wrong salad.", "food"], ["I ordered dinner and dessert takeout they forgot my dessert so I called explained what happened to the manager and it was taken care of I got a gift card out of it!", "service"], [" I love this place the food is very good and good customer service by all the staff!", "food"], ["Fast, friendly service.", "service"], [" They give you a lor of food for your money, and the quality is decent.", "food"], [" Lots of healthy options.", "food"], ["food and good.", "food"], ["portions, rather expensive though", "food"], ["My friend and I went here for lunch.", "none"], [" Food was excellent and our Waiter Issac went above and beyond.", "food"], [" Told us about specials, and suggested the banana cheesecake.", "food"], [" Delicious.", "food"], [" He was friendly and kept checking on us.", "service"], ["Was very underwhelmed by the dinner food, especially for the price.", "food"], [" Service was not great, but won't make the biggest deal of it because it was very busy.", "service"], [" Seems like they need for waiters.", "service"], [" The cheesecake was delicious though.", "food"], ["I wish I would have taken a picture of the Greek salad I ordered with salmon!", "food"], [" To charge over 20.", "none"], ["00 for the salad to receive a dried up corner piece of salmon is utterly ridiculous!", "food"], [" The Greek salad should have a Greek dressing and not that …", "food"], ["Always a nice place to go and eat.", "food"], [" The service is always friendly and courteous.", "service"], ["  They have great food and deserts.", "food"], ["Was a good food, great customer service and excellent place.", "food"], ["This was my second time at this location, and it was fantastic!", "atmosphere"], [" Everything was delicious and the booths make for a nice quiet area to have good conversations with friends.", "atmosphere"], [" Highly recommend this place!", "none"], ["I always go there but this time I found rotten veggies on my salmon, it is unacceptable", "food"], ["Went here for Easter brunch what a waste of money.", "food"], [" The food was absolute horrible.", "food"], [" The eggs Benedict had so much salt and paprika on it couldn’t eat it.", "food"], [" The brunch combo eggs were watery sent back eggs came back okay but the syrup that came …", "food"], ["Awesome service and great atmosphere, definitely coming back  …", "service"], ["Cheesecake factory is always a staple for us when we celebrate.", "food"], [" We love their food.", "food"], [" Went there yesterday place was packed so it was expected to have our food and drinks late and we were seated too close to a larger table, but our server was great.", "service"], ["Outrageously expensive but food was amazing", "food"], ["The service outside was o.", "service"], [" Servers aren’t too attentive but the food is still good", "service"], ["So, one of The Cheesecake Factory’s strengths is predictability and reliability; when you enter the restaurant, they all look the same and have the same menu.", "atmosphere"], [" We came for one reason only, and that was to try the avocado eggrolls that my …", "food"], ["Everything was great, from the waiter to the food.", "service"], [" I had the Jamaican Black Pepper Shrimp and it was delicious.", "food"], [" Definitely worth going back.", "none"], ["The food was not good at all, I ordered the Korean chicken never again, I wanted the signature meals but they said it was all out,the drinks was excellent , always get the wings they were delicious.", "Food"], ["I dine in and took food to go!", "food"], ["3 stars because it was the usual Cheesecake Factory interior design and menu.", "atmosphere"], ["  The waiter was attentive.", "service"], ["  But the shrimp scampi was horrible.", "food"], ["  The sauce was thick and way over seasoned.", "food"], [" It was barely edible.", "food"], [" The spinach dip had no flavor,  just bland.", "food"], [" All was disappointing.", "none"], ["If you're in the market for a subpar cake experience, the Cheap Cake Factory is the place for you.", "food"], [" In conclusion, the Cheap Cake Factory is now even less of a value than it was before.", "none"], [" The small portions and high prices make it a …", "food"], ["Ordered one of my favorite apps to go and when I got home, the zucchini fries were mushy and full of grease.", "food"], ["  I called to complain and the manager was very kind and apologetic   I was sent a giftcard the next day.", "service"], ["I loved their chicken and shrimp gumbo.", "food"], [" I had to go back 2 days later.", "location"], ["Service and food were good, but lighting too dark.", "Atmosphere"], [" We had to ask manager to lower music volume, which they did.", "atmosphere"], ["This was a nightmare.", "none"], [" Was taking a friend here for the first time praising all about its food but they disappointed a big time.", "food"], ["\nChicken Potstickers were not as good as I remember it to be, the chicken fell …", "Food"], ["Fancy and good restaurant.", "atmosphere"], [" Excentric design archutecture with great ambience to enhance your appetite.", "atmosphere"], [" With great taste of Cheesecake, make this restaurant is popular in New Jersey.", "food"], [" Beside Cheesecake, The are many various menu, most of them are signature menu with good taste, and reccommed to eat alone or with your college.", "food"], ["This is a Busy location, I  had the chicken  picata w/ angle hair pasta, it  was very bland  wouldn't  have it agin.", "food"], [" Service was  fast and friendly  but waiter disappeared  when time for check/ dessert  coffee.", "Service"], [" Wouldn't  go out of my way to …", "location"], ["Service was phenomenal.", "service"], [" I tried the jerk shrimp and chicken.", "food"], [" I recommend it but only if you like spicy food.", "food"], [" And you have to get the Cinnamon cheesecake.", "food"], ["Great selection lunch menu is good also", "food"], [" probably one of the worst reviews I will be making.", "None"], [" this was a miss all around.", "None"], [" the best part of our time at cheesecake factory was the adorable short haired African American girl my daughter and I talked to who was just amazing …", "service"], ["Excellent service, love the decor and of course, the cheesecake!", "food"], ["very disappointed with the service.", "service"], ["  We waited about 15 minutes for someone to take our drinks order, when we noticed that no one was coming, we called a girl who was passing by.", "service"], ["  when the food arrived we had no cutlery plus several minutes …", "service"], ["Everytime I visit I try something new have no complaints.", "food"], [" Portions are very very generous.", "food"], [" The fresh bread while you wait for your entree is spot on.", "food"], ["Their standards have fallen drastically.", "food"], [" ordered a pasta which wasn’t even cooked 50%.", "food"], [" The one who served showed up after 20 mins and food arrived without cutlery.", "service"], [" I would assume they have shortage of manpower.", "service"], [" I would stay away from this place in future.", "none"], ["A consistently good quality restaurant.", "food"], [" Love ordering several appetizers and sharing.", "food"], [" Such variety on their extensive menu.", "food"], [" I wish they would bring back Fresca; it was wonderful having a diet soda option other than a cola.", "food"], ["I used to love their stuffed mushrooms small plate but now they're ALWAYS over cooked, even when I send them back for this exact reason.", "food"], [" Other than that, the servers are always very attentive and the other food is always decent.", "Service"], ["I love coming here with friends.", "atmosphere"], [" It’s super casual and the food is decently priced.", "food"], [" Most importantly I don’t feel rushed and have always left happy as a customer", "service"], ["burgers were so oily and soggy and the glasses were dirty but the pasta and fries were good if you come here get the plastic cups and the service was amazing just wish that the glasses were cleaned better and the burgers werent so oily", "food"], ["My jambalaya spicy shrimp with black beans was cold and French fries was dry because was over fried and my friend  ordered shrimp scampi with angel hair the was pasta was very  cold!", "food"], ["Service is very good and the food is excellent.", "food"], ["Haven't been to cheesecake in years.", "none"], [" I used to love this place but with life and covid its been years.", "none"], [" I was excited to go back and give it a try and needless to say lesson learned will never step foot in this place.", "none"], [" I'm disgusted reading …", "hygiene"], ["The staff are wonderful and the food is delicious", "food"], ["Great place but a bit pricey for a corporate venue.", "none"], ["The restaurant is not crowded and very affordable comparing to downtown Manhattan.", "none"], ["Overall was good, a bit too loud b/c of so many people and my food was delayed compared to other 11 people ordered at the same time.", "atmosphere"], [" Still a great place to eat.", "food"], ["I like the way of how staffs are so nice especially, the person who helped us.", "service"], [" The portions are really great and it worths to eat here!", "food"], ["I can't wait to come back.", "atmosphere"], [" Service was great and no matter what you order you will enjoy it.", "food"], ["I had a late lunch/early dinner there today.", "none"], [" Jesse was our waiter.", "service"], [" I haven't had service that good in a chain restaurant in a long time.", "service"], [" Our food came out fast, I never had to ask for a refill, and our order from start to finish was exact.", "service"], ["Went here for lunch with my daughter.", "none"], ["  It was crowded but they had plenty of staff and we didn't have to wait long for anything.", "service"], ["  Our food was delicious!", "food"], [" And such a great variety of menu options.", "food"], [" Our waiter was great,  he himself went and …", "service"], ["If I can give this a -1 I would.", "None"], [" This was my first time ever eating in a Cheesecake Factory and the food was okay BUT the service was horrible.", "service"], [" Our food came and we had no silverware until I had to get up and ask for it then they gave me a …", "service"], ["You'll need half an hour to skim the menu, and I hope you like buttery greasy food.", "food"], ["As I’m eating a ROACH crawls out of my salad.", "hygiene"], [" The manager walked over as if this was a regular occurrence and offered the meal for free, took my information and that was all….", "service"], [" That was far beneath what I deserved for the experience.", "none"], ["Today February 19, my wife and I went for dinner, my Fish and chip was served in a burn batter and fish was dry, I ask my server , please have your chief have a quality control on what he serves, and all respect, my server should of not …", "food"], ["Traveling for work.", "none"], ["   Stopped by because I know it’s consistent.", "none"], ["     One of the best locations.", "location"], ["    Sat at the bar, excellent service.", "service"], ["   And the bartender makes mean drinks.", "service"], ["     Great job y’all.", "none"], ["The service was not good.", "service"], [" Waiter was not pleasant.", "service"], ["  They seated other families with in inches of my family on each side of our table.", "atmosphere"], [" They didn’t have the courtesy to ask if we were okay with.", "service"], [" Was not a good experience.", "none"], [" Food wasn’t the same as the other Cheesecake Factory chains.", "food"], ["  Thumbs down.", "none"], ["The food was great.", "food"], [" I had the chicken and biscuits with a side of mac and cheese and for dessert I had a slice of coconut cheesecake.", "food"], [" Everything was well seasoned and good portions but the lighting in there was horrendous.", "food"], ["Food is never as expected.", "food"], [" Will just go for the desserts from now on.", "food"], ["Turkey  burger  was  awful.", "food"], [" Dried out  like  a Hockey  puck.", "food"], ["I came here the day before Halloween last year.", "none"], [" I contacted customer service about cold food and not being given untensils and the SR II manager Sean Bailey said he couldn't help me because I contacted after leaving (I have social anxiety) …", "Service"], ["Variety and delicious dishes in one location.", "food"], [" From Thai to Spanish dishes in one place, great location at Willowbrook Mall, NJ.", "location"], ["To be true i only love deserts here.", "food"], [" The food is not that good.", "food"], ["Jesse was an excellent waiter.", "service"], [" From start to finish, we felt welcomed and we were greatly accommodated last minute.", "service"], [" He has amazing customer service and positive energy.", "service"], [" The service was great.", "service"], [" Highly recommended as a server for your next cheesecake factory visit.", "service"], ["Sat at the bar to eat.", "atmosphere"], [" We like the fact that service is usually faster at the bar.", "service"], [" If so, we leave a big tip.", "service"], ["Food is good, service could be a bit more prompt but all really nice .", "food"], [" They do not take reservations over the phone or on their website only accepting reservations on YELP.", "none"], [" Great music, nice lighting, great dessert of course if you like …", "atmosphere"], ["I went this evening with my son for dinner.", "food"], [" Our waiter asked for our drink order.", "service"], [" My son asked for water with no ice and I wanted ice with lemon.", "Error: 500, {\n  \"error\": {\n    \"message\": \"The server had an error while processing your request. Sorry about that!\",\n    \"type\": \"server_error\",\n    \"param\": null,\n    \"code\": null\n  }\n}\n"], [" My sons glass of water came out of the microwave--HOT, I had to ask for lemon again.", "Service"], ["Very clean love the atmosphere and the decor.", "atmosphere"], [" The waitress was very friendly, polite, knowledgeable about the menu and nice to my party.", "service"], [" The food was really good everyone said except for the chicken alfredo it looked like soup had no flavor …", "food"], ["This place Is simply amazing.", "atmosphere"], [" I hadn't been here in years and decided to take my queen there to eat.", "atmosphere"], [" It was a 40 min wait, but got in around 25 min.", "none"], [" I requested a booth, and they made it happen.", "service"], [" Elmer was our server , and he did an amazing …", "service"], ["Great food and service.", "food and service"], ["We just went for dessert this time (had dine in earlier as well).", "Food"], ["\n\nChocolate Lindt fudge is good however size has reduced and price has increased.", "food"], ["\nTaste was good", "food"], ["Hostess extremely rude and Sean who seems to be the manager would not give name of rude hostess.", "service"], [" I have worked in this type of establishment and one as a hostess need to know how to work in this business.", "none"], ["My server was amazing and mad a good drink suggestion for me.", "service"], [" So mad I don't remember her name.", "none"], ["Great chicken Parm panini with French fries.", "food"], [" The waiter was so courteous and attentive.", "service"], ["Great location in Willowbrook Mall with outside dining too.", "location"], [" I ordered lunchtime grilled salmon with broccoli and mash.", "food"], [" The one great thing about Cheesecake Factory, they are very consistent with quantity and quality.", "food"], [" If I had a comment, it …", "I apologize, but your comment is incomplete. Please provide a complete comment and I will be able to assist you in labeling its topic."], ["The place use to be great, the quality has been terrific over the last few months.", "food"], [" Today I got a pasta dish that had a few drops of sauce on it, noodles were mostly dry.", "food"], [" And mozzarella stick that didn't have any cheese in them from being …", "food"], ["Went for lunch with my wife.", "none"], [" Was promptly seated and was just left there.", "service"], [" Not even water.", "food"], [" Wasn't crowded at all.", "atmosphere"], [" Started to sit at the bar when I ultimately decided to leave and patronize another local eatery.", "none"], ["Went at 4pm so not packed.", "atmosphere"], [" Very pleasant staff.", "service"], [" Food is consistent.", "food"], ["Good food and great service very nice atmosphere .", "food"], ["affforadable with in your budget.", "food"], ["I went here this afternoon for lunch with my boyfriend to celebrate a small career win.", "atmosphere"], [" There was no wait and it wasn’t that busy for a Saturday on Memorial Day weekend.", "none"], [" We had two different servers that didn’t introduce themselves.", "service"], ["Food was good and service was pleasant.", "food"], [" My friend ordered steak, mashed potatoes and broccoli and the broccoli was cold.", "food"], [" Steak was cooked well.", "food"], [" I tried the shrimp and garlic over angel hair and the meal was pleasantly cooked well.", "food"], [" Will be back.", "none"], [" Should have tried a slice of cheesecake.", "food"], ["Great fun upbeat place to dine.", "atmosphere"], [" Great food service atmosphere.", "food, service, atmosphere"], ["  Really nice comfortable decor and extensive menu", "atmosphere"], ["The wait staff was amazing.", "service"], [" The variety of food is incredible and (so far) it seems that everything they make is good.", "food"], [" You know how you go to a place and stay away from certain dishes?", "food"], [" Not this place.", "none"], [" Haven't been disappointed.", "none"], [" They don't have Guinness on tap but I'll give them a pass since my steaks come out perfect every single time.", "food"], ["Food took long.", "Service"], ["  Was cold when it got to us", "food"], ["I had the pleasure of having Chelsea S.", "none"], [" as our server and she made my night out with my fiancé an even better experience.", "service"], [" Food was quick, and she made sure we were helped whenever needed.", "service"], [" Best Cheesecake Factory in the area!", "food"], ["This was maybe my third time going here and we were all disappointed with our food.", "food"], [" One of us had pasta and shrimp, the pasta was ice cold.", "food"], [" Another had fettuccine alfredo the noodles weren't cooked enough and it was so Bland.", "food"], ["Their food is always fresh and you get a great portion.", "food"], [" I always enjoy eating here the staff is friendly and they have amazing chefs.", "service"], [" Now their cheesecake BABY it will make your mouth water.", "food"], [" It's hard to find a restaurant  that has AMAZING food and desserts.", "food"], [" The lemon chicken it's to die for.", "food"], ["  Enjoy everyone stay safe!", "none"], ["Typical Cheesecake Factory with good food and great servers.", "food"], ["The chicken sandwich was like cold toast with slop inside.", "food"], [" But the Oreo cheesecake was the best cheesecake I have ever had.", "food"], [" Very expensive, but 100% get the cheesecakes.", "food"], ["The food was excellent.", "food"], [" The meatloaf and mashed potatoes with grilled corn is always a great choice.", "food"], [" Also, without any bells and whistles just order the bacon cheeseburger, the size and flavor is great.", "food"], [" All portions are huge.", "food"], [" Pricey but worth it.", "none"], [" Be ready to wait a long time to be seated.", "service"], [" Food also takes some time to come out.", "Food"], ["My husband and I came on A Friday night.", "atmosphere"], [" Our Food Came out cold.", "food"], [" We politely Asked another server to please warm it up (since ours was nowhere to be found) they came back and the plate was hotter than the food!", "service"], [" This cheesecake is honestly a mess.", "food"], [" If you can, go to Hackensack", "location"], ["love this place!", "atmosphere"], [" excellent food  …", "food"], ["The family met on time.", "none"], ["  There were ten of us.", "none"], ["  The food was okay.", "food"], ["   Nothing to make me sit up and bark but okay.", "none"], ["  Very expensive for style of foods served.", "food"], ["   My biggest grip was the place doesn’t take reservations.", "none"], ["  They had seating for us …", "atmosphere"], ["The place has big platters and is really expensive to compensate.", "food"], [" The nachos are a good staple appetizer as if any big chain should.", "food"], [" The dessert/cheesecake is really good, but I think It falls short compared to homemade.", "food"], [" I personally really …", "none"], ["I enter The Cheesecake Factory on November 24, 2021.", "none"], [" The food was horrible.", "food"], [" It was cold and when they warmed it over they burned my chicken.", "food"], [" I ended up paying a bill of $53.", "none"], ["00 that I shouldn't have paid for.", "none"], [" The desert consisted of …", "food"], ["Our server \"Sey\" was amazing.", "service"], [" Super attentive and very nice.", "service"], [" Food was super delicious and the atmosphere was awesome.", "food"], ["Food was great .", "food"], [" The selection is even better.", "food"], [" Unfortunately we felt like we were rushed.", "service"], [" I'm an honest reviewer not a complainer so with that being said.", "none"], [" The waiters and waitresses should really give people space when customers are eating.", "service"], ["I’m rating one star because I have to give a star rating.", "none"], [" However, if I had a choice I would never even give anything over 0 stars.", "none"], [" I would NOT recommend coming here at all.", "none"], [" I made a reservation a day ahead of time for a 7:15 reservation.", "none"], ["The food was horrible….", "food"], ["don’t order any pasta dishes here.", "food"], ["\nI order the bistro shrimp pasta, and the pasta was clumpy and cold.", "food"], [" Basically zero taste.", "food"], [" The pasta is previously prepared (god knows who long ago) and then frozen.", "food"], [" It’s a basic idea that when you order a dish that it is freshly made.", "food"], ["My husband & I went for the 1st time last night and all I can say is \"it was delicious\".", "food"], [" Right from when our server came to our table, he was very friendly & knowledgeable.", "service"], [" I love the decor & the atmosphere.", "atmosphere"], [" We felt very comfortable.", "atmosphere"], ["Grill avocado sandwich and fries after I picked red velvet cheesecake omg was that good.", "food"], [" There were alot of people but what do u expect when going about 9pm at night.", "atmosphere"], [" But I did get called for my table within 20 mins other times it would be an hour or more.", "service"], [" So I can't complaint.", "none"], ["We always like coming here for a no fuss no muss casual meal.", "atmosphere"], [" Wide menu selection, good drinks.", "food"], [" We keep coming back for their wheat bread, so good!", "food"], [" There's always a wait, however and the wait can be really long depending on what time of day …", "none"], ["Great services and atmosphere as I would expect from a place of this caliber.", "atmosphere"], [" I had the pleasure of trying their Pizza style chicken parm which blew my mind.", "food"], [" Their loaded tots were fantastic as well.", "food"], [" Got my go to drink the pineapple Moscow mule and that didn't disappoint either.", "food"], [" One of my favorite locations that they have.", "location"], ["One of the busier locations but the staff is nice and handle it well.", "Service"], [" They are pretty accurate with wait time estimates as well.", "service"], [" The food quality is just like any other cheesecake factory.", "food"], [" Very surprised that portion sizes have stayed this …", "food"], ["Too corporate, mass production of food.", "food"], [" Service could be better.", "service"], [" Been to many was not impressed this time.", "none"], [" Very loud , it may have been the table we had.", "atmosphere"], [" We were seating very close to the kitchen.", "location"], ["  Menu had many options, so everybody will …", "food"], ["I love this place!", "atmosphere"], [" The food is great & the drinks are the best !", "food"], [" Definitely my safe haven  …", "atmosphere"], ["Love going there,  our waiter Kendall was very attentive, funny and didn't disappear fir too long.", "service"], ["  The food was great.", "food"], ["  I got the loaded baked potato soup and the bang bang chicken and shrimp.", "food"], ["  Both came out in a timely fashion.", "Service"], ["Waiters not friendly, service for curbside is everything but welcoming and no forks, or napkins, where put inside my togo order.", "service"], [" Disappointed", "None"], ["Longer waits both for a table and for service, but just seemed to be due to being short staffed.", "service"], [" Food was very good and cheesecake was fantastic.", "food"], [" Worst part is just that they have so many menu options, so for one person in our group that didn't know what they wanted it took them a while to decide", "food"], ["Very Wide Selection of Food and Very Good and Fulfilling Meals and the Decor is Classic a Very Beautiful Atmosphere for the Family or a Date with a Special Friend the Staff was Very Professional and Cordial.", "food, atmosphere, service"], [" I Love this Place and it was Way More of an Exquisite Night Out than I Expected.", "atmosphere"], ["Always a great place to eat!", "food"], [" Personally I love their Potato Soup, meatloaf, Shepard's pie and my husband loves the Cuban sandwich.", "food"], [" Staff is always really attentive and their tropical iced tea and bread are delicious!", "food"], [" They could use better lighting but otherwise they're fantastic!", "atmosphere"], ["Went there today .", "none"], [" Was very crowded.", "atmosphere"], ["  We got seated right away.", "none"], [" My first time there.", "none"], [" Was loving the fact that they had a skinnylicous menu.", "food"], [" I got the veggie burger and side salad.", "food"], ["  My kids enjoyed there food also.", "food"], [" Thank goodness I didn't have to look in the regular menu.", "food"], ["  To much to choose from.", "food"], ["  Will go again", "none"], ["Good place for a sandwich, a smoothie, an omelette, an espresso, a cappuccino, a TCF signature cheesecake or for any meat with a glass of wine.", "food"], [" Waiters and Waitresses are very good, courteous and pleasant.", "service"], [" This time \"Pr****us\" took good …", "service"], ["Even though it’s always packed, there’s never a wait and the food is always delicious.", "food"], [" My kids love it here and there’s something for everyone, regardless of how picky an eater one might be.", "food"], ["Great prices.", "none"], [" Great service.", "service"], [" Great ambiance.", "atmosphere"], [" Servings size.", "food"], [" Cheesecake factory always a good fall back.", "food"], [" Even tho I'm not.", "none"], [" Big chain restaurant goer", "none"], ["Food was good and only waited 10 minutes for our seat.", "food"], ["Place is too noisy and very dark.", "atmosphere"], [" My server was attentive and food came out promptly.", "service"], [" Appetizer was good.", "food"], [" But skinny Mexican salad dressing really lacked taste.", "food"], ["Cheesecake factory always seems like such a good idea, but so often leads to disappointment.", "food"], [" The food was edible, but in my opinion not worth the price.", "food"], [" The fried Mac and Cheese we ordered came out first and the sauce was burnt to the plate …", "food"], ["I ordered food to go, staff was friendly, it was a quick in and out but the food was not as flavorful as I'm used to from them.", "food"], [" I was disappointed.", "none"], [" May check back again another time.", "none"], ["The food is terrific, but the management of picking up your takeout order needs some work.", "food"], ["  There is a covered space that is outside dining in warmer weather.", "atmosphere"], ["  That should be a walk up to pick up area instead of people lining their cars up and kicking up traffic, running these poor employees car to car.", "parking"], ["Always enjoy our meals here.", "food"], [" Menu is enormous, so much to choose from.", "food"], [" Hibachi Steak is absolutely worth it.", "food"], [" Some of the Skinnylicious salads are excellent, too, that's what I get on 4 out of 5 visits.", "food"], ["followed by a dessert big enough …", "food"], ["Lots of options and nice atmosphere.", "atmosphere"], [" Seating seems a bit crowded but food is great.", "atmosphere"], [" After looking thru the entire menu and you don't find anything that appeals to you, just try the avocado egg rolls!", "food"], [" Sounds weird but it's so tasty.", "food"], [" it comes with this sweet sauce that reminds me of a chutney my mom makes at home #nostalgia", "food"], ["Not a friendly place to eat.", "Service"], [" The lady behind the reservation count is extremely rude.", "service"], [" My family and I were waiting for about an hour and 20 minutes.", "service"], [" I went up to the counter to check how much longer and she proceeded to correct me and said, …", "Service"], ["I had really tasty lunch here today with delish desert.", "food"], ["The blue cheese dressing tasted like more dill than blue cheese.", "food"], [" The chopped salad was soaking in the vinegrette to the point of soggy.", "food"], [" It seemed like it was sitting and not very fresh.", "food"], [" The buffalo wings were good, but not with the dill tasting blue cheese dressing.", "food"], ["Now that the state approved in door dining,  I had to make a pit stop to this Cheesecake factory franchise!", "food"], [" I've  never been, but it was certainly on my list.", "none"], [" Due to limited seating, I felt like a VIP guest.", "atmosphere"], [" My friends and I had our own …", "atmosphere"], ["One of the best cheese cake factory I've been to.", "food"], [" The server was one of the best ones I've come across, excellent service.", "service"], [" Food was good, no complaints what so ever.", "food"], ["Our EXPERIENCE at the Cheesecake Factory was SPECTACULAR thanks to Cole, Ree and Janette.", "service"], [" Cole is such an exceptional manager in the ways in which he and Ree skillfully sat our large party of over 20 plus people.", "service"], [" They ensured our comfort …", "service"], ["Horrible and bad experience.", "service"], [" Everything started with waiting time to be called to the table.", "service"], [" They buzzed us within 10 minutes of arrival and then made us wait additional 40 minutes because they mixed the order list.", "service"], [" Then when we the waiter …", "service"], ["Wouldn't recommend terrible food that made one of us in my group sick.", "food"], [" Food was cold once it reached the table and either overseasoned or underseasoned with no flavor.", "food"], [" Service was decent though.", "service"], ["I DARE YOU to walk by the employee hallway that’s connected to the mall.", "none"], [" You will throw up and never eat there again.", "food"], [" Or maybe you’ll find yourself a little pet to take home.", "none"], [" that’s all I’ll say.", "None"], [" Last week they got fined thousands of …", "none"], ["Went there for my son’s birthday and only got to the eat chips and guac.", "food"], [" Waited over an hour for the food and it never came out.", "service"], [" Shockingly, the tables around us got their food quickly (people who were seated after us) and left and we were …", "service"], ["Poor management.", "service"], [" I had to cancel an order because the lady who was taking it wasn’t really too friendly and helpful.", "service"], [" So I told her to cancel my order and get my money back.", "None"], [" Then She said she needed a manager witch I understood.", "service"], ["The service was great and I love the food especially the cheese cake.", "food"], [" My server was great .", "service"], ["  I highly recommend this restaurant I had the chicken and biscuits it's amazing.", "food"], ["I would give this Cheesecake Factory 5 stars, but the food took soooo long.", "service"], [" We were there for almost an hour waiting for our to go order.", "Service"], [" However, I wish I knew the employee's name who helped us.", "service"], [" She was so awesome, patient, nice, and went …", "service"], ["It took to long for our food to be served 45minutes and the people next to us said the same thing.", "service"], [" And was they were there before us .", "none"], ["they food came out the same time.", "service"], [" going back to Hackensack nj food lot better", "food"], ["Tried to go to this restaurant as I've heard great things about this chain.", "none"], [" Was told it would be an hour wait.", "none"], [" Since we were staying in the area for two nights we decided to just eat at a different restaurant and try again the next day when …", "food"], ["Food was good.", "food"], [" Had the chicken pasta.", "food"], [" Everything was going great  until a kid with his mom threw up right in front of our  table.", "hygiene"], [" Check please!", "none"], [" Managment  did not offer any compensation for it and left the  towels they used to wipe it up with on the floor.", "hygiene"], ["  Not my best experience", "none"], ["I have eaten here several times and the food is always good to excellent.", "food"], [" I ate there tonight and had the bacon bacon burger (medium).", "food"], [" It was honestly one the best burgers I've ever had, and I've eaten at almost every burger joint in the …", "food"], ["Was able to be seated without waiting.", "none"], [" This depends on the time of day and also the day of the week.", "none"], [" Service was on point.", "service"], [" Very friendly and attentive wait staff.", "service"], [" Food was also very good not to mention the red velvet cake cheesecake!", "food"], [" Absolutely delicious!", "food"], ["First time eating there and I have no bad comments at all!", "none"], [" The server Andrew was excellent on point and very aware of everything needed n on time.", "service"], [" The servers work well as a team and are very professional.", "service"], [" the food was the best …", "food"], ["Never a disappointment when eating here.", "food"], [" The prices are reasonable, and the food is quality!", "food"], ["I had a delicious Piña Colada and chicken tenders with fries.", "food"], [" I'd be lying if I said they were the best chicken tenders I've ever had.", "food"], [" but they were still pretty good.", "food"], ["  The service was fantastic and it seems like they're still social distancing the tables #yay", "service"], ["This is my all time favorite restaurant.", "none"], [" It is a joy coming here every time.", "atmosphere"], [" Wait can be very long depending on time of day but the food is so good I could wait there forever!", "food"], [" Big fan of their veggie burger.", "food"], [" With so many dishes to choose …", "food"], ["Amazing food, never tried something I disliked from this place.", "food"], [" Great selection with serving sizes that don't disappoint.", "food"], [" Had an incredibly entertaining waiter who knew the menu inside and out.", "service"], [" The recommendations where spot on and quality …", "food"], ["Little disappointed in portion size for the price.", "food"], [" Quality food.", "food"], ["I added a star for the eat/in service and food that are both good.", "food"], [" As for take-out The food is good when they get your order correct.", "food"], [" My last 2 take out orders were both wrong - very disappointed - both orders were taken by management, …", "service"], ["I went to this location with my mom and We also had another Guest show up on our table  It was a COCKROACH!", "hygiene"], [" Cockroach!", "hygiene"], ["Expect to wait 50+ minutes for a table most nights.", "service"], ["  Other than that, we love this place.", "none"], ["  The menu is expansive(with options for everyone no matter what your dietary needs are)  and the cheesecake of course is definitely one reason to go …", "food"], ["Quite possibly one of the worst dining experiences I've had in recent memory.", "none"], [" After a 15 min wait for two, it took nearly an hour after being sat for us to receive a Tuscan Chicken and Ahi Tuna Salad.", "service"], [" The kitchen was abysmally slow.", "service"], ["Portions have gotten much smaller since my last visit", "food"], ["Very consistent all dishes very good.", "food"], [" Brunch is my favorite good nice service", "food"], ["Great food and great customer service.", "food"], [" yesterday was my 34th birthday and our server Charlie K deserved a gold star.", "service"], [" I recommend to everyone to try the Caramel apple cheesecake.", "food"], [" It’s very delicious and I guarantee you that you’ll want another slice.", "food"], [" Love this place.", "atmosphere"], ["Experience was mildly good.", "none"], [" Some of the food was served cold, portions were just right.", "food"], [" Wait time for a table during busy hours was about 15 minutes.", "none"], [" Place was clean like it should be", "hygiene"], ["Horrendous customer service.", "service"], [" Never going back again, it seems as if when they make mistakes, they don't care and don't try to make it right.", "service"], [" Tried to speak to the general manager and accomplished absolutely nothing by doing so.", "service"], [" Pretty sure …", "none"], ["I was disappointed.", "none"], [" I was served water in a broken glass that was leaking all over the table.", "hygiene"], [" The food was mediocre.", "food"], [" To be fair, I enjoyed the drinks.", "food"], [" I tipped out of courtesy.", "service"], ["Abby the MANAGER was the most rude person i’ve ever come across.", "service"], [" was not helpful at all when it came to my meal complaints and didn’t offer any solution", "service"], ["Went to Cheesecake Factory since we were passing through on vacation, we got seated pretty quickly and got our drinks and orders in within 10 minutes.", "service"], ["- Buffalo wings came out too dry.", "food"], ["\n- Water was never refilled.", "service"], ["\n- Plates were never cleared.", "service"], ["I normally enjoy grabbing food from this place.", "food"], [" Especially on late weekend nights, the food is good.", "food"], [" But if you're going to order to go make sure you order online.", "none"], [" I was placed on hold for 18 minutes and by the time I got to the location …", "service"], ["The food was cold, had to retun it bk 2 times and my grandsons steak was wekk done when specifically requested med.", "Food"], [" My rice was cokd and tasteless.", "food"], [" My boyfriends cheese on his burger was a clump of shredded cheese barely melted.", "food"], [" Worse experience ive had there and hostess was rude!", "service"], [" Great desserts.", "food"], [" We had our food to share because of the size.", "food"], [" The ac was too cold", "atmosphere"], ["I ordered a pretty big order yesterday for pick you and it was bland.", "food"], ["  I am so disappointed with the order because it didn't even have any salt or taste to it.", "food"], ["  I ordered the spicy jambalaya pasta and it was far from spicy.", "food"], ["The Key Lime cheesecake is absolutely stupendous!", "food"], [" Make sure you have a slice!", "food"], ["Went on a Saturday night around 6pm, less then 10min wait,  had avocado eggrolls as an appetizer.", "food"], [" They were delicious as was the awesome dipping sauce that comes with it.", "food"], [" Entree was just as good, orange chicken with rice.", "food"], [" Will definitely be back for the food n dessert.", "food"], ["We usually enjoy the Cheesecake Factory very much.", "food"], [" Took our 6 year old nephew for dinner.", "none"], [" First the waitress was nice but very slow.", "service"], [" Took a bit to get our drinks.", "service"], [" Once we did we ordered.", "none"], [" My husband got a salad and a burger, Frankie ordered …", "food"], ["One of my favorite restaurants.", "None"], ["  The last was very nice when I called, as well as when I picked up my food.", "service"], ["  It was ready very promptly!", "service"], ["Our waiter asked if we wanted bread.", "service"], [" We had told him that we don't eat bread.", "food"], [" We had ordered appetizer stuffed mushrooms.", "food"], ["  After he realized it had bread crumbs in it he had came back to tell us.", "food"], [" So appreciative about that, and for that I appreciate it soooo much.", "none"], [" Thank you for that Elmer!", "none"], [" We need more like you  …", "none"], ["Food is goos always.", "food"], [" Problem was the server who seemed to disappear on us always.", "service"], [" He never brought us bread until we asked him,  and when he did it was 2 pieces of brown bread and it was  3 of us at the table.", "service"], [" The soda refills never got to …", "service"], ["Food is good.", "food"], [" Servers a little short on time, but over all, good experience.", "service"], ["Always great food at cheesecake factory!", "food"], [" We had lunch on a Monday and there was no wait.", "none"], [" We ordered the cauliflower appetizer, lettuce wraps and the ahi tuna salad.", "food"], [" Everything was delicious!", "food"], [" Our server was super nice and attentive.", "service"], ["Food was really tasty and the service was also good.", "food"], ["My experience was totally amazing.", "atmosphere"], ["  The food was exquisite and the attention by your Waiter was exquisite.", "food, service"], ["  He was totally experienced and fun and very knowledgeable in the menu which made it easier to order.", "service"], ["  S totally awesome dining experience.", "atmosphere"], ["The food is really good but I always have a problem getting it at this place.", "food"], [" My appetizer came out quick but the impossible burger was i.", "food"], ["possible to get.", "None"], [" My waiter approached me after 20 minutes of waiting saying \" I forgot to enter your …", "service"], ["We got there at around 11pm, we ordered chicken sliders for an appetizer and drinks.", "food"], [" My bf had a charbroiled ny steak with mashed potatoes and I had combo that had chicken with cheese and a mushroom sauce, and chopped steak with a similar …", "food"], ["We had Mother's Day brunch there on a Saturday before Mother's Day and it was Perfection.", "atmosphere"], [" The server was fantastic and he couldn't have been any better suited to our large party because he was fun and engaging and accommodating and super …", "service"], ["Food was good, but service was really slow.", "service"], ["  They forgot cheese on my daughters burger and it took almost 20 minutes to fix.", "service"], ["  My wifes meal was prepared wrong and we were told it would be another 30 minutes to remake the meal.", "service"], ["  They did redeem themselves slightly be letting us keep her sides and comped her meal.", "service"], ["The food was excellent and our waitress was outstanding.", "food"], [" We gave her a big tip.", "service"], [" I hope her other customers appreciated her excellent service as much as we did.", "service"], ["This is one of my favorites.", "none"], [" The one in Willowbrook in Wayne.", "location"], [" Love the food.", "food"], [" They have anything you want to eat.", "food"], [" Their food is yummy.", "food"], [" The staff is super friendly and polite.", "service"], [" Attentive  and accommodating to our needs.", "service"], [" We always have dessert …", "food"], ["Had chicken Romano pasta lunch which was good But my waiter Edwin was amazing.", "food"], [" He was attentive and got my order to me perfectly.", "Service"], ["Cheesecake Factory has never let me down.", "food"], [" The food is always top notch, and portions are always HUGE.", "food"], [" I've ordered many different dishes, and loved each one every time.", "food"], [" Highly recommend the Louisiana Chicken Pasta.", "food"], [" I don't even need to speak about the cheesecakes, you guys already know they are bomb!", "food"], ["I just wanted to share the horrible dinner experience I encountered and the insulting resolution from management at this location.", "service"], [" While eating dinner with my family, I found an elastic band in my California Guacamole  Salad.", "hygiene"], [" I informed the …", "None"], ["Update:  Well management responded and we were there again today.", "none"], [" Cheesecake was amazing, having it to go because our meal was great for the price, filling us up and looking forward to our next visit.", "food"], ["Literally the worst Cheesecake Factory I have been to!", "food"], [" I have had more than 1 bad experience here.", "service"], [" I try to avoid it at all cost.", "none"], [" It has gotten so bad that I must leave a review.", "none"], [" They never answer the phone, and when they do they leave you …", "service"], ["Best Flatbread and Factory nachos we had in New jersey.", "food"], [" Food is good, service was okay but overall, we enjoyed our meal and without any issues, we got our drinks and food onetime.", "food"], [" We would definitely recommend this place for you to try out.", "none"], [" Factory nachos and Burger were our favorite there.", "food"], ["It was my first time in this restaurant,very good place,but  went with my family we were be set next to glass just right where the food are prepare.", "Atmosphere"], [" They were around 5 flies flight up and down.", "hygiene"], [" I put the attention to the waiters,he said he apologized.", "service"], ["An average chain restaurant.", "none"], [" Always need to wait for seats though you reserve.", "service"], [" The price is ok.", "none"], [" The service is also ok.", "service"], ["\nAnd it is famous for cheesecake, but I don’t recommend it.", "Food"], [" After finishing around half of the cake, you just want to put it away.", "food"], [" It is too much for the stomach.", "food"], ["Food was terrible.", "food"], ["  Undercooked.", "food"], ["  Waitress shouldn’t have a job in food business.", "service"], ["  Forgot everything g.", "none"], [" How are you out of sprite and apple juice.", "food"], [" Calamari tasted like rubber and oil.", "food"], [" Steak Diana had no flavor at all.", "food"], ["  Shrimp scampi?", "food"], ["  Best part of the meal was the lemon in my coke", "food"], ["Cheesecake Factory is one of my most super fav places to eat I love it but this is the first time I have ever eat at this location I'm from Delaware and the experience I have had over there 5stars always.", "food"], [" But this place was horrible waited …", "service"], ["For what is supposed to be a fine dining upscale restaurant,  the service was absolutely terrible.", "service"], ["  I’m not leaving one star because I actually feel bad doing so.", "none"], [" I have received stellar service from Applebee’s  compared to the service we …", "service"], ["Very poor customer service— and coming from a retail environment that focuses purely on customer service, it’s sad to say the least.", "service"], [" I walked up to the booth to add my name onto the waitlist and the associates were too busy talking amongst …", "service"], ["Went with my mom and daughter and I was totally upset.", "none"], [" Our food was cold so we ended up payingfor the drinks and leaving.", "Food"], [" this is not the 1st or 2nd time so I will not be returning back.", "service"], [" Neither the server or manager knew of mushrooms was …", "food"], ["Server Charlie K was excellent.", "service"], [" Very polite and attentive.", "service"], [" The food was o and k.", "food"], [" My issue with this encounter was the person behind the cheesecake counter (I don’t know her name).", "service"], [" She brought our cheesecake order to the wrong table (the …", "service"], ["Walked into the restaurant around 4 p.", "none"], ["m on a Saturday, I asked the guy if they were offering outdoor dining, there were tables outside.", "atmosphere"], [" The guy told me not today, so I placed an order for takeout.", "service"], [" When I went back in to pick up my order …", "service"], ["Im a little late because I went here almost exactly a year ago.", "none"], ["\nBut it was perfect for ME.", "none"], [" The people I was with had a few complaints about their food (they should have ordered something else then because not everything is …", "food"], ["Not what it use to be.", "atmosphere"], [" quality of the food the last few times has significantly dropped.", "food"], [" The last time they served me a eggplant parm that was so burnt that I couldn’t get the aftertaste out of my mouth.", "food"], [" I thought that is what it was …", "none"], ["We've been going to this restaurant since the first week it opened, today however, 6/5, I came across the worst server I've ever met there.", "service"], [" His name was Mike G.", "none"], [" He was the slowest guy ever and took forever for everything.", "service"], [" He took so long …", "service"], ["Great place,  good food, outstanding staff.", "food"], ["  This restaurant has an extensive menu and there isn't one thing bad.", "food"], [" They are known for their cheesecake and there are plenty.", "food"], ["get there early or call ahead because there are always crowds!", "none"], [" You won't be disappointed!", "none"], ["My daughter and her friends went to Cheesecake Factory for her birthday and I am HORRIFIED.", "None"], [" Here is a list of things that went wrong:\n1.", "Service"], [" First of all my daughter, on her birthday, got her steak tacos TWENTY minutes …", "service"], ["I took my wife for lunch on April 1, 2022\nLet's start with the questions of why the cheecake factory keeps deleting my review.", "none"], [" When setting down and waiting for our food, we noticed roaches around the …", "hygiene"], ["We came into Cheesecake Factory no later than 7:15pm.", "none"], [" We were not seated.", "service"], [" We were told an hour and a half wait to be seated at most.", "none"], [" We waited beyond that time for one table to get up for us to be seated.", "None"], [" We asked if they …", "service"], ["We used to be big fans of CCF but lately we are very disappointed.", "Service"], ["  Small portions and tastes food.", "Food"], [" We had two sandwiches for lunch, paid $15 for a sandwich that barely had any meat in it.", "food"], [" Basically a sandwich of lettuce and tomatoes.", "food"], ["  Even the fries was cold and saggy.", "food"], [" It is becoming a fast food quality.", "food"], ["Stopped in for cheesecake service was good a little slow but cheesecake slice was smaller than usual.", "food"], ["Woke up this morning  throwing up & having diarrhea after I took my family here last night.", "hygiene"], [" No one there came in with mask or had mask on.", "hygiene"], [" We came in wearing our mask & they all laughed and gave us dirty looks because of it.", "Hygiene"], [" Never will I go there again!", "none"], ["  Half booth tables isn't 6 feet apart from other parties and stuff either.", "hygiene"], ["Our waiter good.", "service"], [" Service was good and food was delicious.", "food"], [" Took a little longer for our food to come out but otherwise things were good.", "Service"], ["Awesome waiters, Fantastic food.", "food"], [" Only disappointment was little 3 year olds allowed by parents to run around, chase other little kids.", "Atmosphere"], [" I have 2 of my own, so I use either a sitter or neighbors daughter.", "none"], [" I have to much respect for others to …", "none"], ["I'll give it 3 just to be nice.", "none"], [" Waited about 2 hours .", "none"], [" not once did they come over and apologize for the long wait or give us any type of update eventhough they said it would only take 60 min which we understood it's a Saturday night in …", "service"], ["I dine in and order out from this location all the time.", "location"], [" This last time the quality of the food was unacceptable!", "food"], [" The chicken was not seasoned at all!", "food"], [" The pasta was dry!", "food"], [" They gave me old stale flattened bread in aluminum foil!", "food"], [" Just horrible!", "none"], [" I tried emailing customer service and got no response!", "service"], ["Yesterday, on 2/2/2019, I went with two other people to The Cheesecake Factory in Willowbrook Mall for the 1st time and, I have to tell you, the food was good!", "food"], [" Not only that, our server, Angeline D.", "service"], [", was superior!", "Food"], [" We even told the manager, …", "service"], ["Drink was good.", "food"], ["I order the Bistro Shrimp Pasta ‍.", "food"], [" The shrimp were mushy, no salt.", "food"], [" Pasta (spaghetti) was al dente.", "food"], [" My past 2 visits were not great.", "None"], [" I'm not certain whats happening with the menu.", "food"], [" The crab bites my friend ordered were ok.", "food"], ["Service was fast and friendly, food was delicious and good portions food arrived in a timely manner after being order definitely would recommend", "food"], ["The food was delicious and I had a nice time there but there were several cons.", "food"], [" The food here is a little oily, and maybe I had a bad waitress but the service was a bit slow.", "food"], [" It was a Thursday, half empty and trying to flag down the waitress for the check  was a 15 minutes affair evolving another waitress.", "service"], ["So I came here and there was a five minute wait which is fine but then once I got sat it literally took 10 minutes just for the waiter to come to our table and give us bread and then he immediately left without taking our drink order and …", "service"], ["Great place for lunch.", "food"], [" They have very large portions but at lunch you can get a smaller serving.", "food"], [" Although it is \"smaller\" is still quite large and very filling.", "food"], [" My favorite is Evelyn's Pasta.", "food"], [" Lunch is also an easier time to get a seating.", "location"], ["Cheesecake was fresh and delicious.", "food"], [" so many flavors I wanna try them all.", "food"], [" Food was good just a but expensive bc I almost paid $20 for a chicken ceaser salad.", "food"], [" Overall it was a good meal with a great dessert and I would go back", "food"], ["The food was really good.", "food"], ["  It was a couple years since I ate there.", "none"], ["  The service was good and prompt.", "service"], [" Will definitely go back soon.", "none"], ["Had an excellent experience at this location from start to finish.", "Service"], [" The server was very attentive to our table.", "service"], [" The food came out fast and was delicious just look at how the cheese is melted here.", "food"], [" When eating out during this pandemic a clean …", "hygiene"], ["Birthday dinners are great here.", "atmosphere"], [" The staff is amazing and the food is delicious.", "food"], ["Yet another disappointed customer.", "service"], ["\nPathetic service as Cheesecake factory Willowbrook Wayne, NJ.", "service"], ["Had ample space and yet they kept the customers wait for long.", "service"], ["Took 40 mins before someone took our drink order .", "service"], ["that was after waiting 45 mins to be seated.", "none"], [" Menu has too much salt!", "food"], [" Wait Staff was great.", "service"], [" They worked their tails off, but they were too few!", "service"], [" Front desk girls were having a \"social hour\" …", "Atmosphere"], ["Food was really good.", "food"], [" We sat at a table at the bar.", "atmosphere"], [" Bartender gave us great service.", "service"], [" Dinner for 4 $200, sort of pricey.", "food"], ["great service, great food.", "food"], [" salmon and veg was just perfecto.", "food"], ["The food was terrible like the absolute worst.", "food"], [" My quesadilla came soggy and wet completely unedible and the Alfredo pasta had barely any sauce on It and the pasta tasted like play doh", "food"], ["I’ve always loved going to Cheesecake Factory and have never had issues until a few nights ago.", "none"], [" I ordered a garlic breaded chicken dish.", "food"], [" When it arrived, I took a bite and immediately thought, “this is pretty acidic.", "food"], ["” I’d had it before it …", "food"], ["Excellent service!", "service"], [" Food excellent!", "food"], [" We had the stuffed cheddar burgers,.", "food"], [" They were very good!", "Service"], [" Mike the Manager very friendly and nice!", "service"], [" We had a question and he went out of his way to answer it!", "service"], [" Our waiter very friendly also!", "service"], ["Cheesecake Factory is 1 of my favorite eateries.", "food"], ["Great food and drinks.", "food"], ["Nice atmosphere.", "atmosphere"], ["Desserts are good also.", "food"], ["Top of the line, impeccable service by Kelvin C.", "service"], [" Went above and beyond expectations in our visit on our Friday night.", "service"], [" Was truly amazed by how fast, courteous Kelvin C was.", "service"], [" Will definitely be coming back soon.", "none"], [" Food was also great.", "food"], [" Thank you Kelvin C!", "none"], ["The service was not to good.", "service"], ["our waitress on sunday never came to ask us ahow our food was at all.", "service"], ["my Cobb salad the bacon was way over.", "food"], [" It was way to hard to eat.", "food"], ["i couldnt even enjoy my salad at all.", "food"], ["my boyfriends salad was good.", "food"], ["my daughter chicken tenders and fries where good she ssaid.", "food"], ["not going here for a cobb salad anymore.", "food"], ["Its was great!", "atmosphere"], [" Despite the hour wait time.", "service"], ["  We had a nice table in the back away from the everyone.", "atmosphere"], [" A really nice and friendly waitress.", "service"], [" And the food was tasty!", "food"], ["Ate for lunch yesterday and 2 out of 3 meals were horrible.", "food"], ["  I ordered a soup/sandwich/salad combo.", "food"], ["  The soup was SO bitter when the waiter asked me how the food was I told him about it and all he did was take the soup away.", "food"], ["  My Cesar salad …", "food"], ["Amazing atmosphere inside the restaurant and outstanding views.", "atmosphere"], [" And, the most important thing of this place is the food.", "food"], [" Too much delicious food are available at just pocket friendly price.", "food"], [" You would love this place, definitely.", "Atmosphere"], ["Today I come with my wife at 5:38pm and ordered two meals of hibachi steak and pineapple chicken and shrimp and now it’s 7:18pm and we just received our orders.", "food"], [" It took them almost 2 hours to serve our food and beside that I asked them my …", "service"], ["Dissspointed with food temperture and taste.", "food"], ["Service is kind but slow.", "service"], ["  Food is at least cooked properly, nothing soggy or burnt, but the consistent problem are the ingredients.", "food"], ["  Flavorless meats on the Cuban, dried out potatoes for the fries, flavorless crab bites, bread like a roof …", "food"], ["I recently got the California chopped salad and it was mind blowing.", "food"], [" I'm a very big salad person and it was my second time eating it.", "food"], ["Service was terrible.", "service"], [" Food was not very good or delivered timely and when we received it  was not as promised and my flat read which was delivered  to me 30 minutes after all others in my party was burnt.", "Food"], [" When I showed the waiter 20 minutes …", "service"], ["Very good for the most part.", "none"], [" Service was good and the cheesecake was good.", "food"], [" The only thing that was not so good was the burger.", "food"], [" To me it was way to thick for me and it was not cooked the way I wanted it to be.", "food"], [" But I would definitely comeback but just order something else.", "food"], ["Very cool store of the Cheesecake Factory directly at the Willowbrook Mall.", "location"], ["\nWe had a lunch here, the pricing was fine, the size of the meal was great, the taste as well.", "Food"], ["Food is not bad but don't accidentally leave anything of any value at the table.", "Hygiene"], [" It will disappear.", "none"], [" I left my pricey glass water bottle at the table and didn't notice it was missing until I returned home about 30 min later.", "none"], [" I called them at …", "none"], ["My girl and I  decided to go to cheesecake at the Willowbrook mall and it was a bad experience.", "none"], [" Our server was named Bridget and she was the worst server.", "service"], [" Our drinks never made it to the table and everyone around us that came in after us …", "service"], ["Don’t believe the hype I got the shrimp with angel hair.", "food"], [" The portion is small af and I only got 5 shrimp and they still had on their shells and feet.", "food"], [" I’m perplexed .", "none"], [" Why not clean the shrimp though.", "hygiene"], [" The bread tasted better than the pasta .", "food"], [" You couldn’t pay me to comeback here …", "service"], ["Love coming here.", "atmosphere"], [" Muy husband took me here for my birthday last Monty, Kune.", "atmosphere"], [" Crear good choices.", "food"], [" Nice services.", "service"], [" Celebración cheesecake Is an absoluto favorito.", "food"], [" Crear wotk …", "none"], ["Our food took over an hour to come out.", "service"], [" Our server never checked on us and it took over 30 minutes to get the check once we asked.", "service"], [" We had a baby with us and the slow service made this trip awful.", "service"], ["Always great food at Cheesecake Factory unlike most chain restaurants!", "food"], ["Hostess was super nasty with us.", "service"], [" When I told her we had been waiting for 30 minutes and wanted to know how much longer was the wait her reply “it’s been 29 minutes actually”.", "service"], [" Train your stuff better or get better staff.", "service"], ["We decided to try a few items and ended up throwing most of it away.", "food"], [" The chicken was overcooked, the biscuits we're dry and flavorless, the mashed potatoes were barely mashed and underseasoned, the mac and cheese was easily trumped by boxed …", "food"], ["+/\nService was good.", "service"], [" Food was as expected.", "food"], [" Manager was on site greeting and checking in with tables.", "service"], ["This is the 2nd Cheesecake Factory that I have been to in NJ and much more on par with the others I've been to in other parts of the country.", "food"], [" The wait time leaves much to be desired but that is expected and not atypical of Cheesecake …", "service"], ["Was there twice in the last week.", "none"], [" The food was delicious, the service FANTASTIC.", "food, service"], [" The bartender Charly even though busy was extremely attentive .", "service"], ["\nSecond time I tried the curbside.", "none"], [" The girl who delivered was fantastic, polite, and friendly.", "service"], ["\nDEFINELTLY BE BACK", "none"], ["All I can say is, I received a raw chicken sandwich.", "food"], [" And they literally did NOTHING to compensate us for almost poisoning me.", "Service"], [" I wish I took a picture.", "none"], [" And the wait time we were told was 2 hours, but we waited for probably 2.", "service"], ["5 if not longer.", "none"], ["Had the chicken marsala.", "food"], [" It wasn't very good at all.", "Food"], [" Chicken had no color; whole dish had no flavor.", "food"], [" The menu has changed a lot.", "food"], [" Lots of favorites no longer offered.", "none"], [" Greek salad was pretty good though.", "food"], ["the food was amazing but the waitress was rude to me and super sweet to my significant other.", "service"], [" She went so far as to some how find him on Facebook the night after and add him.", "none"], [" Needless to say we won't be returning because that was very creepy.", "atmosphere"], ["Because of COVID,  we opted to dine outside.", "atmosphere"], ["\n\nThe food was very good.", "food"], [" But the service was amazing.", "service"], ["   10 stars on service.", "service"], ["Really good place to sit down and relax with the family or for a date night.", "atmosphere"], [" Good food and service.", "food, service"], [" Always busy weekend nights so expect a wait or it to be a little loud.", "atmosphere"], ["Curbside pickup system is pretty terrible.", "service"], [" I ordered through the website for a specific delivery time, was told very directly that I would be texted when my order was ready.", "service"], [" I waited 20 minutes outside and called to ask about the status of …", "transportation"], ["First time eating at Cheesecake Factory.", "food"], [" John, who waited patiently as we worked through their extensive menu made great recommendations.", "service"], [" The Avocado rolls were AMAZING!", "food"], [" very cozy booth for two and clean restrooms.", "hygiene"], ["not sure about other locations but would highly recommend this one.", "location"], ["We picked up our order here tonight @ 6:25.", "none"], ["  Everything was cold!", "food"], ["  They gave us only the wheat bread.", "food"], ["  We specifically said we wanted 1 wheat and 1 sourdough.", "food"], ["  My salmon for $19.", "food"], ["50 was not worth the $.", "food"], ["  Never again!", "None"], ["  They won't see another dime from me!", "none"], ["Great food, good preparation, wonderful service and atmosphere and on time table availability.", "food, service, atmosphere"], ["I love cheesecake factory but for some reason the food my wife and daughter received was not good.", "food"], ["  First my daughter had the kids macaroni and cheese and it was a bowl of pasta and the sauce was literally a milk sauce NO CHEESE in it.", "food"], ["My first time was an excellent experience the food was good and the service was great.", "food"], ["Every single time i order from here (which has been multiple times) they NEVER  have the cheesecake i ordered in advance ready!", "service"], [" Although they accomodate with either a discount or a free slice i still have to wait 2 hours for my whole cake to defrost.", "food"], [" I notice this happens every time i order from this location.", "service"], ["Lucked out on a great parking spot.", "parking"], [" The food was great and service was good.", "food"], ["It says open 10 am on Saturdays on their door, yet they are closed.", "none"], [" That's so weird.", "none"], [" How is that possible?", "none"], [" I can't for the life of me figure it out.", "none"], [" I've been wondering around the mall in an existential crisis for about an hour now trying to figure it out.", "None"], ["The carne asada and the chicken with shrimp gumbo are of the hook!", "food"], ["Pretty good food with a huge selection.", "food"], [" It can get pretty crowded, so be prepared to wait at busy times.", "atmosphere"], [" The servers have been good, no complaints.", "service"], [" And obviously the cheesecake is great, if you save room for dessert.", "food"], ["The most amazing experience 1st time and cant wait to go again.", "atmosphere"], ["The food was great the prices were right the service was prompt and courteous the restaurant was clean and comfortable.", "food"], [" The menu was not huge but had a good selection of various cuisine.", "food"], ["i dont know how they run this massive operation as well as they do but it's just impressive in every aspect, i love the food, the cheesecake, service is always attentive and friendly.", "food"], [" menu is overwhelming but in a good way, keeps me coming back to try new things.", "food"], [" love the factory chop salad.", "food"], ["Finally when the cold weather came there is no longer fly infestation.", "hygiene"], ["  2 months ago I had to call a manager as there were 100 flies in the kitchen on the glass wall!", "hygiene"], ["  So gross to think that they lie eggs in people's food.", "hygiene"], [" I walked out.", "none"], [" Now it's cold so flies r out!", "hygiene"], ["Had a great Lunch w/ my husband on a Tuesday.", "none"], ["was pretty quiet when we 1st walked in, but, got busy later.", "atmosphere"], [" My husband had a Burger & fries, which he made disappear, & I had my Favorite, Thai Lettuce Wraps, a bit messy, but well worth it!", "food"], ["Yummy desserts, good food, good service.", "food"], ["  Always a pleasure.", "none"], ["  I only dislike the long wait times at all of their locations, wish they had call ahead seating or reservations.", "service"], ["prices went up and portions got smaller", "food"], ["Excellent food, beautiful place, reasonable prices.", "food"], [" For the extra star I would suggest improving the coffee and making the staff a little nicer.", "service"], [" However, a very nice experience.", "none"], [" Will definitely go back.", "none"], ["I've been there 2 times\nAfter 1 I think that something was wrong\nBut after 2 I decided to do not come again there.", "none"], ["The service seemed to be slow.", "service"], [" The pot stickers were not my favorite.", "food"], [" My mojito was not good-tasted water down.", "food"], ["  Most places give a desert for birthday person.", "none"], [" Not Cheesecake Factory.", "none"], [" They charged me for it.", "none"], [" Wont be back there any time soon.", "service"], ["Terrible food.", "food"], [" Tex mex egg rolls greasy twice.", "food"], [" Parmesan crusted chicken was not crusted.", "food"], [" It tasted like it was sitting under a hot lamp for awhile", "food"], ["I was able to go out to dinner for my birthday.", "none"], [" We were able to get an indoor table.", "atmosphere"], [" The food and server were excellent.", "food"], [" I highly recommend this restaurant.", "none"], [" Thank you for making my evening special.", "none"], ["My daughter & I always enjoy our Cheesecake outings.", "food"], [" My favvvv is the Miso Salmon.", "food"], [" And the white chocolate raspberry truffle  cheesecake is the cherry  on top of a great meal.", "food"], ["The best way to describe the Cheesecake factory is as \"Gourmet Diner\" .", "atmosphere"], [" the Diner part is only because their menu selection is so varied that you can order dessert, breakfast, dinner, sandwiches pretty much anything you can think of The …", "food"], ["Great service and great food but I had a fly that wouldn't leave my table alone!", "Hygiene"], [" I got the fried zucchini that came with ranch which was the most delicious thing I had that night.", "food"], ["New menu, delicious!", "food"], ["  Maybe somebody discovered that people who plan to eat cheesecake might like to go a little healthier and lighter before hitting the cheesecake!", "food"], ["  Chicken tortilla soup was delicious, salad was great.", "food"], ["The food was fine but or waitress just stared at us, we got another waiters attention who was great!", "service"], [" The manager said that the first one was in training.", "service"], [" Not a good excuse, train your staff to greet their tables please.", "Service"], ["Horrible curbside pickup.", "service"], [" They don't text you when food is done.", "service"], [" And the posted phone numbers don't work.", "none"], [" They had to make my food again because it was sitting a shelf to long.", "food"], [" Over one hour waiting past my pickup time.", "service"], [" Also both hottest arguing with each other.", "none"], ["Excellent food and excellent service", "food"], ["Although it was extremely busy and the wait for our party of 10 was quite long, the service, drinks and food were all great.", "service"], [" And there ARE gluten free items on the menu even though that information is not available on the website.", "food"], ["Delicious food and overall good service during lunch hours.", "food, service"], [" I wish the lighting was a bit brighter at the table, made it difficult to read the menu.", "atmosphere"], [" Overall good experience.", "none"], ["Worst cheese cake factory.", "food"], [" Please check whether you have got what you have ordered when you do a curbside pickup.", "food"], [" I drove all the way to pickup and throw it in the garbage after coming home.", "food"], [" Plus wasted 30 mins on call with them.", "service"], [" This store is definitely scammilicious.", "none"], [" Please go to Rockaway store.", "location"], ["Over priced!", "food"], [" If you have food allergies GOOD LUCK!", "food"], [" WAIT TIME TO SIT IS AROUND FORTY-FIVE MINUTES UP TO AN HOUR!", "service"], [" AFTER THAT EXTRA HOURS AT YOUR TABLE WITH LEAVING OF FOOD AN RUNNING AWAY WAITERS.", "service"], [" Your drink will run out before you will be …", "service"], [" Though let's be honest it is like that at all Cheesecake Factories.", "none"], [" You spend half your time there looking through the menu, trying to figure out which of the tons of dishes you want.", "food"], [" The service here was …", "service"], ["Delicious as always and the service at this location was spot on!", "food"], [" Luisa was our server and she was fast, attentive and polite which only makes your experience all the better!", "service"], [" One of the best locations I've been too!", "location"], ["Had a really nice dinner at the Cheesecake Factory.", "food"], [" Service was great .", "service"], [" took good care of us.", "service"], [" Try the Korean Fried Cauliflower appetizer.", "food"], [" A bit spicy (which we love) and so full of flavor.", "food"], [" The Avocado toast with the added shrimp …", "food"], ["The alfredo linguine was a little under cooked but it was good.", "food"], [" Great portion for the pasta trio.", "food"], [" Cheese cake excellent.", "food"], [" Excellent service.", "service"], ["Apart from my husband's favorite dessert no longer being on the menu.", "food"], [" The experience was fantastic.", "atmosphere"], ["If you like lemon meringue pie, you have got to try the lemon meringue  cheesecake!", "food"], [" It is delicious.", "food"], [" I do wish that the volume on the music was lower and that the lighting was a little brighter.", "atmosphere"], ["\nThe Smores Cheesecake is delicious  also.", "food"], ["I love the bread at Cheescake Factory.", "food"], [" We decided to try a new meal and we were totally satisfied.", "food"], [" I had the parmesan herb crusted chicken with mashed potatoes and string beans.", "food"], [" My husband chicken and shrimp with rice and he enjoyed his meal very much.", "food"], ["I had a awesome waiter named James.", "service"], [" He knew when to come and ask what we needed at perfect times not intrusive like most visits.", "service"], [" You have to order the habichi beef dinner with corn sucatash so good.", "food"], ["and after we had the Nutella toped …", "food"], ["3 weeks ago I went there with my husband and child.", "none"], [" They asked that how many people we are and while I was telling they did not listen anymore they just asked my name and then they saw my kid and they mad of me because of my child.", "service"], ["Crappy service, crappy food, crappy cocktails.", "None"], ["\nWaiter came to check on us only once because we were seated outside.", "service"], ["  Messed up the order.", "Service"], ["Order a week ago for pickup.", "none"], [" Tossed salad w grilled shrimp and that blue cheese dressing is to die for!", "food"], ["  All the salads are great actually.", "food"], [" Very yummy!", "food"], ["Great food.", "food"], [" A bit pricey for a casual meal, but worth it if you stop by.", "food"], [" Buffalo Blasts are a great appetizer, but big enough for a meal in itself.", "food"], ["As most of the Cheesecake factories this is also a busy place.", "atmosphere"], [" Food ( salad and steak) were excellent, sitting at the bar I enjoyed very good service.", "food"], [" If you like the Cheesecake Factory concept this place can be recommended very much.", "atmosphere"], ["Burgers are great.", "food"], [" This place smells like old milk, so we try to sit outside.", "hygiene"], [" The jumbalaya hash and eggs was very disappointing.", "food"], [" Barely any jumbalaya, tons of rice, and very little flavor.", "food"], ["On the 30th was my daughters birthday it was my 2 daughters and I, we ordered cost 120.", "food"], ["00  so so disappointed my shepherd pie meat was still red couldn't eat lemon meringue pie wasn't good the flat bread pizza was soggy the vegetable burger …", "food"], ["Pleasantly surprised by the quality of the food & the menu after/during covid.", "food"], [" Hadnt been the CF in a very long time.", "none"], [" Food tastes fresh & moist.", "food"], [" Ofcourse had to have a slice of cheese cake & it was like it was made the day I arrived.", "food"], ["Korean Cauliflower appetizer is the most amazing thing!", "food"], ["\nReally nice staff.", "service"], ["  Helped with heating up baby food for my son.", "service"], ["  No hassle whatsoever.", "none"], ["The best fish tacos!", "food"], ["Our first time at this reasturant was amazing.", "atmosphere"], [" The waiting was about 20mins and the food was great.", "food"], [" Customer service was also accommodating and fast.", "service"], [" The front desk hostess  spoke friendly but Facial expression not pleasant.", "Service"], [" The drinks was …", "food"], ["Great takeout service.", "service"], [" Even though it was busy.", "Atmosphere"], [" The bakery staff works quickly and were pleasant.", "service"], [" My order was correct and the food was delicious", "food"], ["Food taste - good; odd plating of the corn under orange chicken, rice was dry; small portions of steak and salmon, attitudes - lousy.", "Food"], [" disingenuous, condescending, aloof.", "none"], [" Atmosphere - place is a little too dark, tough for a big guy to get in & outta the booths.", "Atmosphere"], ["Food was great Cheese Cake was fabulous!", "food"], ["Omg I had blackened salmon scrumptious and the veggies string Beans and asparagus then for dessert we had the warm apple crisp with vanilla bean ice cream drisseled with caramel", "food"], ["Excellent food.", "food"], [" Can't comment on dessert because I've always been too full to eat anything after the meal.", "food"], [" Someday I'll have to take a piece of cheesecake home to try.", "food"], [" I'm confident it will not disappoint.", "none"], ["Horrible seriously as I stand here and patiently wait for my order staff making fun of customers up front.", "Service"], [" No professional behavior or Mannerism.", "None"], [" I love this restaurant but you can’t make fun of customers paying customers who is keeping your business running and all you paid!", "service"], ["We were a party of seven.", "none"], [" Some came from experiencing the Hackensack cheesecake factory and the Hackensack  franchise was much better.", "food"], [" Food came undercooked and cold in the middle.", "food"], [" Grilled cheese was stale.", "food"], ["  There were gum on the seat.", "hygiene"], ["The ambience is decent and the service is good.", "atmosphere"], [" Their food and dessert menu's will give you endless options and combinations.", "food"], ["Great food, great service.", "food"], [" My only complaint was that I had to wait about 5 minutes for the host to greet us and take us to our table.", "service"], [" Anyway I would go back.", "none"], ["Cant believe that there is someone who can say he didn’t find what to order.", "food"], [" With their (VERY) long menu, you will probably find.", "food"], [" Food is good and prices above the average.", "food"], [" The Cheesecake Factory is fun.", "atmosphere"], ["The atmosphere was great the host was very nice n funny my server was so nice,making sure everything was good, my bad experience I order crab cakes bit,dinner skinny menu salmon, veg, later I felt sick my stomach was hurting possible from the crab cakes got me sick", "food"], ["I like this Cheesecake factory but I'm always reluctant to actually buy Cheesecake because the slices are getting smaller and smaller.", "food"], [" Well my worries were confirmed as I just bought 3 slices of cheesecake and 1 slice of chocolate cake.", "food"], ["We love it here.", "atmosphere"], ["  The staff is always friendly and attentive.", "service"], ["  The food is delicious and the cheesecakes are amazing.", "food"], ["  This is our \"go to\" restaurant and we live 45 minutes away!", "Location"], ["To everyone at this location who did their best during Covid, thank you!", "none"], ["  Meatloaf, factory chopped salad and tamale cakes were the best!", "food"], ["  I know this location was short staffed and food wasn't was it was but it sure is now!", "service"], ["We go there for special occasions and always have a good time.", "atmosphere"], [" Definitely love the food there!", "food"], [" The carrot cake cheesecake is bombdigidy no doubt!", "food"], [" I grew up in the 90s .", "none"], ["what can I say!", "None"], ["I like the Cheesecake Factory.", "food"], [" This was my first visit to this location.", "location"], ["  Service was great\nhowever they failed with the meal, which was my usual.", "food"], ["   I would never present a meal to my guest that was flawed.", "food"], ["  I won't go to this location again.", "location"], ["Love this restaurant and I don't even get any Cheesecake when I go there.", "food"], ["\nMy only stupid complaint is that the menu is too big.", "food"], [" Too much to choose from.", "food"], ["takes me forever to make up my mind.", "none"], ["The Young lady who served me was a sweet heart.", "service"], [" She was very attentive and helpful,I hope all their employees are like this young lady.", "service"], ["cheesecake factory is cool, i mean they have cheesecake and my favorite Linda's chocolate cake OMG good and so rich you cant eat the whole thing in one sitting!", "food"], ["  the food however is just ok.", "food"], ["  the menu is too big and leaves much to be desired.", "food"], ["  i think they should just pick a type of cuisine and stick with it.", "Food"], ["This experience is based off of ordering a slice of cheesecake from the to go part of the restaurant.", "food"], [" Its took me 30 minutes just to get a slice of White Chocolate Rasberry truffle.", "food"], [" It was packed in the to go section but for a slice of …", "food"], ["I ordered from cheesecake the other night, and was highly disappointed again.", "food"], [" We have gotten take out twice since the pandemic hit and both times we were disappointed.", "food"], [" Food was not tasty, and all grease.", "food"], ["I don't get why this restaurant is always packed.", "atmosphere"], ["  Last week, I tried to plan a dinner for my twin children's 18th birthday.", "none"], ["  I called the Cheesecake Factory to make reservations, but they told me that they don't take reservations.", "none"], ["This place is a place I would not recommend to my worst enemy our waitress was wonderful and the service was great but the food was horrible and very pricey my sister ordered a cheeseburger called the factory burger and all it was was a …", "food"], ["This is one of my favorite restaurants to go to.", "none"], [" The menu is very large  and it had alot of variety.", "food"], ["But i have to say that the food here is amazing and the desserts are to die for.", "food"], ["i also have to say that the waiters are very kind and generous.", "service"], ["The food was delicious!", "food"], ["  Service was  good.", "service"], ["  I had the fried catfish with mashed potatoes, and golden buttered corn.", "food"], ["  The catfish was cooked perfectly, golden and crispy on the outside and tender fish on the inside.", "food"], ["  The spices on the fish …", "food"], ["Always a vibe!", "atmosphere"], ["The service was good, the food was tasty & they had gluten free items on the menu as well as desserts & the prices were reasonable.", "food"], [" Also it's located in the mall area so there are plenty of other things to do!", "location"], ["I'm really disappointed in Cheesecake factory we ordered our and the server gonna say the plate was hot but how about the food was cold it took a hour to get the food the place wasn't crowded for it to take a hour than to bring cold food burnt Brussels sprouts.", "Service"], [" The cheesecake is awesome but the food is horrible", "Food"], ["You'd think in their huge book of menu items there would be more vegetarian options.", "food"], [" I only come here when someone else picks it.", "Location"], [" It would be nice to have a vegetarian soup or special here once in awhile.", "food"], [" Alas, it will never be.", "none"], ["The food was so delicious my mouth was melting  from all that food.", "food"], ["Went here for my husbands birthday early dinner around 2:30 wait time was as expected about 25 min for a table of 5 our server was very sweet and checked on us regularly all the food came out pretty close together and they sang very nicely …", "service"], ["I'm really tired of this place.", "none"], ["if the takeout service isn't SUPER slow;then the food is crappy!", "service"], [" I luv Cheesecake Factory, but this location is turning into crap, I literally waited a 10 minutes at the counter just to pay for my order …", "service"], ["If I could give no starts I would.", "service"], [" Don't order curb side because they don't bring out the food and the phone number on the sign doesn't work.", "service"], [" Had to wait 2 hours for food and the food was burnt.", "food"], [" Service is definitely going down hill.", "service"], ["Great food and ambiance.", "food, atmosphere"], [" No complaints about service either.", "service"], [" One of the best franchise location", "location"], ["Food was meh.", "food"], [" The food was cold when it was brought to us and not really good.", "Food"], [" I expected more from the cheesecake factory.", "food"], [" I felt like it was a waste of money.", "none"], ["The experience was great.", "Atmosphere"], [" Feeds all the senses.", "atmosphere"], [" I would go again.", "none"], [" Cheesecake is delightful.", "food"], [" service was very accommodating.", "service"], [" Refreshing.", "atmosphere"], ["We attempted a family night out.", "none"], ["whoaaa this place lacks organization.", "atmosphere"], [" You have to wait 20-30 mins to receive a buzzer.", "service"], [" If you decide to stick around for an hour and 1/2hr they will shout for your party.", "none"], [" What I fail to understand is with …", "none"], ["The garlic penne with chicken and the make-your-own omelet was very good.", "food"], [" The three flavored unsweetened iced teas are good.", "food"], [" Service is good.", "service"], ["The service was excellent and the experience was incredible here at Great staff awesome drinks thanks a lot guys for making my weekend awesome.", "service"], ["Great service and the menu is amazing.", "service"], [" There cheese cake is delicious and there drinks are out of this world.", "food"], [" There  is a bit of a wait time about 15 minutes.", "none"], ["Great place to feed a big crowd since they serve everything from italian and Mexican to salads and burgers.", "food"], [" Had the quesadilla, nachos, lasagna, orange chicken, sweet corn tamales, mango keylime  cheesecake, and the banana cheesecake.", "food"], ["Great menu selection, decently priced.", "food"], [" The burgers are excellent and very generously sized.", "food"], [" Also have a great drink and beer selection.", "food"], [" Staff/bartender also very polite.", "service"], ["The service was horrible.", "service"], [" It took forever to get a glass of water.", "service"], [" Then foever to get lemons to go in the water.", "food"], [" They ran out of bread.", "food"], [" We had 5 different waiters come to our table and we still waited an hour for our food!", "service"], [" Won't be coming back here.", "service"], ["Delicious lots of very good food at reasonable prices.", "food"], [" Staff excellent.", "service"], [" Waiter was awesome", "service"], ["I was just there 4 my birthday and the server asked any special occasion that brings you here my friends says my birthday  oh ok so he wished me a happy Birthday  .", "service"], [" Then with out anybody asking him to he brought me out a dessert  and him and the other servers sang happy Birthday to me  ", "service"], ["Best ceaser salad dressing I've ever had", "food"], ["Still love the cheesecake factory for the comfort food and cheesecake but sad to see it poorly kept up.", "hygiene"]]